{"introduction":["Try to fight creeps and enemy Heroes within the attack range of your team's Towers.","Be careful when crossing the river into enemy territory.","Remember to purchase items to restore your health and mana at the start of the game.","Purchase and use Town Portal Scrolls to move around the map quickly.","There are \"Side Shops\" at the extreme east and west sides of the battlefield, where several useful items can be purchased.","Some items can only be purchased at a \"Secret Shop\".","For most heroes, the \"Ultimate\" ability can be learned at level 6, and strengthened at levels 12 and 18.","Striking the last hit on a creep or hero will earn you additional gold.","Make sure your team has a Courier to bring items to them while they are in the lanes.","Items purchased while you are away from a shop will be placed in your Stash to be retrieved later, or delivered by your team's courier.","If needed, a Color Blind option is available in the settings menu."],"universal":["Announcers and HUD Skins are shared between all players in a match. You can choose among them by pressing the Shared Content button on the left side of the Top Bar.","Remain calm. Remember: it's only a game.","You can mute rude players by going to the Scoreboard, accessed using the buttons on the left side of the Top Bar.","After you have chosen your hero, you can click on the minimap in the lower left to inform your teammates which lane you intend to use when the game begins.","Enjoyed playing with someone? Commend them by clicking on the Commend icon above their name in the Post-Game Overview.","You can hold Alt and click on an ability to inform your teammates of that ability's current cooldown status.","You can inform your teammates that an enemy Hero is missing by holding Alt and clicking on that Hero's portrait in the Top Bar.","Always be polite, especially to your teammates. People are less likely to listen to those who are rude.","Players who abandon a match will be penalized.","Anyone can buy wards, and anyone can buy the courier. If your team needs something, don't be afraid to buy it!","Be nice to new players. Everyone has to start somewhere.","Good luck. Have fun.","Hero choices matter. Many heroes can counter other heroes, and many hero combinations are far more powerful and useful than any hero is alone.","Holding Shift allows you to issue actions to be performed in a sequence.","Make your voice heard! Visit the Dota 2 Workshop and vote for the items you'd like to see sold in Dota 2.","Global Items can be added to a Shuffle list, causing a different random item to be chosen for that slot for every match.","Positive reinforcement can go a long way toward victory.","Prefer to see icons of Heroes' faces instead of color-coded symbols on the minimap? You can change this in the settings menu.","Remember to stand up and stretch between matches.","Remember: everyone has bad games. Everyone makes mistakes.","Want the minimap to appear on the other side of the screen? You can change it in the settings menu.","You can adjust how often hero voices are heard in the settings menu.","You can download your match replays from the Recent Games list in your Profile. A good way to improve is by viewing your matches from a new perspective!","You can hold Alt and click on an ability or item to inform your teammates if it is ready, on cooldown, or if you do not have enough mana to use it.","You can still use items while silenced.","Accidentally canceled your Town Portal Scroll? The settings menu has an option to require a Stop command when cancelling a Teleport.","Holding Alt and clicking on an item in an enemy hero's inventory will alert your team that the enemy has that item.","Holding Alt and clicking on your Buyback button, or on your gold, will alert your team of your Buyback status.","In All Pick, players who have not chosen a Hero before the timer expires will begin to lose their starting gold.","Dota 2 is always evolving. New features are added, new Heroes are introduced, and existing Heroes and mechanics may see adjustments. Keep up with the latest changes at the Dota 2 blog!","Be careful not to make more enemies than the five you are already facing.","If needed, a Color Blind option is available in the settings menu.","Holding Alt and clicking on an enemy Hero's health and mana bars, or your own, will inform your team of that Hero's current health and mana.","You can inform your team of active buffs or debuffs on your Hero by holding Alt and clicking on their icons - this also works on enemy heroes.","If you hold Alt and click on the Glyph of Fortification, you will inform your team of its current status. To tell your team not to use the Glyph, hold both Control and Alt while clicking on the Glyph.","Holding Alt and clicking on your respawn timer will announce your current respawn time to your team.","Use the Chat Wheel to quickly send pre-selected messages to your teammates. Chat Wheel phrases can be customized in the settings menu.","Chat Wheel messages are translated to appear in whichever language the receiving player is using.","Assign ability keys to Quickcast to use skills at the location of your mouse cursor with a single key press.","You can expose your public match data to be gathered by third parties in the settings menu.","From the settings menu you can set items and abilities to automatically cast on your Hero using a double-click on the ability icon, or with a double-tap of its assigned key.","Never give up! Killing an enemy Hero is worth more gold and experience if your team is less powerful than your opponents.","It is everyone's responsibility to try to make the Dota community a friendly and inviting place to compete.","Want to see how the pros play Dota? Check out the many Dota 2 tournaments taking place around the world. You might learn a few new tricks for your favorite hero.","You can disable auto-attacking in the options menu.","Always be nice to those who buy Wards and Couriers.","Destroying an enemy tower or barracks is usually more valuable to your team than slaying an enemy hero.","Stay calm and polite and you will have better success motivating your teammates.","Calm players almost always make better decisions.","Always be planning your next move.","Even a defeat is practice for your next victory.","Use the Hero Demo feature, available in the Heroes tab, to learn how to play new heroes, practice last hits, or design a look for your favorite hero.","You see the cast range of your spells by enabling the \"Ability Rangefinder\" in the settings menu.","Don't be afraid to experiment by playing an unfamiliar hero.","Dota is best enjoyed with friends.","Never hesitate to mute a rude player.","Try not to dwell on your mistakes. Learn from them, and move on.","Always keep an eye on your minimap.","If you are experiencing gameplay stutters when using voice chat, try going to the settings menu and turning on \"Streamlined Push to Talk\".","Four bounty runes will spawn when the game begins and respawn every five minutes.","Jungle creeps give significantly less gold bounty and experience than lane creeps.","Buildings with active Backdoor Protection can be identified by the blue barrier around the building and a the shield icon next to its health bar.","Towers, the Ancient and the Fountain provide True Sight revealing invisible units nearby. Shrines and barracks do not provide True Sight.","Siege creeps deal extra damage to towers and will target enemy buildings when possible.","If you're having trouble against a certain hero, try playing them. You will quickly learn their weaknesses.","All towers grant bonus armor to nearby allies; 2 armor for tier 1 towers, and 3 armor for all other towers.","The Muted status prevents a hero from using items.","The Silenced status prevents a hero from using abilities.","The Break status prevents the passive abilities of a hero from triggering.","A Gem of True Sight will not work when carried by the courier, or Lone Druid's spirit bear.","Healing Salves and Clarities are only disrupted by Heroes and Roshan.","Hold Alt and left click on the map to provide a contextual ping for your team mates."],"beginner":["If you notice an enemy Hero missing from your lane, tell your teammates by saying \"Missing Top/Middle/Bottom\". You may save a teammate's life!","You can level up your abilities by holding Control and pressing that ability's shortcut key.","Use Wards to reveal parts of the map and increase your awareness of the enemy team's movements.","Be sure your team has a courier to deliver your items from the shop so that you can stay in the lanes gaining experience and gold.","Sentry Wards reveal nearby invisible units as well as enemy Wards.","Roshan is much easier to kill if you reduce his Armor.","Holding shift and clicking on shop items will add them to the Quickbuy.","Striking the last hit on a tower will earn you more gold for its destruction.","The \"Safe Lane\" is the longest lane on your team's side of the river. For the Dire, this is the top lane. For the Radiant, it is the bottom lane.","The \"Hard Lane\" is the shortest lane on your team's side of the river. For the Dire, this is the bottom lane. For the Radiant, it is the top lane.","Typically, a team only needs one courier.","The movement speed bonus for having boots does not stack. No matter how many legs your chosen Hero has, you only need a single set of boots.","You can view an enemy Hero's inventory and abilities by selecting them.","It is often a good idea to carry a Town Portal Scroll.","There are many secret paths hidden in the trees, which are often called \"juke spots\". Use these to escape attacks, or to set up an ambush.","Use Dust of Appearance to reveal nearby invisible enemies.","One rune will appear in the river every two minutes, either north of the middle lane or to the south. Both Runes will spawn from 40 minutes onward.","If you have a Bottle, picking up a Rune will store it for later use. Storing a Rune will also refill the Bottle.","You can select from many player-created Builds for your Hero by using the Build Guide button on the left side of the Top Bar.","Check your minimap often! You may discover that you are about to be ambushed.","Often the best way to learn a Hero's weaknesses is to play a match as them.","Destroying the enemy's barracks will strengthen your team's creeps in that lane.","Towers can see and attack invisible units.","Be aware of your position when attacking creeps. You may wind up pushing your team's creeps, and yourself, into a dangerous location.","The Side Shops sell many useful items, including Town Portal Scrolls and the components for many types of boots.","Several cliff tops have special marks to highlight good locations to place Observer Wards.","Being near your team's fountain will rapidly restore your health and mana.","Strength increases maximum Health. Agility increases Attack Speed. Intelligence increases maximum Mana.","The Secret Shop is not actually a secret.","A \"Carry\" is a hero that gains power slowly, becoming strong late in the game. A \"Support\" hero is often most powerful early in the game, and later enhances their team's effectiveness.","As long as your Hero is near a kill when it occurs, you will gain experience.","You can temporarily fortify your structures and creeps, preventing all damage to them, by using the Glyph of Fortification. Use it wisely; it has a very long cooldown.","Using Town Portal Scrolls allows you to teleport to any allied structure. Using Boots of Travel allows you to teleport to any allied unit.","If your Courier is killed, it will return, along with any items it was carrying, after 120 seconds. Flying Courier after 180 seconds.","When using a Tango, the health regeneration is always the same regardless of the size of the tree you consume.","There are many websites and videos which can help you learn more about overall tactics, team construction, and strategies for your favorite heroes.","You can give a teammate one of your Tangoes by using them on that teammate.","You can use Healing Salves and Clarities on your teammates. Share the love!","In most modes, each player automatically earns 1 gold every 0.6 seconds, or 100 gold every minute.","Observer and Sentry Wards cannot be placed inside Roshan's pit.","Unclaimed Runes will be replaced every two minutes.","Earning gold by killing creeps is often called \"Farming\".","Dying causes a hero to lose unreliable gold and to give gold and xp to their killers. Try to avoid dying - and secure kills on enemy heroes when possible!"],"intermediate":["Starting at 40 minutes, power runes will spawn at both rune spots in the river.","Items in your backpack or stash cooldown at half the regular rate.","After Roshan has been killed, he will respawn at a random time between 8 and 11 minutes.","Neutral creeps spawn at the one minute mark, and then at every minute mark thereafter.","Some spells can be dodged by using a Blink Dagger or by becoming invisible.","Attacking from an uphill position gives you an advantage as an enemy may miss their attacks or lose you in the fog of war.","Using a Pipe of Insight will allow you to negate spell damage from enemy Heroes.","Assault Cuirass boosts the Armor of nearby teammates.","When a tower is attacking you, attack-clicking on an allied creep will reset the tower's target.","Placing a Ward or unit near a neutral creep camp can prevent the creatures in that camp from respawning at the minute mark.","Monkey King Bar will grant you accuracy, which often prevents enemy Heroes from evading your attacks even when attacking uphill.","Double-clicking your Blink Dagger will cause you to automatically blink toward your team's fountain.","You can attack allied creeps that are near death. Use this to deny your enemy the gold gained from last hits.","Magic damage can be reduced by items that grant Magical Damage Resistance.","Physical damage can be reduced by items that grant Armor.","Pure damage is not reduced by Armor or by Magical Damage Resistance.","Changing the primary stat on Power Treads can break invisibility, as well as interrupt channeled spells such as using a Town Portal Scroll.","Pulling all neutral creeps out of a camp near the minute mark will allow that camp to respawn. Use this to maximize the number of creeps you kill.","Holding Control allows you to use your Bottle regeneration on an allied Hero. Bottled Runes, however, cannot be shared.","Pinned in your base? You can still make purchases from the Secret Shop by sending your Courier there. Just be careful not to send it into the enemy forces!","When no enemy creeps are near Towers and Barracks have Backdoor Protection, which lessens the damage they take and allows them to restore their health.","Quelling Blade only inflicts its bonus damage on enemy and neutral creeps.","The Damage Blocked values on a Stout Shield, Vanguard or Crimson Guard refer to the type of Hero carrying the shield, not the type of attacker.","Dagon, Necronomicon, and Boots of Travel can be upgraded by purchasing their recipes again.","You can give a teammate a single ward by holding Control, clicking on the ward in your inventory, then clicking on your teammate.","Blink Dagger and Force Staff can be used to climb up and down cliff sides.","Use a Quelling Blade or Battlefury to cut down trees and carve your own path through the forests.","Illusions and creeps will not dispel Smoke of Deceit, only enemy Heroes and Towers will.","Holding Alt will display additional information in the descriptions of several abilities and items.","Barracks cannot reveal invisible units or wards.","Buyback has a cooldown of 8 minutes.","Each hero has a primary attribute of Strength, Agility, or Intelligence. Every point in your hero's primary attribute increases their attack damage by 1.","From his second death onward, Roshan will drop Cheese in addition to the Aegis of the Immortal. Using Cheese instantly refills that hero's health by 2500 and mana by 1500.","Hero illusions deal substantially less damage to Roshan.","Remember to check your allies' inventories before purchasing an item for its aura effect. A teammate may already have that item, and most auras do not stack.","Stun durations from different skills do not stack. You can keep an enemy stunned for longer with careful timing of your skills.","Teleports from Town Portal Scrolls and Boots of Travel are not cancelled by silences or knockbacks.","The closer a Tower is to its team's Ancient, the more gold its destruction will yield.","Using a Soul Ring will grant you extra mana even if your mana is already full.","You can destroy allied Towers when they are below 10% health. Denying a Tower gives no gold to the enemy for its destruction.","You can use a Quelling Blade or Battlefury to destroy enemy observer and sentry wards; this is especially helpful for melee units to get hard to reach wards.","Physical Damage, dealt by regular attacks, some hero abilities, and some items, can be reduced with Armor or blocked by becoming Ethereal.","Magical Damage, dealt by most hero abilities and items, can be reduced with Magical Damage Resistance or blocked by Spell Immunity.","Activating Manta Style will move you from your original position when the illusions appear. Use this to confuse enemies!","Creep denies give 20% of their gold bounty to the denier.","Use the Flying Courier's Shield wisely. It has a very long cooldown.","Ranged heroes and units have a 25% chance to miss when attacking uphill.","Roshan becomes stronger every minute, gaining additional health, damage, and armor.","Bounty Runes provide gold to the entire team regardless of which hero picks them up.","Some abilities cannot be blocked by spell immunity. Each ability's interaction with spell immunity is shown in its description.","Consider saving gold for Buyback. A well-timed Buyback can turn a desperate defense into a swift turnaround.","Illusions deal 60% less damage to enemy structures.","Farming in the jungle can be dangerous! You may want to buy and place a few wards to prevent enemy attempts to ambush you.","Each hero reaches their maximum effectiveness at a different time in the match.","If all enemy heroes have vanished from the minimap, they may be trying to slay Roshan, or setting up an ambush.","Try setting wards near the next objective your team wishes to attack.","Learning to play as a Support will make you a better Carry player. Learning to play as a Carry will make you a better Support player.","Scan will reveal if enemy heroes are in a targetted location for a brief period.","You can feed a mango to an ally by control-clicking on the mango, then on the ally.","When a Divine Rapier is dropped for the first time it cannot be used by allies when they picked it up (though it may be returned). After it has been dropped a second time, anyone can use it.","Ring of Regen and Health, Sage's Mask, Void Stone, and Perseverance are partially sharable items - their regeneration effects will work for allies when given to them.","Monkey King Bar's accuracy does not apply when attacking a building.","Most spells have a short cast animation before the effect happens. All items cast their effects instantly with no cast time.","Channeling a Town Portal Scroll will take longer if another hero has teleported to the same area recently.","Does your team have a Medallion of Courage, an Urn of Shadows or a Vladmir's Offering? It can be more effective to build items that benefit the whole team.","Tangoes are twice as effective when used to consume a ward or a tree created by an ironwood branch.","Boots of Travel are canceled if the destination unit dies while channeling.","Stacking a Neutral camp will give you a percentage of the bounty when killed."],"advanced":["Reliable Gold is earned from killing Heroes, Roshan, and Couriers, from the destruction of enemy Towers, or from using Hand of Midas. All other earnings are Unreliable Gold, which can be lost upon death.","You can pull the creatures in the neutral creep camp that is nearest to your team's Safe Lane into your lane creeps.","Several items can be broken down to their component parts by right-clicking them in your inventory and choosing \"Disassemble\". Re-use those components to create new items!","Use Control Groups to issue orders to different sets of units under your control. To set a Control Group, select a unit or units, hold Control, and press a number. To select that Control Group, press that number.","If you are about to die, press your \"Purchase Quickbuy\" key to spend your gold before it disappears!","Swapping the primary attribute on Power Treads to Intelligence can give you a little extra mana.","If you have an Armlet of Mordiggian, you can turn on Unholy Strength to temporarily raise your health by 500.  Disabling Unholy Strength will remove the added health, down to a minimum of 1 health.","When attacking with a Desolator, even the first attack will benefit from reduced armor on the target.","Activating Manta Style removes several buffs and debuffs, and will cause projectiles that are already in flight to miss.","After using Buyback, 25 seconds are added to their next death.","Cheese and the Refresher Shard can both be sold for 500 gold.","If you are within range of several auras with the same effect, only the most powerful aura will be active.","If you know you are about to die, consider entering a neutral creep camp, or going to Roshan, and letting them kill you instead. This will deny the enemy team the gold and experience earned from your death.","Melee Barracks regenerate 5 hit points per second. Ranged Barracks do not regenerate.","Shadow Blade can still be activated while channeling a Town Portal Scroll, or any channeling spell.","Switching Power Treads to Agility while healing allows your health and mana to restore slightly faster. Just don't forget to switch them back!","The Aegis of the Immortal can be attacked and denied.","Illusions grant shared auras from their original hero to nearby units.","You do not need to destroy the enemy team's barracks to damage the towers near their Ancient. Destroying barracks is optional.","Warriors summoned by using a Level 3 Necronomicon have True Sight.","The effects of Dust of Appearance can be purged.","Runes can be attacked and denied.","Cleave damage is physical damage and is mitigated by armor.","Tier 1 towers do not have backdoor protection.","Tier 2 towers' backdoor protection is disabled if an enemy creep is nearby. Each Tier 2 tower's backdoor protection is independent of the others.","All Tier 3 and 4 towers, Barracks, and the Ancient share their backdoor protection which is disabled when an enemy creep is near any part of the base.","Backdoor protection continues to be disabled for a short time even after all enemy creeps have left the area.","Blade Mail returns the same damage type as was received.","Blade Mail returned damage pierces spell immunity if the original source pierces spell immunity.","Eye of Skadi pierces Spell Immunity and cannot be dispelled.","Remember to always carry a Town Portal Scroll.","Items which generate an aura that applies to friendly creeps can be toggled off which then only applies the aura to nearby heroes. Use this to avoid pushing the lane.","Neutral creeps with a slam ability will only use it when 3 or more valid targets are in range.","Most ancient creeps have high magic resistance; it can be much less efficient to kill them with spells, compared to other neutral creeps.","Normal attacks have a 'backswing' animation that plays after the attack point. Any order will cancel this backswing animation, and can be used to chase after a target more quickly.","An enemy Hero only gains Magic Wand charges if they have vision of you when you cast a spell. You can use this to find enemy wards.","Shiva's Guard provides flying vision in an 800 unit area around the caster when cast, making it useful for scouting uphill or past obstacles.","Silver Edge and Heaven's Halberd do not pierce spell immunity, but cannot be dispelled.","If you attack a hero while 500 units or more away from creeps, they will not attack you."],"hero":{"antimage":["Magic Immunity will prevent Anti-Mage's Mana Break ability from burning mana or doing extra damage."],"axe":["Axe's Battle Hunger effect can be dispelled by last hitting a lane creep or neutral.","Axe's Berserker's Call goes through spell immunity, making it effective at locking down enemies with Black King Bar.","Using Eul's Scepter on Axe after his Berserker's Call is an effective way to mitigate damage that allies take from his Counter Helix.","Axe gains a movement speed bonus for every enemy that is currently affected by Battle Hunger. This includes enemy creeps and neutrals.","Axe's illusions, for example from the Illusion rune or Manta Style, have a full strength Counter Helix","Axe's Culling Blade can kill targets even through Dazzle's Shallow Grave or Oracle's False Promise.","Axe's Culling Blade can be used to kill the courier."],"bane":["Attacking an ally under the effect of Bane's Nightmare will release them from the Nightmare but cause you to be Nightmared instead.","Bane can cancel his Nightmare at any time, on enemy or allied units.","Bane's Nightmare gives the target a brief moment of invulnerability on cast, and can be used to mitigate the amount of incoming damage to allies.","Bane has a lot of single-target abilities, making Linken's Sphere and Lotus orb very effective when used against him.","If used before the target uses Black King Bar, Bane's Enfeeble will persist even through the dispel and can be a very powerful spell against enemies that rely on physical attacks."],"bloodseeker":["It is possible to use a Town Portal Scroll while Ruptured by Blood Seeker without taking further damage.","Bloodseeker apply Bloodrage to enemies that will further increase the damage they take from all attacks. However it will also increase their attack damage, so should be used very carefully.","By casting Bloodrage on an ally, bloodseeker can help them heal quickly by killing nearby creeps.","Bloodseeker's Bloodrage increases damage from abilities and items, such as Blood Rite and Rupture, as well as physical attacks.","Linken's sphere will block Bloodseeker's Rupture, and may be a worthwhile investment on certain heroes facing Bloodseeker.","Despite not costing any mana, Bloodseeker's Bloodrage will increase charges on Magic Stick or Magic Wand that can be very useful against him during the laning stage of the game.","Bloodseeker's Thirst allows him to exceed the normal limit of 550 move speed.","If you have enough HP, blademail can be very effective at turning Rupture against Bloodseeker."],"crystal_maiden":["Crystal Maiden's Frostbite, like other roots, can be used to interrupt an enemy channeling Town Portal Scroll.","Crystal Maiden's Crystal Nova provides a small amount of vision on the ground where it is targeted, and can be very useful when scouting areas that are hidden or searching for enemies trying to run away in the trees.","Like most roots, Crystal Maiden's Frostbite can be countered by using dispel from items like Eul's Scepter or Manta Style.","Crystal Maiden's level 15 mana loss reduction talent for Arcane Aura works against enemies that rely on mana burn for damage, such as Anti-Mage or Nyx Assassin."],"drow_ranger":["Drow Ranger's Frost Arrows will not draw creep aggro if cast manually rather than auto-cast during an attack. You can use this to harass in lane.","Drow Ranger's Gust does not disable enemy units or cancel channeling items such as teleport scroll. Enemy heroes that are being pushed back by Gust can still use items and attack.","Drow Ranger can activate her Precision Aura giving attack speed to Siege creeps that are attacking towers.","Drow Ranger's Aghanim's Scepter upgrade adds all modifiers to Drow's Split Attacks, such as Frost Arrows or Maelstrom lightning.","Drow Ranger relies on keeping her distance from enemies, making her susceptible to initiations with Blink Dagger or Shadow Blade."],"earthshaker":["Earthshaker's Echo Slam ability does more damage when many enemy units are in the area of effect. Try to spread out when facing Earthshaker.","Earthshaker's Fissure will move any unit caught in its path to one side or the other, allowing him to move allies or enemies into more advantageous positions.","Since Earthshaker's damage bonus from Enchant Totem lasts longer than the cooldown of the spell itself, allowing him to deal massive amounts of physical damage if used before and during the fight.","Earthshaker heavily relies on items like Blink Dagger and Force Staff to get into a good position to use his spells. Limiting his mobility is crucial for mitigating his damage output.","Earthshaker's Enchant Totem has true strike, making him very effective against heroes with evasion like Phantom Assassin or items like Butterfly.","Unlike Earthshaker's other abilities, Echo Slam has a very short cast time, making it great for starting fights with enemies before they can react with defensive items.","The long range of Fissure is great for blocking off an enemy's path to escape or even preventing allied creeps from advancing for a small amount of time.","A lot of Earthshaker's utility comes from the massive amount of disable he can output. Magic immunity from an item like Black King Bar is crucial to mitigating his effectiveness."],"juggernaut":["Juggernaut's Omnislash splits attacks randomly between nearby targets - having many enemy units near Juggernaut will cause each of them to take a smaller amount of damage, instead of focusing all the hits on a single target.","Juggernaut's Blade Fury can be used to grant magic immunity before or after using a town portal scroll.","Juggernaut can use a blink dagger during Omnislash to connect with otherwise unreachable targets without.","Juggernaut Omnislash does physical damage that can be completely negated by using Ghost Scepter or Eul's Scepter.","Juggernaut's regular attacks do not deal damage while Blade Fury is active, except to buildings and wards.","Healing Ward is extremely efficient at healing Juggernaut's team and may be a priority target to enemies during teamfights."],"mirana":["Mirana's Sacred Arrow will fly through units friendly to Mirana.","Mirana's Aghanim's Scepter Upgrade will not trigger Star Storm if she is invisible, allowing her to strategically position herself before using it.","Mirana's Sacred Arrow has a considerable travel time. A teammate that can set up a disable will greatly increase Mirana's chance to hit enemy heroes.","Mirana's Sacred Arrow can be very useful for scouting dark areas of the map.","Mirana's Moonlight Shadow can be used offensively to set up sneak attacks on the enemy team.","Carrying a Dust of Appearance or Sentry ward can mean the difference between a loss and a victory when facing a team with Mirana.","Abilities with strong dispels, such as Abaddon's Aphotic Shield, are great at removing a long stun from an ally caused by Mirana's Sacred Arrow."],"morphling":["Silence can be effective at locking down a slippery Morphling.","Morphling can use items and abilities during Waveform, for example Ethereal Blade or Teleport Scroll.","Morphling can use items during Waveform, for example Ethereal Blade or Teleport Scroll.","After returning from Morph, Morphling's health and mana are reset to their values before the morph.","Abilities that cancel healing, such as Ancient Apparition's Ice Blast will prevent Morphling from gaining health when he's shifting attributes.","Morphling will continue shifting attributes even if he's disabled or silenced."],"oracle":["Oracle's Fate's Edict prevents magic damage to the target including the damage from Purifying Flames. This combo can be used to heal Oracle's allies.","Oracle's Fortune's End can dispel many buffs off of enemy heroes, including the healing effect from Purifying Flames.","Oracle's ultimate False Promise doubles all healing done to the target while it is active. This includes items like Urn of Shadows, Wand, and Mekansm.","During Oracle's False Promise, the overhead orb will be red if the target has taken lethal damage and is predicted to die when the effect expires."],"nevermore":["Shadow Fiend's Requiem of Souls will be cast on death, even if Shadow Fiend is affected by Break.","Shadow Fiend's Necromastery is instrumental in his damage output. After dying, Shadow Fiend will be substantially weaker until he regains his lost souls.","Shadow Fiend is adept at killing creeps and neutrals very quickly. Denying him opportunities to do so greatly hinders his effectiveness later in the game.","Shadow Fiend suffers from a relatively low health pool and mobility. He may be a priority target to burst damage based enemies.","Shadow Fiend's Requiem of Souls has a relatively long cast time and can be cancelled by enemies or by Shadow Fiend himself, without it going on cooldown or costing any mana.","An immense damage output can mean that Shadow Fiend may be susceptible to Blade Mail used by the enemy team."],"phantom_lancer":["Phantom Lancer often chooses to build a Diffusal Blade; Magic Immunity from a Black King Bar can be used to counter this effect.","Phantom Lancer relies on his many illusions to deal most of his damage. Investing in items that will allow killing those illusions quickly, such as Shiva's Guard or Mjollnir, could prove very beneficial.","Phantom Lancer can use Doppelganger to dispel some debuffs as well disjoint projectiles.","Illusions of Phantom Lancer that are created by enemy abilities, such as Shadow Demon's Disruption or Terrorblade's Reflection will still have a chance to fracture into more illusions.","Applying Break to Phantom Lancer, from an item like Silver Edge or an ability like Viper's Nethertoxin, will stop Phantom Lancer from creating additional illusions from Juxtapose."],"puck":["Silence can be effective at locking down a tricky Puck.","Puck can cancel Phase Shift at any time by using an ability or item.","If the Dream Coil Rapid Fire talent is chosen, Puck will continue attacking enemies affected by Dream Coil even while Phase Shifted.","If the opponents rely heavily on magic immunity, Puck may choose to purchase an Aghanim's Scepter to make sure that Dream Coil stays a powerful disable.","Puck has many area of effect abilities, and it is crucial to stay spread out when playing on the opposite team.","With Puck's defensive abilities having very little cast time, the opposing team may choose to initiate onto Puck quickly with items like Blink Dagger or Shadow Blade."],"pudge":["Pudge's Dismember ability is channeled and can be interrupted with a silence or stun.","Pudge often relies on attacking from unexpected angles. Having adequate vision with observer wards will greatly increase the survivability of the enemy team.","Pudge can use his Meat Hook to bring runes to take for himself or leaving them in a safe location for his allies.","Pudge's Meat Hook will still reposition and damage magic immune targets, however if a target is magic immune, they can still use their items and any channeling spells will not be interrupted.","Pudge's Rot deals magical damage to himself as well as his opponent. He often chooses to invest in items that provide magic resistance to mitigate damage to himself.","Pudge's Meat Hook affects allies without damaging them, meaning that it can be used to pull them to safety.","With careful timing, Pudge's Rot can be used to kill Pudge himself, denying his opponents valuable bounty and experience.","The Dismember audio effect can be heard by anyone, even if Pudge himself is hidden, and can be used to guess what the Pudge is currently doing.","Pudge's Dismember still stuns a target if they are magic immune, although it will not deal any damage.","Pudge has naturally low armor, and any physical attacks, especially paired with armor-reducing abilities, can prove to be fatal to the hero.","Pudge's Dismember can be broken by using a strong dispel on his target, such as Abaddon's Aphotic Shield or Legion Commander's Press the Attack."],"razor":["Razor's Plasma Field ability does more damage the further away a target is.","Plasma Field provides vision to Razor, allowing him to look for enemies hiding in the trees or uphill.","Nothing can break Razor's Static Link, making it imperative to move out of Razor's range as quickly as possible.","While Static Link is active, Razor has vision of his target even if they are invisible.","Razor relies on his fast movement speed to keep up to enemies that he is damaging with Eye of the Storm or draining with Static Link. Items that prevent him from moving, such as Rod of Atos, may be a good way of dealing with him.","Razor's Eye of the Storm will prioritize targets that are being drained with Static Link.","Casting Eye of the Storm a second time, while the previous one is still active, for example by using a Refresher Orb, will create a second Storm that is concurrent with the first."],"sand_king":["Sand King's Epicenter ability will continue to pulse for the full duration, even if Sand King himself dies.","Sand King can use Sand Storm and Burrow Strike to disjoint and outmaneuver enemies by going invisible and going under impassable terrain.","Carrying means of detection, like Dust of Appearance, or having a ground-targeted disable or silence, like Puck's Waning Rift, can be very important when trying to catch Sand King during Sand Storm.","Sand King can apply Caustic Finale to many units at once, something that may result in a massive amount of damage when triggered.","Sand King deals a massive amount of magical damage that can be mitigated by items that offer magic resistance or immunity, like Pipe of Insight or Black King Bar.","Silencing or stunning Sand King before he finishes channeling Epicenter will put that ability on cooldown without harming the enemy team. Vision with Observer Wards is important to keep an eye on Sand King's positioning before teamfights."],"storm_spirit":["Silence can be effective at locking down an evasive Storm Spirit.","Storm Spirit is invulnerable during Ball Lightning, allowing him to evade and disjoint many stuns and attacks.","Storm Spirit can use items and abilities during Ball Lightning, which is especially useful when initiating on unsuspecting enemies or trying to teleport back to base.","Overload is applied after Storm Spirit uses any of his abilities, including Ball Lightning. It may be beneficial to use an ability between every attack to maximize Storm's damage output.","Ball Lightning is not only a superb mobility tool, but is a great source of damage when used from a long distance. Making sure an enemy gets hit by a long initiation is an important component of Storm Spirit's damage output.","Storm Spirit is very dependent on having mana to fight. Items and abilities that attack his mana pool, such as Diffusal Blade or Nyx's Mana Burn, can be devastating for Storm Spirit.","Storm Spirit's invulnerability during Ball Lightning means that he can completely ignore most negative effects from movement-based spells, such as Bloodseeker's Rupture."],"sven":["Sven's Great Cleave causes physical damage in an area that is mitigated by armor.","Sven's War Cry grants you and nearby allied heroes bonus movement speed and an HP shield that blocks attack damage based on the shield's health.","Sven relies on being close to enemies to deal massive amounts of damage. Limiting his mobility with items like Rod of Atos or abilities like Nature's Prophet's Sprout is great for mitigating his damage during God's Strength.","Most of Sven's damage comes from his physical attacks and can be negated with an item like Heaven's Halberd.","Avoiding Sven's attacks with sources of evasion, such as Butterfly or Solar Crest, or being physically immune, for example with Ghost Scepter, are effective ways of dealing with Sven's damage.","Sven's God's Strength can be useful not only in team fights, but also taking objectives like killing enemy towers or Roshan."],"tiny":["Units in the air from Tiny's Toss will take triple the damage from Tiny's Avalanche.","Tiny's Toss will interrupt channeling abilities, even those cast by allied heroes.","The splash damage from Tiny's Tree Grab is affected by armor, as well as spell lifesteal and damage amplification.","Early in the game, Tiny relies on magic damage. A Rain Drop will mitigate a lot of that damage output.","Tiny's high burst damage can be somewhat mitigated by items like Aeon Disk.","Tiny has very slow attack speed and relies on items and attack speed buffs from allies to keep his damage output high.","Tiny's lack of base armor means he's very susceptible to physical attacks and armor-reducing abilities."],"vengefulspirit":["Vengeful Spirit's Vengeance Aura will increase base damage and damage from a hero's primary stat. Extra damage, for example from a Divine Rapier, will not be increased.","Vengeful Spirit's Nether Swap interrupts channeling spells on allies as well as enemies.","Vengeful Spirit's illusion from her Aghanim's Scepter Upgrade can still be instantly killed by abilities like Lion's Mana Drain or items like Scythe of Vyse."],"windrunner":["Windranger can choose not to attack her Focus Fire target, by attacking a different target or by issuing a stop command."],"zuus":["Zeus' Lightning Bolt can be cast on the ground to reveal nearby invisible units, including wards."],"kunkka":["An Aeon Disk is often a good item to build late game when facing a Kunkka with many damage items."],"lina":["Lina's Laguna Blade ability will pierce spell immunity, if Lina builds an Aghanim's Scepter."],"lion":["Lion's Hex and Mana Drain abilities will instantly destroy an illusion."],"shadow_shaman":["Shadow Shaman's Mass Serpent Wards are not affected by damage block, for example from a Crimson Guard."],"slardar":["Slardar's Corrosive Haze provides True Sight and vision of the target."],"tidehunter":["Tidehunter's Kraken Shell ability will trigger a Strong Dispel on Tidehunter when enough player caused damage is done to him within a short time."],"witch_doctor":["Blade Mail will not return damage from Witchdoctor's Death Ward, as the source of the damage is the ward and not Witchdoctor himself."],"lich":["Lich channeling Sinister Gaze causes a single target enemy hero to slowly walk towards Lich.","Lich's Frost Shield can be cast on allied buildings."],"riki":["Riki is invulnerable and invisible during Tricks of the Trade, and cannot be revealed with True Sight during this spell."],"enigma":["Enigma's Midnight Pulse does damage based on a percentage of the target's maximum HP."],"tinker":["Tinker's Heat Seeking Missiles will only lock onto targets that Tinker has vision of."],"sniper":["Sniper's Shrapnel does not affect buildings.  Multiple Shrapnel effects do not stack on the same target."],"necrolyte":["Necrophos's Ghost Shroud ability makes him immune to physical attacks, but he takes additional magical damage in this state.","Necrophos's Reaper's Scythe deals damage after a delay. The victim can be saved by healing or damage preventing effects during the scythe animation."],"warlock":["Warlock's Fatal Bonds ability causes damage on the victims to be shared, regardless of the distance between the victims."],"beastmaster":["Beastmaster's Primal Roar will stun spell immune targets.","Beastmaster's Wild Axes can be used to cut down trees to reveal hidden enemies.","Beastmaster's Inner Beast affects allied heroes, as well as creeps and summons. Units created with Necromonicon or Helm of the Dominator benefit greatly from this aura.","Linken's Sphere will fully block the prime target of Beastmaster's Primal Roar.","Beastmaster's Call of the Wild summons are extremely useful for scouting and harassing enemy heroes, but give a substantial amount of gold and experience if they are killed.","A strong dispel, such as Aeon Disk or Abaddon's Aphotic Shield, can be used to remove the stun from Beastmaster's Primal Roar."],"queenofpain":["Queen of Pain's Sonic Wave ability is pure damage, and is not prevented by armor, spell resistance or spell immunity. It will also damage couriers."],"venomancer":["Damage from Venomancer's Plague Wards is not affected by damage block, for example from a Stout Shield or Crimson Guard."],"faceless_void":["Faceless Void's Time Walk does not disjoint projectiles. Time Walk is a healing effect and can be prevented by Ancient Apparition's Ice Blast or reduced with Spirit Vessel."],"skeleton_king":["Wraith King's Reincarnate will trigger even if Wraith King is affected by Break. It will not trigger if Wraith King has insufficient mana; a talent can reduce this cost to 0."],"death_prophet":["The damage from Death Prophet's Exorcism spirits is physical damage and can be mitigated by armor."],"phantom_assassin":["An Aeon Disk or Blade Mail can be a good item to build facing a Phantom Assassin with high burst damage."],"pugna":["Pugna's Nether Blast ability deals half damage to structures."],"templar_assassin":["Templar Assassin's Refraction ability blocks a number of damage instances, regardless of the amount of damage those instances would cause."],"viper":["Viper's Nethertoxin causes Break on affected targets, which disables passive abilities. This can be very effective against heroes like Bristleback."],"luna":["Luna's Eclipse ability will continue for the full duration, even if Luna is silenced or stunned. Eclipse will stop if Luna is killed."],"dragon_knight":["Dragon Knight's Elder Dragon Form Corrosive Breath affects structures in addition to units, making it an effective siege ability.","Dragon Knight's Breathe Fire damage reduction is very effective tool when trading attacks with an opponent or mitigating an enemy's ability to last-hit creeps in lane.","A lot of Dragon Knight's survivability comes from his Dragon Blood passive ability that grants him bonus health regeneration and armor, which makes him vulnerable to the Break effect from things like Viper's Nethertoxin or a Silver Edge.","During Dragon Form, Dragon Knight becomes a ranged hero, allowing him to benefit from items like Hurricane Pike, but losing the bonuses granted by melee items like the Echo Sabre.","Dragon Knight relies on being able to get close to his targets to be effective. Abilities and items that slow him, like Shivas Guard Rod of Atos or are very effective at keeping him at a distance.","Dragon Knight's high armor makes him very resilient against physical damage, but can be mitigated with armor-reducing items like Assault Cuirass or Medallion of Courage."],"dazzle":["Dazzle's Shallow Grave ability prevents the target from dying for the duration from any amount of damage from any source - however instant death abilities can still kill a unit during Shallow Grave."],"rattletrap":["Clockwerk's Battery Assault ability will continue, even if Clockwerk is silenced or stunned. Battery Assault will end if Clockwerk is killed.","Clockwerk's Hookshot stuns opponents for a substantial amount of time, giving him time to reposition and strategically place his Power Cogs, pushing the enemy in the desired direction and disabling them further.","A Force Staff is effective at getting an allied hero out of Clockwerk's Power Cogs","Hookshot will pull Clockwerk to any unit, enemy or ally, which can be an effective way to escape.","Clockwerk's Battery Assault is extremely effective at shutting down enemies with Channeling spells or long cast times.","Clockwerk's Rocket Flare is very useful for scouting enemy movements, and pushing out enemy creeps that are far away from the team.","A Black King Bar will prevent most of the damage done by Clockwerk's abilities. However, his Hookshot will still stun a magic immune target."],"leshrac":["Leshrac's Diabolic Edict does additional damage to structures, making it an effective siege ability."],"furion":["Nature's Prophet's Sprout trees can be cut down with Quelling Blade or consumed with a Tango."],"life_stealer":["Life Stealer's Open Wounds ability causes allies of Lifestealer to gain Lifesteal against the victim with any attack, including spells."],"dark_seer":["Dark Seer's Ion Shell will do damage to nearby units even if they are invisible."],"clinkz":["Clinkz's Searing Arrows ability causes extra physical damage on his attacks."],"omniknight":["Omniknight's Purification ability causes pure damage, which cannot be mitigated with magic resistance."],"enchantress":["Enchantress' Untouchable debuff can be mitigated by having spell immunity, or briefly attacking a different target during the attack backswing.","Enchantress' Nature's Attendants randomly targets nearby damaged allied units. It is much less effective at healing heroes when cast near wounded allied creeps.","Enchantress' Enchant applies a basic dispel to the target."],"huskar":["Huskar's Burning Spears deal extra magical damage, or pure damage if a talent is chosen. Burning Spears does not affect buildings.","Huskar's Life Break applies a basic dispels and grants spell immunity during the leap."],"night_stalker":["Night Stalker's nighttime bonuses also apply during Luna's Eclipse."],"broodmother":["Broodmother's Spiderlings can in turn spawn Spiderites from units they damage which are then killed."],"bounty_hunter":["Allies will only get the bonus gold from Bounty Hunter's Track if they are within 1000 of the victim when it dies. Bounty Hunter himself has no range restriction for bonus gold from Track.","Alt-clicking on the Track debuff icon will announce the amount of gold held by the target."],"weaver":["Weaver's Swarm Beetles apply physical damage that ignores evasion, but is mitigated by armor or block effects."],"jakiro":["Jakiro's Liquid Fire affects buildings, making it an effective siege ability."],"batrider":["Batrider's Sticky Napalm deals extra magical damage to the victim when Batrider attacks. Sticky Napalm does not trigger when other units attack the target."],"chen":["Chen's Penitence causes all allied units attacking the target unit to gain Attack Speed."],"spectre":["Spectre's Dispersion ability reflects damage back to attackers, of the same type as the damage inflicted. It reflects more damage to units which are closer to Spectre."],"ancient_apparition":["Ancient Apparition's Ice Blast prevents healing effects to units affected. If a victim's health drops below a critical threshold, the victim is killed."],"doom_bringer":["Doom's Doom ability causes pure damage, which cannot be mitigated by armor or magic resistance.","Devour will grant Doom not only the target unit's active ability, but their passive abilities and auras as well, making Doom indispensable in team fights.","A Linken's Sphere is a great way to block Doom's Doom. Doom can counter this by devouring a neutral creep with a targeted ability, such as the Satyr Banisher, or building an active item, such as a Heaven's Halberd.","Scorched Earth damages nearby enemies and provides Doom with increased movement speed.","A hero that has been Doomed can be killed by their allies when their health gets low. This will deny Doom gold and experience for the kill.","Upgrading Doom with an Aghanim's Scepter will apply a Break effect on the target, making it very efficient against enemies with powerful passive abilities, like Phantom Assassin or Spirit Breaker."],"ursa":["Ursa's Fury Swipes ability causes extra physical damage when attacking a target repeatedly. Fury Swipes does not work on structures, though it does affect Roshan."],"spirit_breaker":["Spirit Breaker's Charge of Darkness ability can be used to trigger an enemy's Linken's Sphere at any range, so long as Spirit Breaker has vision of the target."],"gyrocopter":["Gyrocopter's Homing Missile can track invisible targets, but do not grant true sight."],"alchemist":["Gold Alchemist earns through Greevil's Greed is unreliable.","Acid Spray deals physical damage and reduces armor, making it an effective tool for killing Ancient neutrals or Roshan","If timed correctly, Alchemist's Unstable Concoction stun can be dodged by using Manta Style or Eul's Scepter - even by Alchemist himself.","If Alchemist is silenced or does not have an enemy hero to target by the time Unstable Concoction reaches its full potential, Alchemist himself will be stunned, leaving him vulnerable to enemies.","The Bounty Rune bonus from Alchemist's Greevils Greed is only applied to Alchemist himself. It does not matter who picks up the rune itself.","Alchemist's Chemical Rage gives him a massive Health Regen bonus that can be mitigated by Spirit Vessel or Ancient Apparition's Ice Blast.","Alchemist's Aghanim's Scepter Synth will grant the targeted ally stats from the Scepter, even if the hero gains no other ability bonuses from it."],"invoker":["Invoker's Sun Strike deals pure damage, which cannot be mitigated with magic resistance or spell immunity."],"silencer":["Silencer's Glaives of Wisdom deals pure damage, which cannot be mitigated with magic resistance but does not pierce spell immunity, unless Silencer has an Aghanim's Scepter."],"obsidian_destroyer":["Outworld Devourer's Arcane Orb deals pure damage, which cannot be mitigated with magic resistance, but does not pierce spell immunity."],"lycan":["Lycan's Howl ability has global range, affecting all allies regardless of distance. It is more effective at night.","Lycan's Shapeshift applies critical strike and movement speed bonuses to all units Lycan controls, including units summoned with a Necronomicon."],"brewmaster":["When Brewmaster's Primal Split ends Brewmaster will try to reappear at the position of the Earth spirit if alive, then Storm spirit if alive, and finally at the position of the Fire spirit.","A Monkey King Bar or Bloodthorn can be an effective way to counter Brewmaster's Drunken Brawler evasion.","Brewmaster's body starts fuming when he's guaranteed a critical strike and dodge from Drunken Brawler.","After Primal Split, any aura that Brewmaster has, for example Radience or Vladmir's Aura, affects units around Earth, if Earth is dead, around Storm and if Storm is dead, around Fire.","Brewmaster's Primal Split has a substantial cast time that can be effectively countered with stuns or silences.","Brewmaster's Storm Spirit can use Dispel Magic to cancel his own Cyclone."],"shadow_demon":["Shadow Demon's Soul Catcher causes all targets caught in the area to temporarily lose a percentage of their current health. Soul Catcher can be cast on targets Banished by Disruption."],"lone_druid":["Lone Druid's Spirit Bear does additional damage to structures, making it very effective at sieging.","Lone Druid's Spirit Bear can pick up runes. Lone Druid does not need to be nearby for this."],"chaos_knight":["When Chaos Knight casts Phantasm, he disjoints projectiles and is briefly invulnerable and spell immune.","Chaos Knight's Chaos Bolt has a substantial cast time as well as a slow projectile, and can be disjointed with a well-timed Blink or Eul's Scepter.","Activating Armlet of Mordiggian before using Phantasm gives Chaos Knight's copies bonus damage and health.","Chaos Knight's Phantasm copies are susceptible to any abilities that instantly destroy illusions, such as Lion's Mana Drain or Shadow Shaman's Hex.","Chaos Knight's Reality Rift has a substantial cast time and can still be dodged after he started casting the spell.","Most of Chaos Knight's damage output is physical, and can be dealt with using item that grant armor or Ghost Scepter.","Chaos Knight's Reality Rift will bring in all of his illusions, including the ones from Manta Style and Illusion Rune."],"meepo":["Meepo gains XP or gold when any of his clones gain XP or gold. Meepo dies whenever any of his clones die."],"treant":["Casting spells or using items does not break the invisibility of Treant Protector's Nature's Guise."],"ogre_magi":["Ogre Magi's Bloodlust can be cast on towers."],"undying":["Undying's Tombstone does not spawn zombies for nearby invisible units, and existing zombies will expire if the unit they are tracking becomes invisible."],"rubick":["When Rubick casts a stolen spell he can do so with zero casting time, even if the spell normally has a cast time (with very few exceptions)."],"disruptor":["Disruptor's Thunder Strike pulses every two seconds. Glimpse moves the target back in time four seconds. You can use Thunder Strike to perfectly time a Glimpse."],"nyx_assassin":["Nyx Assassin's Spiked Carapace will reflect damage no matter how far away the attacker is, and even if the attacker is invisible."],"keeper_of_the_light":["Aghanim's Scepter causes Keeper of the Light's Illuminate to heal during the day."],"naga_siren":["Naga Siren is briefly invulnerable and spell immune during the casting of Mirror Image and will disjoint projectiles.","Naga Siren's Song of the Siren does not sleep spell immune enemies, which can be used to isolate a single spell immune hero from their team."],"wisp":["While Io is tethered to an ally, it moves at the same speed as that ally."],"visage":["Visage's Gravekeeper's Cloak ability decreases in effectiveness as players damage Visage but will quickly regenerate. Gravekeeper's Cloak also affects Visage's familiars.","Visage has a base magic resistance of 10%, less than most heroes who have 25%. This makes Visage especially vulnerable to magic damage if Gravekeeper's Cloak is removed.","Visage's Grave Chill also grants attack speed and movement speed bonuses to nearby familiars.","Visage's familiars can destroy trees by casting Stone Form above a tree."],"slark":["While Slark is under the effect of Shadow Dance, he cannot be revealed by True Sight."],"medusa":["Medusa's Mystic Snakes increase their damage and mana steal with each successive bounce. The mana stolen is a percentage of the target's current mana."],"troll_warlord":["Troll Warlord's Fervor gains stacks even when the attack is evaded or disjointed."],"centaur":["Centaur Warrunner's Retaliate reflects incoming damage back as physical damage. It also reflects damage from tower attacks.","Centaur's Double Edge deals magic damage that can be mitigated by spell resistance by its targets as well as Centaur himself.","Centaur's Stampede is global and can be used to help allies attack or retreat even if Centaur is far away.","Rod of Atos or Eul's Scepter is a good way of stopping Centaur's Allies from getting away during Stampede.","Centaur has a considerable Health pool, so any abilities that deal damage based on an opponent's health, such as Lifestealer's Feast or Necrophos' Heartstopper Aura are very effective.","Magic Immunity, such as a Black King Bar is very effective at avoiding a lot of Centaur's burst damage, coming from Stampede, Double Edge and Hoof Stomp."],"magnataur":["Magnus' Empower ability grants the target Cleave, which causes physical damage in an area around each attack."],"shredder":["When Timbersaw is affected by Break, he will not gain additional stacks of Reactive armor, but existing stacks will continue to provide armor and health regen."],"bristleback":["When Bristleback is affected by Break, his Bristleback ability is disabled, substantially reducing his survivability.","Bristleback's Viscous Nasal Goo that has been upgraded with Aghanim's Scepter will not be blocked by Linken's Sphere.","Bristleback can cast Viscous Nasal Goo on enemies multiple times, heavily reducing their armor and attack speed, making it effective for attacking Roshan.","Preventing Bristleback from constantly casting Quill Spray, for example with a Silence, will greatly reduce the amount of damage Bristleback can output.","Bristleback's abilities do not have to hit enemy units to trigger his Warpath.","Bristleback's Quill Spray damage is physical, and can be reduced with armor.","Bristleback likes to cast spells a lot, so a Magic Stick or Magic Wand are very effective when used against him."],"tusk":["Tusk's Snowball does more damage when more heroes are inside it."],"skywrath_mage":["Skywrath Mage's Arcane Bolt does substantially more damage based on Skywrath's intelligence."],"abaddon":["Abaddon's Borrowed Time can still be activated manually when Abaddon is affected by Break.","The area damage of Abaddon's Aphotic Shield is independent from the amount of absorbed damage.","Abaddon can use his Aphotic Shield ability to remove most negative buffs and stuns from allied heroes.","Abaddon's Curse of Avernus debuff is applied to buildings, making him very effective at sieging.","Abaddon's Borrowed Time can be activated manually even while stunned or slept, removing most negative debuffs.","If Abaddon receives more than Borrowed Time's passive threshold in damage, the Borrowed Time effect will not activate automatically.","Preventing Abaddon from taking damage while Borrowed Time is active, for example with Eul's Scepter is an effective way of keeping him in place while waiting out the effect.","Abaddon's Aphotic Shield won't damage units Abaddon does not have vision of. You can use the fog of war or invisibility to avoid damage."],"elder_titan":["Elder Titan's Natural Order causes enemies to have armor reduced around Elder Titan, and magic resistance to be reduced around Elder Titan's Spirit."],"legion_commander":["While Legion Commander's Duel will pierce spell immunity from a Black King Bar, a Linken's Sphere will prevent a duel."],"techies":["Techies' Proximiy Mines are automatically revealed when an enemy units walks nearby. Stasis Traps and Remote Mines require True Sight to reveal.","Techies' Blast Off ability can be interrupted by applying forced movement effects (like force staff) during the jump."],"ember_spirit":["Ember Spirit's Searing Chains can interrupt a channeling target, for example an enemy escaping with a Town Portal scroll."],"earth_spirit":["Earth Spirit can use items and abilities during Rolling Boulder, allowing him to set up for future attacks.","Getting in front of an Earth Spirit that used Rolling Boulder is an effective way of preventing him from escaping.","With careful timing, Earth Spirit can use the same Stone Remnant to stun and silence an enemy, allowing him to conserve Remnants for future use.","Using Boulder Smash on allies can be an effective way of getting them to safety or repositioning them to an advantageous position.","Upgrading Geomagnetic Grip with his talent makes it easy for Earth Spirit to save his allies that are being attacked by enemies.","Enchant Remnant makes the target temporarily invulnerable, allowing Earth Spirit to use it to save allies that are in danger."],"abyssal_underlord":["Underlord's Firestorm ability does a percentage of the victim's maximum Hit Points as magical damage with each wave, making it very effective against certain heroes."],"terrorblade":["Terrorblade's Sunder does not pierce spell immunity from a Black King Bar. A Linken's Sphere will also prevent the Sunder."],"phoenix":["Phoenix can use items and cast abilities during Icarus Dive."],"winter_wyvern":["Winter Wyvern's Splinter Blast shards will hit invisible units as well as units in the fog of war.","Units affected by Winter Wyvern's Winter's Curse cannot take damage."],"arc_warden":["Arc Warden's Magnetic Field grants evasion to allies within the field to attacks that come from outside the field, including tower attacks.","Arc Warden's Magnetic Field grants evasion to allied buildings that are inside the field.","Arc Warden's Tempest Double will break an enemy smoke, unlike other summoned units.","The damage and slow from Arc Warden's Flux can be avoided by standing near an allied unit."],"monkey_king":["Monkey King's Boundless Strike ignores evasion, and cannot miss."],"pangolier":["Pangolier's Swashbuckle ignores evasion, and cannot miss."],"dark_willow":["When Dark Willow is under the effect of Shadow Realm, she cannot be revealed by True Sight."]}}