{"beginner":["Si notas que un héroe enemigo en tu senda desaparece, avisa a tus compañeros diciendo \"Missing Top (superior); Middle (central); Bottom (inferior)\". ¡Quizás salves la vida de un compañero!","Puedes subir de nivel tus habilidades manteniendo presionado el botón Control y pulsando su tecla asociada.","Usa Guardianes para mostrar partes del mapa y aumentar tu conocimiento sobre los movimientos del equipo enemigo.","Asegúrate de que tu equipo tiene un mensajero para que te traiga objetos de la tienda, así puedes permanecer en tu senda ganando experiencia y oro.","Los Guardianes Centinela revelan unidades invisibles cercanas, así como guardianes enemigos.","Roshan es mucho más fácil de asesinar si reduces su armadura.","Hacer clic manteniendo Mayús en objetos de la tienda los añadirá a la compra rápida.","Asestar el último golpe a una torre te dará más oro por haberla destruido.","La \"senda segura\" es la más larga en el lado del río de tu equipo. Para los Dire es la senda superior y para los Radiant la inferior.","La \"senda difícil\" es la más corta en el lado del río de tu equipo. Para los Dire es la senda inferior y para los Radiant la superior.","Normalmente un equipo solo necesita un mensajero.","La bonificación de velocidad por llevar botas no es acumulable. No importa cuántas patas tenga el héroe que has elegido, solo necesitas unas botas.","Puedes ver el inventario y las habilidades de un héroe enemigo seleccionándolo.","Suele ser buena idea llevar un Pergamino de Teletransporte.","Hay muchos senderos secretos escondidos entre los árboles, a menudo llamados \"puntos de esquive\". Recurre a éstos para eludir ataques o preparar emboscadas.","Usa Polvo de la Revelación para descubrir a los enemigos invisibles cercanos.","Cada dos minutos aparecerá una runa en el río, ya sea al norte o al sur de la senda central. A partir del minuto 40, se generarán dos runas, una al norte y la otra al sur.","Si tienes una Botella, recoger una runa la almacenará para usarla más tarde. Almacenar una runa también rellenará la Botella.","Puedes seleccionar una de las muchas guías creadas por otros usuarios para tu héroe usando el botón de guías situado a la izquierda de la barra superior.","¡Comprueba el minimapa a menudo! Puede que descubras que estás a punto de ser emboscado.","A menudo la mejor forma de aprender los puntos débiles de un héroe es jugar con él.","Destruir los barracones de tus enemigos aumentará la fuerza de los creeps de tu equipo en esa senda.","Las torres pueden ver y atacar a unidades invisibles.","Sé consciente de tu posición al atacar creeps. Puede que termines llevando a los creeps de tu equipo y a ti mismo hacia una ubicación peligrosa.","Las tiendas laterales venden muchos objetos útiles, incluyendo el Pergamino de Teletransporte y componentes para muchos tipos de botas.","Hay varios puntos elevados con marcas que indican buenas localizaciones para colocar Guardianes Observadores.","Permanecer cerca de la fuente de tu equipo restaurará tu vida y maná rápidamente.","La fuerza aumenta la vida máxima. La agilidad aumenta la velocidad de ataque. La inteligencia aumenta el maná máximo.","En realidad la Tienda Secreta no es secreta.","Un \"Asesino\" es un héroe que aumenta de poder poco a poco, volviéndose más fuerte a medida que la partida avanza. Un héroe de \"Apoyo\" suele ser más poderoso al principio de la partida, para después favorecer la efectividad de su equipo.","Siempre que tu héroe esté dentro del rango de un asesinato, ganarás experiencia.","Al activar el Glifo de Fortificación, puedes fortificar tus estructuras y creeps temporalmente y evitar todo el daño que reciban. Úsalo con sensatez; tiene un tiempo de recarga muy largo.","Usar un Pergamino de Teletransporte te permite teletransportarte a cualquier estructura aliada. Las Botas de Viaje te permiten teletransportarte a cualquier unidad aliada.","Si asesinan a tu mensajero, este reaparecerá junto con todos los objetos que cargaba dentro de 120 segundos. El mensajero volador tardará 180 segundos.","Cuando utilices un Tango, la regeneración de vida es siempre la misma sin importar el tamaño del árbol que consumas.","Hay muchas páginas web y vídeos que pueden ayudarte a aprender más sobre tácticas generales, formación de equipos y estrategias para tus héroes favoritos.","Puedes darle un Tango a un compañero de equipo usándolo sobre él.","Puedes usar Bálsamos Curativos o Claridades en tus compañeros. ¡Compartir es amor!","En la mayoría de los modos, cada jugador obtiene automáticamente 1 de oro cada 0.6 segundos o 100 cada minuto.","Puedes dar Pergaminos de Teletransporte a tus compañeros de equipo.","No se pueden colocar Guardianes Observadores o Centinelas dentro de la cueva de Roshan.","Las runas no recogidas serán reemplazadas cada dos minutos.","Conseguir oro matando creeps se suele llamar \"recolectar\" (o \"farming\" en inglés).","Morir hace que un héroe pierda oro no seguro y les dé oro y EXP a sus asesinos. Evita morir, ¡y asegúrate de asesinar a los héroes enemigos cuando sea posible!","Hay ubicaciones de runa de recompensa en cada una de las cuatro junglas. Aparecen al comienzo de la partida y cada 5 minutos."],"intermediate":["Cuando Roshan haya sido asesinado, reaparecerá pasado un tiempo aleatorio de entre 8 y 11 minutos.","Los creeps neutrales aparecen en el minuto 1 y a partir de ahí reaparecerán cada minuto.","Algunos hechizos pueden esquivarse usando una Daga de Traslación o haciéndose invisible.","Atacar desde una posición elevada te da ventaja, ya que tu oponente puede fallar los ataques o perderte en la niebla de guerra.","Usar la Pipa de la Perspicacia te permite mitigar el daño por hechizos de los héroes enemigos.","Coraza de Asalto potencia la armadura de los aliados cercanos.","Cuando una torre te esté atacando, forzar un ataque y hacer clic a un creep aliado reiniciará el objetivo de la torre.","Colocar un Guardián o una unidad cerca de un campamento neutral puede prevenir que los creeps de dicho campamento reaparezcan cuando el contador marque el minuto.","La Vara del Rey Mono te dará precisión, lo que a menudo evita que los héroes enemigos evadan tus ataques, incluso cuando atacas cuesta arriba.","Hacer doble clic sobre tu Daga de Traslación hará que te teletransporte automáticamente hacia la fuente de tu equipo.","Puedes atacar creeps aliados que estén a punto de morir. Usa esto para denegar al enemigo el oro obtenido por los últimos golpes.","El daño mágico puede reducirse con objetos que otorguen resistencia al daño mágico.","El daño físico puede reducirse con objetos que otorguen armadura.","El daño puro no se puede reducir ni con armadura ni con resistencia al daño mágico.","Cambiar el atributo principal de las Botas de Poder puede romper la invisibilidad e interrumpir cualquier hechizo canalizado como el uso de un Pergamino de Teletransporte.","Atraer todos los creeps neutrales de un campamento cuando el contador esté cerca del minuto permitirá que reaparezcan nuevos creeps. Recurre a esto para aumentar el número de creeps que puedes matar.","Mantener presionada la tecla Control te permite usar las cargas de tu Botella en un héroe aliado. Las Runas embotelladas, sin embargo, no se pueden compartir.","¿Atrapado en tu base? Todavía puedes realizar compras en la Tienda Secreta enviando a tu mensajero allí. ¡Pero ten cuidado de no enviarlo hacia las fuerzas enemigas!","Cuando no hay creeps enemigos cerca, las torres y barracones tienen Protección de Retaguardia, lo que disminuye el daño que reciben y les permite restaurar vida.","El daño adicional de la Hoja Mitigante solo afecta a los creeps enemigos y neutrales.","El daño bloqueado por el Escudo Robusto, el Escudo del Miserable y Vanguardia está determinado por el tipo héroe que lleve dicho objeto y no por el atacante.","Dagón, Necronomicón y Botas de Viaje se pueden mejorar volviendo a comprar sus recetas.","Puedes dar un único guardián a un compañero de equipo manteniendo pulsado Control, haciendo clic en el guardián en tu inventario y a continuación haciendo clic en tu compañero.","La Daga de Traslación y el Bastón de la Fuerza pueden usarse para descender o subir un acantilado.","Usa una Hoja Mitigante o Furia de Batalla para talar árboles y abrirte paso a través de los bosques.","Las ilusiones u otros creeps no disipan el Humo del Engaño, solo los héroes enemigos y las torres lo hacen.","Mantener Alt pulsado mostrará información adicional en las descripciones de diversas habilidades y objetos.","Los barracones no pueden revelar unidades invisibles o guardianes.","Resurrección tiene un tiempo de recarga de 8 minutos.","Cada héroe tiene un atributo principal de Fuerza, Agilidad o Inteligencia. Cada punto gastado en los atributos del héroe aumenta su daño en 1.","A partir de su segunda muerte, Roshan dará un Queso además de la Égida del Inmortal. Usar el Queso rellena de forma instantánea 2500 de vida y 1500 de maná del héroe.","Las ilusiones de héroes infligen mucho menos daño a Roshan.","Recuerda comprobar el inventario de tus aliados antes de comprar un objeto por su aura. Puede ser que ya lo tenga otro miembro de tu equipo y las auras no se acumulan.","Las duraciones de aturdimiento de diferentes habilidades no se acumulan. Puedes mantener a un enemigo aturdido durante más tiempo si sincronizas tus habilidades con cuidado.","Los silencios o retrocesos no interrumpen las teleportaciones de Pergaminos de Teletransporte o Botas de Viaje.","Cuanto más cerca esté una torre de la Fortaleza Ancestral enemiga, más oro proporcionará su destrucción.","Usar un Anillo Espiritual te otorgará maná adicional incluso si tu maná está lleno del todo.","Puedes destruir torres aliadas cuando están por debajo del 10% de vida. Denegar una torre hace que el enemigo no obtenga oro por destruirla.","Puedes usar Hoja Mitigante o Furia de Batalla para destruir guardianes observadores y guardianes centinelas enemigos; esto es especialmente útil para las unidades de combate cuerpo a cuerpo porque pueden llegar a los guardianes difíciles de alcanzar.","El daño físico, infligido mediante autoataques, algunas habilidades y objetos, puede reducirse con armadura o bloquearse al adquirir forma Etérea.","El daño mágico, infligido por la mayoría de habilidades y objetos, puede reducirse con resistencia al daño mágico o bloquearse con inmunidad a los hechizos.","Activar Estilo Manta te moverá de tu posición original cuando aparezcan las ilusiones. ¡Usa esto para confundir a tus enemigos!","Denegar creeps proporciona un 20% de su recompensa de oro al denegador.","Usa el escudo del mensajero volador sabiamente, ya que posee un tiempo de recarga muy largo.","Los héroes y unidades a distancia tienen una posibilidad pseudoaleatoria de fallar cuando atacan posiciones elevadas.","Roshan se vuelve más fuerte cada minuto, obteniendo salud, daño y armadura adicionales.","Las runas de recompensa proporcionan oro a todo el equipo, independientemente del héroe que las recoja.","Algunas habilidades no se pueden bloquear con inmunidad a hechizos. La interacción de cada habilidad con la inmunidad a hechizos se muestra en su descripción.","Considera guardar oro para resucitar. Una resurrección bien calculada puede convertir una defensa a la desesperada en un veloz cambio de rumbo.","Las ilusiones infligen un 60 % menos de daño a las estructuras enemigas.","¡Recolectar en la jungla puede ser peligroso! Deberías comprar y colocar algunos guardianes para evitar que tus enemigos te embosquen.","Cada héroe alcanza su máxima eficacia en un momento diferente de la partida.","Si todos los héroes enemigos han desaparecido del minimapa, puede que estén matando a Roshan o preparando una emboscada.","Intenta colocar guardianes cerca del siguiente objetivo que tu equipo planea atacar.","Aprender a jugar como Apoyo te hará un mejor jugador de Asesino.\r\nAprender a jugar como Asesino te hará un mejor jugador de Apoyo.","A partir de los 40 minutos, las runas energéticas aparecerán en ambos puntos de la runa en el río.","El tiempo de recarga de los objetos de tu mochila o reserva se reduce a la mitad del habitual.","El escaneo revelará, por un período de tiempo breve, si los héroes enemigos están en un lugar objetivo.","Puedes alimentar a un aliado con un mango haciendo Ctrl + clic sobre el mango y luego sobre el aliado.","Cuando se suelte un Estoque Divino por primera vez, no podrá ser usado por aliados cuando lo recojan (aunque puede ser devuelto al propietario). Cuando se suelte por segunda vez, cualquiera podrá usarlo.","La precisión de la Vara del Rey Mono no es aplicable cuando se ataca una estructura.","La mayoría de hechizos tiene una animación de lanzamiento breve antes de que tenga lugar el efecto. Todos los objetos lanzan sus efectos de manera instantánea sin tiempo de lanzamiento.","Canalizar un Pergamino de Teletransporte tardará más tiempo si otro héroe se ha teletransportado a la misma zona recientemente.","¿Tu equipo tiene un Medallón del Coraje, una Urna de las Sombras o una Ofrenda de Vladmir? Puede ser más efectivo crear objetos que beneficien a todo el equipo.","Los Tangos son el doble de efectivos cuando se utilizan para consumir un guardián o un árbol creado por una Rama Férrea.","Las Botas de Viaje se cancelan si la unidad de destino muere mientras se está canalizando.","Hacinar un campamento neutral te dará un porcentaje de la recompensa cuando seas asesinado.","El tercer Roshan asesinado en una partida dejará caer una Bendición de Aghanim o una Esquirla Revigorizante. El cuarto Roshan entregará ambas. Puedes seleccionar a Roshan para ver su inventario y averiguar qué objetos dejará caer al morir.","Las torres de nivel 2 o superior cuentan con un ataque multidisparo cuando se activa Glifo. Atacan hasta dos objetivos adicionales, dando prioridad a las unidades más cercanas."],"introduction":["Intenta luchar contra creeps y héroes enemigos dentro del rango de ataque de las torres de tu equipo.","Ten cuidado al cruzar el río hacia territorio enemigo.","Recuerda llevar objetos que restauren vida y maná al principio de la partida.","Compra y utiliza Pergaminos de Teletransporte para moverte por el mapa rápidamente.","Hay \"tiendas laterales\" en los límites este y oeste del mapa, donde puedes comprar diferentes objetos.","Algunos objetos solo pueden comprarse en la \"Tienda Secreta\".","La mayoría de los héroes pueden aprender la habilidad \"definitiva\" en el nivel 6 y mejorarse en los niveles 12 y 18.","Asestar el último golpe al matar un creep o héroe te otorgará oro adicional.","Asegúrate de que tu equipo tiene un mensajero para llevaros objetos cuando estáis en las sendas.","Los objetos que compres mientras estés alejado de la tienda se pondrán en tu Reserva y podrás obtenerlos más adelante, o bien el mensajero puede llevártelos.","Si es necesario, podrás encontrar el modo para daltónicos en el menú de opciones.","La activación de un santuario proporciona regeneración de vida y maná para ti y los aliados cercanos."],"universal":["Los locutores y los aspectos del HUD se comparten entre todos los jugadores de la partida. Puedes escoger entre ellos pulsando el botón de contenido compartido del marcador.","Mantén la calma. Recuerda: es solo un juego.","Puedes silenciar a los jugadores maleducados en la Tabla de Puntuaciones, a la que puedes acceder mediante los botones a la izquierda de la barra superior.","Tras escoger tu héroe, puedes hacer clic en el minimapa de la esquina inferior izquierda para informar a tus compañeros de equipo de qué senda pretendes usar cuando comience la partida.","¿Disfrutaste jugando con alguien? Felicítalos haciendo clic en el icono Recomendar, encima de sus nombres en la tabla de puntuaciones después de la partida.","Puedes mantener Alt y hacer clic en una de tus habilidades para informar a tus compañeros de equipo del estado del tiempo de recarga de esa habilidad.","Puedes informar a tus compañeros de equipo de que falta un enemigo manteniendo Alt y haciendo clic en sus respectivos retratos de la barra superior.","Intenta ser amable, sobre todo con tus compañeros de equipo. La gente no escucha a los maleducados.","Los jugadores que abandonen una partida serán penalizados.","Cualquiera puede adquirir guardianes y comprar al mensajero. ¡Si tus compañeros necesitan algo, no dudes en comprarlo!","Sé amable con los nuevos jugadores. Todos fuimos principiantes alguna vez.","Buena suerte. Pásalo bien.","La elección de los héroes es importante. Muchos héroes pueden contrarrestar a otros, y algunas combinaciones de héroes son mucho más poderosas y útiles que un héroe en solitario.","Mantener pulsado Mayús te permite acumular acciones y realizarlas en una secuencia.","¡Tu opinión cuenta! Visita el Workshop de Dota 2 y vota por los objetos que te gustaría que se vendiesen en Dota 2.","Los objetos globales pueden añadirse a la selección aleatoria, de este modo tendrás un objeto diferente para ese hueco en cada partida.","Unos buenos refuerzos pueden abrirte camino hacia la victoria.","¿Prefieres los iconos de los héroes en vez de símbolos de colores en el minimapa? Puedes cambiarlo en los ajustes.","Recuerda levantarte y estirarte entre partida y partida.","Recuerda: todo el mundo tiene malas partidas. Todos cometemos errores.","¿Quieres que el minimapa aparezca al otro lado de la pantalla? Puedes cambiarlo en los ajustes.","Puedes cambiar la frecuencia con que se escuchan las voces de los héroes en los ajustes.","Puedes descargarte las repeticiones de tus partidas desde la lista de partidas recientes tu perfil. ¡Un buen modo de mejorar ver tus propias partidas desde una nueva perspectiva!","Puedes hacer Alt + clic en una habilidad u objeto para informar a tus compañeros de que está listo para su uso, en recarga o si no tienes suficiente maná.","Puedes usar objetos mientras estás silenciado.","¿Has cancelado el Pergamino de Teletransporte sin querer? En ajustes tienes la opción para que cancelar el teletransporte requiera un comando.","Hacer Alt + clic en un objeto del inventario de un héroe enemigo alertará a todo tu equipo de que tiene dicho objeto.","Hacer Alt + clic en el botón de resurrección o en tu oro, avisará a tus compañeros de tu estado de resurrección.","En Elección libre, los jugadores que no hayan elegido un héroe antes de que se agote el tiempo empezarán a perder su oro inicial.","Dota 2 está en constante evolución. Se agregan nuevas características, se introducen nuevos héroes y pueden aparecer nuevos ajustes para héroes y mecánicas ya existentes. ¡Mantente al día de los últimos cambios en el blog de Dota 2!","Ten cuidado y no vayas a hacer más enemigos de los cinco a los que ya te enfrentas.","Si es necesario, podrás encontrar el modo para daltónicos en el menú de opciones.","Mantener pulsado Alt y hacer clic en las barras de vida y maná de un héroe o en las tuyas informará a tu equipo de la salud y el maná actuales de ese héroe.","Puedes informar a tu equipo de efectos activos de tu héroe manteniendo pulsado Alt y haciendo clic en sus iconos. Esto también funciona con héroes enemigos.","Si mantienes pulsado Alt y haces clic en el glifo de fortificación, informarás a tu equipo de su estado actual. Para decir a tu equipo que no usen el glifo, pulsa Control y Alt a la vez y haz clic en el glifo.","Mantener pulsado Alt y hacer clic en tu tiempo de resurrección anunciará a tu equipo tu tiempo de resurreción actual.","Usa la rueda de chat para enviar rápidamente mensajes preseleccionados a tus compañeros de equipo. Puedes personalizarla en el menú de opciones.","Los mensajes de la rueda de chat están traducidos para aparecer en el idioma que esté utilizando el jugador receptor.","Asigna las teclas de habilidad como lanzamiento rápido para utilizar habilidades en la localización actual de tu cursor pulsando la tecla una sola vez.","Puedes exponer tus datos de partidas públicas para que se recojan por terceros en el menú de opciones.","Desde el menú de opciones puedes establecer que los objetos y las habilidades se usen automáticamente en tu héroe haciendo doble clic en el icono de la habilidad o pulsando dos veces la tecla asignada.","¡No te rindas! Matar a un héroe enemigo vale más oro y experiencia si tu equipo es menos poderoso que tus oponentes.","Es responsabilidad de todos intentar hacer de la comunidad de Dota un lugar amigable y acogedor en el que competir.","¿Te gustaría ver cómo juegan a Dota los profesionales? Echa un vistazo a la gran cantidad de torneos que tienen lugar en todo el mundo. Puede que aprendas unos cuantos trucos nuevos para tu héroe favorito.","Puedes deshabilitar el ataque automático en el menú de opciones.","Muestra tu agradecimiento con los que compran Guardianes y Mensajeros.","Normalmente, destruir la torre o los barracones de un enemigo es más beneficioso para tu equipo que matar a un héroe enemigo.","Mantén la calma y sé educado y tendrás más éxito motivando a tus aliados.","Los jugadores que guardan la calma casi siempre toman mejores decisiones.","Planea siempre tu siguiente movimiento.","Incluso una derrota es una práctica para tu siguiente victoria.","Usa la opción de probar héroes, accesible desde la pestaña Héroes, para aprender a jugar con nuevos héroes, practicar últimos golpes o darle un nuevo aspecto a tu favorito.","Puedes ver el alcance de lanzamiento de tus hechizos activando el trazador de alcance de las habilidades en el menú de ajustes.","No tengas miedo de experimentar jugando con un héroe con el que no estés familiarizado.","Dota se disfruta más con amigos.","No dudes en silenciar a un jugador maleducado.","Intenta no lamentarte de tus errores. Aprende de ellos y continúa.","Mantén siempre un ojo puesto en el minimapa.","Si experimentas tirones durante la partida al usar el chat de voz, intenta activar la opción \"Pulsar para hablar simplificado\" desde el menú de ajustes.","Cuatro runas de recompensa aparecerán al comenzar la partida y reaparecerán cada cinco minutos.","Los creeps de la jungla brindan significativamente menos recompensa de oro y experiencia que los creeps de senda.","Las estructuras con Protección de Retaguardia activa se pueden identificar por la barrera azul que tienen a su alrededor y el icono de escudo al lado de su barra de vida.","Las torres, la Fortaleza Ancestral y la fuente proporcionan Visión Verdadera que revela las unidades invisibles cercanas. Los santuarios y barracones no proporcionan Visión Verdadera.","Los creeps de asedio infligen daño adicional a torres y tomarán como objetivo las estructuras enemigas cuando sea posible.","Si tienes problemas para jugar contra un héroe en concreto, intenta jugar con él. Aprenderás sus debilidades rápidamente.","Todas las torres otorgan una armadura adicional a los aliados cercanos: 3 de armadura para las torres de nivel 1 y 5 de armadura para todas las demás torres.","El estado de enmudecido impide a un héroe utilizar objetos.","El estado de Ruptura evita que se activen las habilidades pasivas de un héroe.","La Gema de Visión Verdadera no funcionará cuando la lleve el mensajero o el Espíritu Oso de Lone Druid.","Los Bálsamos Curativos y las Claridades solo son interrumpibles por héroes y Roshan.","Mantén presionada la tecla Alt y haz clic izquierdo en el mapa para proporcionar un ping contextual para tus compañeros de equipo.","Una Gema de Visión Verdadera tirada en el suelo proporcionará un pequeño radio de visión en ese lugar para el equipo que la dejó caer."],"advanced":["El oro seguro se obtiene al matar héroes, a Roshan y mensajeros o destruyendo torres enemigas o usando Mano de Midas. Todas las demás fuentes de oro son oro no seguro, que se puede perder al morir.","Puedes atraer los creeps neutrales del campamento más cercano a la senda segura de tu equipo para que luchen contra los creeps de tu senda.","Varios objetos pueden desmontarse y recuperar sus componentes haciendo clic derecho sobre ellos en tu inventario y seleccionando \"Desmontar\". ¡Reutiliza los componentes para crear nuevos objetos!","Utiliza los grupos de control para elaborar órdenes hacia las diferentes unidades que estén bajo tu control. Para establecer un grupo de control, selecciona una o varias unidades, mantén presionada la tecla Control y teclea un número. Para seleccionar un grupo de control, pulsa el número correspondiente a dicho grupo.","¡Si estás a punto de morir, pulsa la tecla \"Adquirir compra rápida\" para gastar tu oro antes de que desaparezca!","Cambiar el atributo principal de las Botas de Poder a inteligencia puede darte un poco de maná adicional.","Si posees un Brazalete de Mordiggian, puedes activar Fuerza Impura para aumentar temporalmente tu vida en 500. Al desactivar Fuerza Impura la vida adicional desaparecerá, siempre con un mínimo de 1 de vida.","Activar Estilo Manta elimina muchos efectos negativos y hará que los proyectiles en movimiento fallen.","Tras usar Resurrección, se añaden 25 segundos a su próxima muerte.","El queso y la Esquirla Revigorizante se pueden vender por 500 de oro.","Si estás dentro del rango de varias auras con el mismo efecto, solo la más poderosa estará activa.","Si crees que estás a punto de morir, considera la posibilidad de invadir un campamento neutral o ir a Roshan y deja que te maten. De este modo podrás denegar al equipo enemigo el oro y la experiencia que ganarían con tu muerte.","Los barracones cuerpo a cuerpo regeneran 5 puntos de vida por segundo. Los barracones a distancia no se regeneran.","Un punto de Agilidad aumenta la velocidad de ataque del héroe en 1, así como su armadura en 0.05 %.","Un punto de Inteligencia añade 12 de maná máximo, así como 1.8 % de regeneración de maná. También aumenta el daño de tus hechizos un 1% por cada 15 puntos.","Un punto de Fuerza añade 18 de vida máxima, así como 0,55 % de regeneración de vida y 1 % de resistencia mágica cada 13 puntos.","La Hoja Sombría puede activarse mientras canalizas un Pergamino de Teletransporte o cualquier hechizo canalizado.","Cambiar el atributo de las Botas de Poder a Agilidad hará que regeneres vida y maná un poco más rápido. ¡No te olvides de volverlas a cambiar!","La Égida del Inmortal puede ser atacada y denegada.","Las ilusiones otorgan auras del héroe original a las unidades cercanas.","No necesitas destruir los barracones de un equipo para dañar las torres cercanas al Ancestro. Destruir los barracones es opcional.","Los guerreros invocados con un Necronomicón de nivel 3 poseen visión verdadera.","Los efectos del Polvo de la Revelación pueden ser purgados.","Las runas se pueden atacar y denegar.","El daño por hendidura es un daño físico y es mitigado por la armadura.","Al atacar con una Desoladora, incluso el primer ataque se beneficiará de una reducción de armadura en el objetivo.","Las torres de nivel 1 no tienen Protección de Retaguardia.","La Protección de Retaguardia de las torres de nivel 2 está inhabilitada si un enemigo se arrastra cerca. Protección de Retaguardia de cada torre de Nivel 2 es independiente de las demás.","Todas las torres de nivel 3 y 4, Barracones y la Fortaleza Ancestral comparten su Protección de Retaguardia que se deshabilita cuando un creep enemigo está cerca de cualquier parte de la base.","Protección de Retaguardia continúa inhabilitada por un corto período de tiempo, incluso después de que todos los enemigos han abandonado el área.","Malla de Cuchillas devuelve el mismo tipo de daño que se recibió.","El daño devuelto de Malla de Cuchillas atraviesa la inmunidad a hechizos si la fuente original lo hace.","El Ojo de Skadi atraviesa la inmunidad a hechizos y no puede disiparse.","Recuerda llevar siempre un Pergamino de Teletransporte.","Los objetos que generan un aura que se aplica a los creeps aliados pueden desactivarse para que el aura solo se aplique a los héroes cercanos. Usa esto para evitar presionar la senda.","Los creeps neutrales con la habilidad Golpear solo la usarán cuando tres o más objetivos válidos estén a su alcance.","La mayoría de creeps ancestrales tienen gran resistencia mágica. Comparado con otros creeps neutrales, es posible que sea menos eficiente asesinarlos con hechizos.","Los ataques normales tienen una animación posterior a la del punto de ataque. Cualquier orden cancelará esta animación posterior, y esto se puede usar para perseguir a un objetivo más rápido.","Un héroe enemigo solo gana cargas de la Varita Mágica si te tiene en su visión cuando lanzas un hechizo. Puedes utilizar esto para encontrar guardianes enemigos.","Protección de Shiva proporciona visión aérea en un área de 800 unidades alrededor de su lanzador, lo que la hace muy útil para explorar terrenos elevados o echar un vistazo tras los obstáculos.","La Hoja Plateada y la Alabarda Celestial no atraviesan la inmunidad a hechizos, pero no pueden disiparse.","Si atacas a un héroe mientras te encuentres a 500 unidades o más de distancia de los creeps, estos no te atacarán."],"hero":{"antimage":["La inmunidad a hechizos evitará que la habilidad Ruptura de Maná de Anti-Mage queme maná o cause daño adicional."],"axe":["El efecto de Sed de Batalla de Axe se puede disipar dando el último golpe a un creep de senda o neutral.","Llamada del Berserker de Axe atraviesa la inmunidad a hechizos, lo que la hace muy efectiva a la hora de bloquear enemigos con la Vara del Rey Negro.","Usar un Cetro de Eul en Axe tras su Llamada del Berserker es una forma efectiva de mitigar el daño que los aliados reciban de su Contraataque Espiral.","Axe obtiene una bonificación de velocidad de movimiento por cada enemigo que esté afectado actualmente por Sed de Batalla. Los creeps enemigos proporcionan la mitad de la bonificación.","Las ilusiones de Axe, como por ejemplo las de la Runa de Ilusión o Estilo Manta, tienen un Contraataque Espiral a plena potencia.","Hoja Selectiva de Axe puede matar a los objetivos incluso a través de Tumba Vacía de Dazzle o Falsa Promesa de Oracle.","Hoja Selectiva de Axe se puede usar para matar al mensajero."],"bane":["Atacar a un aliado bajo el efecto de Pesadilla de Bane lo liberará de esa pesadilla, pero hará que seas tú quien la sufra.","Bane puede cancelar su Pesadilla en cualquier momento, en unidades enemigas o aliadas.","Pesadilla de Bane le otorga al objetivo un breve momento de invulnerabilidad en el lanzamiento, y se puede utilizar para mitigar la cantidad de daño que reciban los aliados.","Bane tiene muchas habilidades de objetivo único, lo que hace que la Esfera de Linken y el Orbe de Loto sean muy efectivos cuando se usan contra él.","Si se usa antes de que el objetivo emplee una Vara del Rey Negro, Debilitar de Bane persistirá incluso a través de la disipación y puede ser un hechizo muy poderoso contra enemigos que dependan de ataques físicos."],"bloodseeker":["Es posible usar un Pergamino de Teletransporte mientras se esté bajo los efectos de Rotura de Bloodseeker sin recibir más daño.","Furia Sangrienta de Bloodseeker aumentará aún más el daño que los enemigos reciban de todos los ataques. Sin embargo, también aumentará el daño de los ataques de los enemigos, así que debería ser usada con mucho cuidado.","Si se lanza Furia Sangrienta sobre un aliado, Bloodseeker podrá ayudarle a curarse rápidamente asesinando a creeps cercanos.","Furia Sangrienta de Bloodseeker aumenta el daño de habilidades y objetos, tales como Rito de Sangre y Rotura, así como el de los ataques físicos.","Esfera de Linken bloqueará Rotura de Bloodseeker, y puede ser una inversión valiosa para ciertos héroes que se enfrenten a Bloodseeker.","A pesar de no tener ningún coste de maná, Furia Sangrienta de Bloodseeker aumentará las cargas en el Palo Mágico o en la Varita Mágica, las cuales pueden resultar muy útiles contra él durante la fase de sendas de la partida.","Sed de Bloodseeker le permite sobrepasar el límite normal de 550 de velocidad de movimiento.","Si tienes suficiente vida, la Malla de Cuchillas puede ser muy efectiva para volver Rotura en contra de Bloodseeker."],"crystal_maiden":["Congelación  de Crystal Maiden, al igual que otras raíces, puede usarse para interrumpir a un enemigo que canaliza el Pergamino de Teletransporte.","Explosión Cristalina de Crystal Maiden proporciona una pequeña cantidad de visión en la zona objetivo, y puede ser muy útil al explorar áreas ocultas o localizar enemigos que intenten huir a través de los árboles.","Al igual que la mayoría de inmovilizadores, Congelación de Crystal Maiden se puede contrarrestar con la disipación de objetos como la del Cetro de la Divinidad de Eul o la del Estilo Manta.","El talento de reducción de pérdida de maná de nivel 15 de Crystal Maiden para el Aura Arcana funciona contra enemigos basados en la quema de maná por daño, tales como Anti-Mage o Nyx Assassin."],"drow_ranger":["Las Flechas Gélidas de Drow Ranger no atraerán a los creeps si se lanzan manualmente en lugar de autolanzarse durante un ataque. Puedes emplear esto para acosar en una senda.","Ráfaga de Drow Ranger no incapacita unidades enemigas o cancela canalizaciones de objetos como Pergamino de Teletransporte. Los héroes enemigos que sean empujados por Ráfaga aún podrán usar objetos y atacar.","Drow Ranger puede activar su Aura de Precisión dando velocidad de ataque a los creeps asaltantes que están atacando torres.","La mejora del Cetro de Aghanim para Drow Ranger añade todos los modificadores a los ataques divididos de Drow, tales como Flechas Gélidas o los relámpagos de Maelstrom.","Drow Ranger procura mantener la distancia con sus enemigos, haciéndola susceptible a iniciaciones con la Daga de Traslación o la Hoja Sombría."],"earthshaker":["La habilidad Golpe Resonante de Earthshaker inflige más daño cuando hay más unidades enemigas en el área de efecto. Trata de dispersarte cuando te enfrentes a Earthshaker.","Fisura de Earthshaker desplazará cualquier unidad que encuentre a su paso a un lado o al otro, permitiéndole mover aliados o enemigos a posiciones más ventajosas.","El daño adicional de Encantar Tótem dura más que el tiempo de recarga del hechizo en sí, lo que le permite a Earthshaker infligir cantidades masivas de daño físico si se usa antes y durante la batalla.","Earthshaker depende mucho de objetos como Daga de Traslación y Bastón de la Fuerza para lograr una buena posición para el uso de sus hechizos. Limitar su movilidad es crucial a la hora de mitigar el daño que causa.","Encantar Tótem tiene Ataque Certero, lo que permite que Earthshaker sea muy efectivo contra héroes con evasión como Phantom Assassin u objetos como Mariposa.","A diferencia de las otras habilidades de Earthshaker, Golpe Resonante tiene un tiempo de lanzamiento muy corto, lo que lo hace ideal para iniciar combates con enemigos antes de que puedan reaccionar con objetos defensivos.","El largo alcance de Fisura es ideal para bloquear la ruta de escape de un enemigo o incluso para evitar que los creeps aliados avancen durante un corto periodo de tiempo.","Gran parte de la utilidad de Earthshaker proviene de la enorme cantidad de incapacitación que pueda causar. La inmunidad mágica de un objeto como la Vara del Rey Negro es crucial para mitigar su efectividad."],"juggernaut":["Omnilátigo de Juggernaut reparte los ataques aleatoriamente entre objetivos cercanos. Tener muchas unidades enemigas cerca de Juggernaut hará que cada una de ellas reciba una pequeña cantidad de daño, en lugar de centrar todos los ataques en un mismo objetivo.","Furia de la Hoja de Juggernaut puede utilizarse para otorgar inmunidad mágica antes o después de usar un Pergamino de Teletransporte.","Juggernaut puede usar una Daga de Traslación durante Omnilátigo para conectarse con otros objetivos que de otro modo serían alcanzables.","Omnilátigo de Juggernaut inflige daño físico que puede anularse completamente con el Cetro Fantasmal o el Cetro de la Divinidad de Eul.","Los ataques regulares de Juggernaut no infligen daño mientras Furia de la Hoja esté activa, excepto a estructuras y guardianes.","El Guardián Sanador es extremadamente eficiente a la hora de curar al equipo de Juggernaut, y podría ser un objetivo prioritario para los enemigos durante las batallas."],"mirana":["La Flecha Sagrada de Mirana volará a través de sus unidades aliadas.","La mejora del Cetro de Aghanim de Mirana no activará Tormenta Estelar si ella es invisible, permitiéndole ubicarse estratégicamente antes de utilizarla.","Flecha Sagrada de Mirana tiene un tiempo de recorrido considerable. Un compañero de equipo que pueda incapacitar aumentará enormemente las posibilidades de que Mirana impacte en los héroes enemigos.","Flecha Sagrada de Mirana puede ser muy útil para explorar las áreas oscuras del mapa.","Sombra a la Luz de la Luna de Mirana se puede utilizar ofensivamente para atacar por sorpresa al equipo enemigo.","Llevar un Polvo de la Revelación o un Guardián Centinela puede marcar la diferencia entre una derrota y una victoria al enfrentarse a un equipo con Mirana.","Las habilidades con disipaciones fuertes, como Escudo Afótico de Abaddon, son excelentes para eliminar un aturdimiento largo de un aliado causado por Flecha Sagrada de Mirana."],"morphling":["Silencio puede ser efectivo para bloquear un Morphling evasivo.","Morphling puede usar objetos y habilidades durante Forma de Ola, como por ejemplo Hoja Etérea o Pergamino de Teletransporte.","Morphling puede usar objetos durante Forma de Ola, como por ejemplo Hoja Etérea o Pergamino de Teletransporte.","Tras regresar de Transormación, la vida y el maná de Morphling se reiniciarán a los valores anteriores a la transformación.","Las habilidades que cancelan curación, tales como Explosión de Hielo de Ancient Apparition, impedirán que Morphling gane vida cuando cambie de atributos.","Morphling seguirá cambiando sus atributos incluso si está incapacitado o silenciado."],"nevermore":["Réquiem de las Almas se lanzará al morir Shadow Fiend, incluso si está interrumpido.","Maestría Nigromántica de Shadow Fiend es vital para causar daño significativo. Tras morir, Shadow Fiend será sustancialmente más débil hasta que recupere sus almas perdidas.","Shadow Fiend es experto en matar creeps y neutrales muy rápidamente. Negarle la oportunidad de hacerlo perjudica enormemente su efectividad más adelante en la partida.","Shadow Fiend sufre de una reserva de vida y de movilidad relativamente bajas. Podría ser un objetivo prioritario para los enemigos basados en ráfagas.","Réquiem de las Almas de Shadow Fiend tiene un tiempo de lanzamiento relativamente largo y puede ser cancelada por los enemigos o por el propio Shadow Fiend sin que tenga que recargarse ni cueste maná.","Una significativa cantidad de daño podría significar que Shadow Fiend fuese susceptible a una Malla de Cuchillas empleada por el equipo enemigo."],"phantom_lancer":["Phantom Lancer a menudo opta por crear una Hoja Difusora; la inmunidad mágica de la Vara del Rey Negro puede usarse para contrarrestar este efecto.","Phantom Lancer puede usar Doppelganger para disipar efectos y esquivar proyectiles.","Las ilusiones de Phantom Lancer que sean creadas por habilidades de los enemigos, tales como Trastorno de Shadow Demon o Reflejo de Terrorblade, aún tendrán la probabilidad de dividirse en más ilusiones.","Aplicar Ruptura a Phantom Lancer de un objeto como Hoja Plateada o la habilidad Infratoxina de Viper, evitará que Phantom Lancer cree ilusiones adicionales de Yuxtaponer."],"puck":["Silencio puede ser efectiva para sujetar a un Puck complicado.","Puck puede cancelar Cambio de Fase en cualquier momento usando una habilidad u objeto.","Si se elige el talento de Fuego Rápido de Espiral de Sueños, Puck seguirá atacando a enemigos afectados por Espiral de Sueños incluso cuando haya realizado Cambio de Fase.","Si los oponentes dependen en gran medida de la inmunidad mágica, Puck puede optar por comprar un Cetro de Aghanim para asegurarse de que Espiral de Sueños siga siendo una poderosa incapacitación.","Puck tiene muchas habilidades de área de efecto, y es crucial mantenerse dispersado cuando juegas en el equipo contrario."],"pudge":["La habilidad Descuartizar de Pudge es canalizada, y se puede interrumpir con un silencio o aturdimiento.","Pudge a menudo basa su juego en atacar desde ángulos inesperados. Tener una visión adecuada con Guardianes Observadores aumentará enormemente la capacidad de supervivencia del equipo enemigo."],"razor":["La habilidad Campo de Plasma de Razor hace más daño cuanto más lejos está el objetivo.","Ojo de la Tormenta de Razor dará prioridad a los objetivos que estén siendo drenados con Vínculo Estático."],"sand_king":["La habilidad Epicentro de Sand King seguirá provocando pulsaciones en toda su duración, incluso si Sand King muere.","Llevar medios de detección, como Polvo de la Revelación, o tener una habilidad que incapacite o silencie a los enemigos en un área, como Escisión Fluctuante de Puck, puede ser muy importante cuando se trata de atrapar a Sand King durante Tormenta de Arena."],"storm_spirit":["Silencio puede ser efectivo para bloquear un Storm Spirit evasivo.","La invulnerabilidad de Storm Spirit durante Rayo Esférico significa que puede ignorar completamente la mayoría de los efectos negativos de los hechizos basados en el movimiento, como la Ruptura de Bloodseeker."],"sven":["Gran Hendidura de Sven causa daño físico en un área que es mitigado por la armadura.","El Grito de Guerra de Sven te otorga a ti y a los héroes aliados cercanos una velocidad de movimiento adicional y un escudo de vida que bloquea el daño de ataque según la salud del escudo.","La mayor parte del daño de Sven proviene de sus ataques físicos y puede anularse con un objeto como Alabarda Celestial."],"tiny":["Las unidades en el aire del Lanzamiento de Tiny recibirán el triple del daño de la Avalancha de Tiny.","La ausencia de armadura base de Tiny hace que sea muy vulnerable a los ataques físicos y a las habilidades que reducen la armadura."],"vengefulspirit":["Aura Vengativa de Vengeful Spirit aumentará el daño base y el daño del atributo principal de un héroe. El daño adicional, como por ejemplo el de un Estoque Divino, no se aumentará.","Intercambio Abisal de Vengeful Spirit interrumpe los hechizos canalizados tanto de aliados como de enemigos."],"windrunner":["Windranger puede elegir no atacar al objetivo de su Fuego Concentrado atacando a un objetivo diferente o cancelando la acción actual."],"zuus":["Relámpago de Zeus puede lanzarse sobre el suelo para revelar las unidades invisibles cercanas, incluyendo guardianes."],"kunkka":["Un Disco del Eón es a menudo un buen elemento para la fase final de la partida, cuando te enfrentas a un Kunkka con muchos objetos de daño."],"lina":["La habilidad Hoja de Laguna de Lina atravesará la inmunidad a hechizos, si Lina construye un Cetro de Aghanim."],"lion":["Las habilidades Maldición de Lion y Drenaje de Maná destruirán instantáneamente una ilusión."],"shadow_shaman":["Los Guardianes Serpiente en Masa de Shadow Shaman no se ven afectados por el bloqueo de daño, por ejemplo del que provenga de un Protector Carmesí."],"slardar":["Neblina Corrosiva de Slardar proporciona visión verdadera y visión del objetivo."],"tidehunter":["Caparazón de Kraken de Tidehunter activará una disipación fuerte sobre él cuando suficientes jugadores le hayan infligido daño en un corto intervalo de tiempo."],"witch_doctor":["La Malla de Cuchillas no devolverá el daño del Guardián de la Muerte de Witch Doctor, ya que el origen del daño es el guardián y no el propio Witch Doctor."],"lich":["Lich canalizando Mirada Siniestra hace que un héroe enemigo objetivo camine lentamente hacia Lich.","Escudo de Hielo de Lich puede lanzarse sobre estructuras aliadas."],"riki":["Riki es invulnerable e invisible durante Secretos del Oficio, y no puede ser revelado con visión verdadera durante este hechizo."],"enigma":["Pulso de Medianoche de Enigma inflige daño basándose en un porcentaje de la vida máxima del objetivo."],"tinker":["Los Misiles Infrarrojos solo se fijarán en objetivos de los que Tinker tenga visión."],"sniper":["Metralla de Sniper no afecta a las estructuras. Múltiples efectos de Metralla no son acumulables sobre el mismo objetivo."],"necrolyte":["La habilidad Velo Fantasmal de Necrophos lo hace inmune a los ataques físicos, pero recibe daño mágico adicional bajo este estado."],"warlock":["La habilidad Ataduras Funestas de Warlock causa daño repartido entre las víctimas, sin importar las distancia que tengan entre ellas."],"beastmaster":["Rugido Primordial de Beastmaster aturdirá a los objetivos inmunes a hechizos.","Hachas Salvajes de Beastmaster se pueden usar para cortar árboles para revelar enemigos ocultos.","Bestia Interior de Beastmaster afecta a los héroes aliados, así como a creeps e invocaciones. Las unidades creadas con Necronomicón o Yelmo del Dominador se benefician enormemente de esta aura.","Esfera de Linken bloqueará completamente el objetivo primario de Rugido Primordial de Beastmaster.","Las invocaciones de Llamada de lo Salvaje de Beastmaster son extremadamente útiles para explorar y hostigar a los héroes enemigos, pero proporcionan una sustancial cantidad de oro y experiencia si son asesinados.","Una disipación fuerte, como la de Disco del Eón o Esculo Afótico de Abaddon, se puede usar para eliminar el aturdimiento de Rugido Primordial de Beastmaster."],"queenofpain":["La habilidad Onda Sónica de Queen of Pain causa daño puro, y no se puede evitar por armadura, resistencia mágica o inmunidad a hechizos. También causará daño a los mensajeros."],"venomancer":["Los Guardianes de la Plaga de Venomancer no se ven afectados por el bloqueo de daño, por ejemplo del que provenga de un Escudo Robusto o un Protector Carmesí."],"faceless_void":["Salto Temporal de Faceless Void no evita proyectiles. Salto Temporal es un efecto curativo y puede evitarse mediante Explosión de Hielo de Ancient Apparition o ser reducido mediante la Vasija Espiritual."],"skeleton_king":["Reencarnación de Wraith King se activará incluso si Wraith King está afectado por una interrupción. No se activará si Wraith King no tiene suficiente maná; un talento puede reducir este coste a 0."],"death_prophet":["Los espíritus de Exorcismo de Death Prophet causan daño físico, y puede mitigarse mediante armadura."],"phantom_assassin":["Un Disco del Eón o una Malla de Cuchillas puede ser un buen objeto a crear para enfrentarse a una Phantom Assassin con un alto daño de ráfaga."],"pugna":["La habilidad Explosión Abisal de Pugna inflige la mitad de daño a las estructuras."],"templar_assassin":["La habilidad Refracción de Templar Assassin bloquea un número de instancias de daño, sin importar la cantidad de daño que dichas instancias causarían."],"viper":["Infratoxina de Viper causa interrupción en los objetivos afectados, incapacitando habilidades pasivas. Esto puede ser muy efectivo contra héroes como Bristleback."],"luna":["La habilidad Eclipse de Luna continuará hasta el final, incluso si Luna está silenciada o aturdida. Eclipse se detendrá si Luna muere."],"dragon_knight":["El Aliento Corrosivo de Forma de Dragón Ancestral de Dragon Knight afecta a las estructuras además de las unidades, convirtiéndola en una efectiva habilidad de asedio.","La reducción de daño de Aliento de Fuego de Dragon Knight es una herramienta muy efectiva al intercambiar ataques contra un oponente o al mitigar la habilidad de un enemigo para asestar últimos golpes a creeps en una senda.","Gran parte de la capacidad de supervivencia de Dragon Knight proviene de su habilidad pasiva Sangre Dracónica, que le otorga regeneración de vida y armadura adicionales, lo que hace que sea vulnerable a los efectos que desactivan las habilidades pasivas, como Infratoxina de Viper o la Hoja Plateada.","Durante Forma de Dragón, Dragon Knight se convierte en un héroe a distancia, lo que le permite beneficiarse de objetos como Pica Huracán, pero perdiendo las bonificaciones otorgadas por objetos cuerpo a cuerpo como el Sable de Eco.","Dragon Knight confía en poder acercarse a sus objetivos para ser efectivo. Las habilidades y los objetos que lo frenan, como la Vara de Atos de Shiva, son muy efectivos para mantenerlo alejado.","La elevada armadura de Dragon Knight lo hace muy resistente al daño físico, pero puede mitigarse con objetos reductores de armadura como Coraza de Asalto o Medallón del Coraje."],"dazzle":["La habilidad Tumba Vacía de Dazzle evita que el objetivo muera mientras dure cualquier cantidad de daño que provenga de cualquier origen. Sin embargo, las habilidades de muerte instantánea aún pueden asesinar a una unidad durante Tumba Vacía."],"rattletrap":["La habilidad Batería de Asalto de Clockwerk continuará, incluso si Clockwerk está silenciado o aturdido. Batería de Asalto se detendrá si Clockwerk muere.","Garfio de Clockwerk aturde a los oponentes durante un tiempo considerable, dándole tiempo para reposicionarse y colocar estratégicamente sus Engranajes Electrificados, empujando al enemigo hacia la dirección deseada e incapacitándolo aún más.","Un Bastón de la Fuerza es efectivo para sacar a un héroe aliado de los Engranajes Electrificados de Clockwerk.","Garfio atraerá a Clockwerk hasta cualquier unidad, ya sea aliada o enemiga, lo cual puede ser una efectiva forma de huida.","Batería de Asalto de Clockwerk es extremadamente efectiva a la hora de acabar con enemigos con hechizos de canalización o largos tiempos de lanzamiento.","Cohete Bengala de Clockwerk es muy útil para vigilar los movimientos del enemigo y repeler creeps que se encuentren lejos del equipo.","Una Vara del Rey Negro evitará la mayoría del daño causado por las habilidades de Clockwerk. No obstante, su Garfio aún aturdirá a un objetivo inmune a la magia."],"leshrac":["Decreto Diabólico de Leshrac inflige daño adicional a estructuras, lo que la convierte en una efectiva habilidad de asedio."],"furion":["Los árboles de Brotar de Nature's Prophet pueden cortarse con una Hoja Mitigante o ser consumidos con un Tango."],"life_stealer":["La habilidad Heridas Abiertas hace que los aliados de Lifestealer obtengan Robo de Vida contra la víctima con cualquier ataque, incluyendo hechizos."],"dark_seer":["Caparazón Iónico de Dark Seer dañará a las unidades cercanas aunque sean invisibles."],"clinkz":["La habilidad Flechas Abrasadoras de Clinkz causa daño físico adicional en sus ataques."],"omniknight":["La habilidad Purificación de Omniknight causa daño puro, el cual no se puede mitigar mediante resistencia mágica."],"enchantress":["Los efectos negativos de Intocable de Enchantress se pueden mitigar disponiendo de inmunidad a hechizos, o atacando brevemente durante la animación final del ataque."],"huskar":["Lanza Flamígera de Huskar inflige daño mágico adicional, o daño puro si se elige un talento. Lanza Flamígera no tiene efecto en las estructuras.","Quebrantavidas de Huskar aplica un disipador básico y otorga inmunidad contra hechizos durante el brinco."],"night_stalker":["Las bonificaciones nocturnas de Night Stalker también se aplican durante el Eclipse de Luna."],"broodmother":["Las crías de araña de Broodmother pueden generar arañitas de las unidades que dañen y que mueran posteriormente."],"bounty_hunter":["Los aliados solo obtendrán el oro extra de la pista de Bounty Hunter si están a menos de 1200 de la víctima cuando muera. El mismo Bounty Hunter no tiene restricciones de rango para obtener oro extra de la pista."],"weaver":["Los escarabajos de Enjambre de Weaver aplican daño físico que ignora evasión, pero es mitigado por armadura o efectos de bloqueo."],"jakiro":["Fuego Líquido de Jakiro afecta a las estructuras, lo que la convierte en una efectiva habilidad de asedio."],"batrider":["Napalm Pegajoso de Batrider inflige daño mágico adicional a la víctima cuando Batrider ataca. Napalm Pegajoso no se activa cuando otras unidades atacan al objetivo."],"chen":["La Penitencia de Chen hace que todas las unidades aliadas que atacan a la unidad objetivo ganen velocidad de ataque."],"spectre":["La habilidad Dispersión de Spectre devuelve a los atacantes el mismo tipo de daño que ellos infligen. Reflejará más daño a las unidades que estén más cerca de Spectre."],"ancient_apparition":["Explosión de Hielo de Ancient Apparition impide los efectos curativos a las unidades afectadas. Si la vida de la víctima cae por debajo de un límite crítico, la víctima será asesinada."],"doom_bringer":["La habilidad Condenación de Doom causa daño puro, el cual no se puede mitigar con armadura o resistencia mágica.","Devorar otorgará a Doom no solo la habilidad activa de la unidad objetivo, sino también sus habilidades pasivas y auras, convirtiéndole en un héroe indispensable para las batallas en equipo.","Una Esfera de Linken es una gran forma de bloquear Condenación de Doom. Doom puede contrarrestar esto devorando un creep neutral con una habilidad específica, como la del Desterrador Sátiro, o creando un objetivo activo, como la Alabarda Celestial.","Tierra quemada daña a los enemigos cercanos y proporciona a Condenación una mayor velocidad de movimiento.","Mejorar Condenación con un Cetro de Aghanim aplicará un efecto de Ruptura sobre el objetivo, haciéndolo muy efectivo contra enemigos con poderosas habilidades pasivas, tales como Phantom Assassin o Spirit Breaker."],"ursa":["La habilidad Arañazos Furiosos de Ursa causa daño físico adicional al atacar a un objetivo repetidamente. Arañazos Furiosos no funciona sobre estructuras, pero sí afecta a Roshan."],"spirit_breaker":["La habilidad Embestida de la Oscuridad de Spirit Breaker se puede usar para activar la Esfera de Linken de un enemigo a cualquier distancia, siempre y cuando Spirit Breaker tenga visión del objetivo."],"gyrocopter":["Misil Buscador de Gyrocopter puede seguir objetivos invisibles, pero no otorga visión verdadera."],"alchemist":["El oro que Alchemist gana mediante Avaricia de Greevil no es fiable.","Ácido Pulverizado de Alchemist inflige daño físico y reduce la armadura, lo que lo convierte en una herramienta eficaz para matar a los neutrales ancestrales o a Roshan.","Si Alchemist está silenciado o no tiene ningún héroe enemigo al que atacar cuando Mezcla Inestable alcance su máximo potencial, el propio Alchemist quedará aturdido y vulnerable ante sus enemigos.","La bonificación de runa de recompensa de Avaricia de Greevil de Alchemist solo se aplica al propio Alchemist, sin importar quién recoja la runa.","Furia Química de Alchemist le otorga una enorme bonificación de regeneración de vida que se puede mitigar con Vasija Espiritual o Explosión de Hielo de Ancient Apparition.","La síntesis del Cetro de Aghanim de Alchemist otorgará al objetivo aliado atributos del Cetro, incluso si el héroe no obtiene otras bonificaciones de habilidades a partir de él."],"invoker":["Impacto Solar de Invoker inflige daño puro, que no puede mitigarse con resistencia mágica o inmunidad a hechizos."],"silencer":["Gujas de Sabiduría de Silencer inflige daño puro, el cual no se puede mitigar con resistencia mágica, pero no atraviesa la inmunidad a hechizos. A menos que Silencer tenga un Cetro de Aghanim."],"obsidian_destroyer":["Orbe Arcano de Outworld Devourer inflige daño puro, el cual no se puede mitigar con resistencia mágica, pero no atraviesa la inmunidad a hechizos."],"lycan":["La habilidad Aullido de Lycan tiene alcance global y afecta a todos los aliados sin importar la distancia.","Cambio de Forma de Lycan aplica bonificaciones de impacto crítico y velocidad de movimiento a todas las unidades controladas por él, incluidas las invocadas con un Necronomicón."],"brewmaster":["Al finalizar Escisión Primordial, Brewmaster intentará reaparecer en la posición de Tierra si está vivo, luego en la de Tormenta si está vivo y, por último, en la de Fuego.","Una Vara del Rey Negro o una Espina Sangrienta puede ser una forma efectiva de contrarrestar la evasión de Camorrista Borracho de Brewmaster.","El cuerpo de Brewmaster empieza a humear cuando se le otorga un golpe crítico y evasión mediante Camorrista Borracho.","Tras Escisión Primordial, cualquier aura que tenga Brewmaster, como por ejemplo la de Resplandor o Aura de Vladmir, afectará a las unidades que rodeen a Tierra. Si Tierra está muerto, las que rodeen a Tormenta, y si Tormenta está muerto, las que rodeen a Fuego.","El espíritu Tormenta de Brewmaster puede utilizar Disipar Magia para cancelar su propio Ciclón."],"shadow_demon":["Cazador de Almas de Shadow Demon hace que todos los objetivos atrapados en el área pierdan temporalmente un porcentaje de su salud actual. Cazador de Almas puede ser lanzado sobre objetivos desterrados por Trastorno."],"lone_druid":["Espíritu Oso de Lone Druid inflige daño adicional a estructuras, convirtiéndose en una habilidad muy efectiva al asediar.","El Espíritu Oso de Lone Druid puede recoger runas. Lone Druid no necesita estar cerca para esto."],"chaos_knight":["Cuando Chaos Knight lanza Fantasma, esquiva los proyectiles y, durante un breve periodo, es invulnerable e inmune a hechizos.","Rayo del Caos de Chaos Knight tiene un tiempo de lanzamiento considerable, así como un proyectil lento, y puede evitarse mediante una Traslación oportuna o un Cetro de Eul.","Activar Brazalete de Mordiggian antes de usar Fantasma otorga a las copias de Chaos Knight daño y vida adicionales.","Las copias de Fantasma de Chaos Knight son susceptibles a cualquier habilidad que destruya instantáneamente las ilusiones, como Drenaje de Maná de Lion o Maldición de Shadow Shaman.","Fisura en la Realidad de Chaos tiene un tiempo de lanzamiento considerable y aún se puede esquivar después de que haya empezado a lanzar el hechizo.","La mayoría del daño causado por Chaos Knight es físico, y puede infligirse usando un objeto que otorgue armadura, como Cetro Fantasmal.","Fisura en la Realidad de Chaos Knight teletransportará todas sus ilusiones, incluyendo las de Estilo Manta y Runa de Ilusión."],"meepo":["Meepo obtiene EXP u oro cuando cualquiera de sus clones obtiene lo mismo. Meepo muere cada vez que muere uno de sus clones."],"treant":["Lanzar hechizos o usar objetos no elimina la invisibilidad de Apariencia de la Naturaleza de Treant Protector."],"ogre_magi":["Sed de Sangre de Ogre Magi puede lanzarse sobre las torres."],"undying":["Lápida de Undying no genera zombis para las unidades invisibles cercanas, y los zombis existentes desaparecerán si la unidad que persiguen se vuelve invisible."],"rubick":["Cuando Rubick lanza un hechizo robado puede hacerlo sin tiempo de lanzamiento, incluso si el hechizo normalmente tiene uno (con algunas pocas excepciones)."],"disruptor":["Impacto Atronador de Disruptor emite una pulsación cada dos segundos. Vislumbrar traslada al objetivo cuatro segundos atrás en el tiempo. Puedes utilizar Impacto Atronador para calcular el momento perfecto para lanzar Vislumbrar."],"nyx_assassin":["Caparazón Espinoso de Nyx Assassin devolverá el daño sin importar cuán lejos esté el atacante, e incluso si este es invisible."],"naga_siren":["Durante el lanzamiento de Espejismo, Naga Siren será brevemente invulnerable e inmune a hechizos, y esquivará los proyectiles."],"keeper_of_the_light":["El Cetro de Aghanim hace que Keeper of the Light se cure durante el día."],"wisp":["Cuando Io esté vinculado a un aliado, se moverá a la misma velocidad que dicho aliado."],"visage":["La habilidad Manto del Guardián de la Tumba de Visage reducirá su efectividad a medida que los jugadores ataquen a Visage, pero se regenerará rápidamente. Manto del Guardián de la Tumba también tiene efecto en los familiares de Visage.","Visage tiene una resistencia mágica del 10 %, menos que la mayoría de héroes, con un 25 %. Esto hace a Visage especialmente vulnerable al daño mágico si se elimina el Manto del Guardián de la Tumba.","Frío Sepulcral de Visage también otorga bonificaciones de velocidad de ataque y de movimiento a los familiares cercanos.","Los familiares de Visage pueden destruir árboles lanzando Forma Pétrea sobre ellos."],"slark":["Mientras está bajo el efecto de Baile de Sombras, Slark no puede ser revelado por visión verdadera."],"medusa":["Serpiente Mística de Medusa incrementa su daño y robo de maná con cada salto exitoso. El maná robado será un porcentaje del maná actual del objetivo."],"troll_warlord":["Fervor de Troll Warlord se acumula incluso si el ataque es esquivado o desviado."],"centaur":["Represaliar de Centaur Warrunner refleja el daño recibido como daño físico. También refleja el daño de los ataques de las torres.","Doble Filo de Centaur inflige daño mágico que se puede mitigar con la resistencia a hechizos de sus objetivos, así como la del propio Centaur.","Estampida de Centaur es global, y se puede usar para ayudar a los aliados a atacar o a retirarse incluso cuando Centaur se encuentre lejos.","La Vara de Atos o el Cetro de Eul son una buena forma de evitar que los aliados de Centaur huyan durante Estampida.","Centaur tiene una considerable reserva de vida, por lo que muchas habilidades que inflijan daño basado en la vida del oponente, tales como Festín de Lifestealer o Aura Detienecorazones de Necrophos, son muy efectivas.","La inmunidad mágica, como la de la Vara del Rey Negro, es muy efectiva para evitar un montón de daño de ráfaga causado por las habilidades Estampida, Doble Filo y Pisotón de Centaur."],"magnataur":["La habilidad Potenciar de Magnus le otorga el objetivo de Hendidura, lo que causa daño físico en un área alrededor de cada ataque."],"shredder":["Cuando Timbersaw esté afectado por Ruptura, no ganará acumulaciones adicionales de Armadura Reactiva, pero las acumulaciones existentes seguirán proporcionando armadura y regeneración de vida."],"bristleback":["Cuando Bristleback está afectado por Interrupción, su habilidad Espalda Espinosa queda desactivada, lo que reduce sustancialmente sus probabilidades de supervivencia.","La habilidad Viscosidad Nasal de Bristleback que haya sido mejorada con el Cetro de Aghanim no será bloqueada por Esfera de Linken.","Bristleback puede lanzar Viscosidad Nasal sobre enemigos múltiples veces, reduciendo en gran medida su armadura y velocidad de ataque. Lo que la convierte en muy efectiva para atacar a Roshan.","Impedir que Bristleback lance constantemente Lluvia de Espinas (por ejemplo con un Silencio) reducirá en gran medida la cantidad de daño que él pueda causar.","Las habilidades de Bristleback no precisan golpear las unidades enemigas para activar su Senda de Guerra.","El daño de Lluvia de Espinas de Bristleback es físico, y se puede reducir con armadura.","A Bristleback le gusta un montón lanzar hechizos, así que el Palo Mágico o la Varita Mágica son muy efectivos cuando se usan contra él."],"tusk":["Bola de Nieve de Tusk hace más daño cuantos más héroes hay dentro de ella."],"skywrath_mage":["Proyectil Arcano de Skywrath Mage inflige mucho más daño basándose en la inteligencia de Skywrath."],"abaddon":["Tiempo Prestado de Abaddon aún puede activarse manualmente cuando Abaddon está afectado por Interrupción.","El daño de área de Escudo Afótico es independiente de la cantidad de daño absorbida.","Abaddon puede usar su habilidad Escudo Afótico para eliminar la mayoría de efectos negativos y aturdimientos de héroes aliados.","El efecto negativo de Maldición del Averno de Abbadon se aplica a estructuras, lo que lo convierte en un héroe muy efectivo a la hora de asediar.","Tiempo Prestado de Abaddon se puede activar manualmente incluso estando dormido o aturdido, lo que eliminará la mayoría de efectos negativos.","Si Abbadon recibe más del límite pasivo en daño de Tiempo Prestado, el efecto de dicha habilidad no se activará automáticamente.","Impedir que Abbadon reciba daño mientras Tiempo Prestado esté activo (como por ejemplo con un Cetro de Eul) es una forma efectiva de mantenerle en el mismo sitio mientras espera el efecto.","Escudo Afótico de Abaddon no hará daño a unidades de las que Abaddon no tenga visión. Puedes usar la niebla de guerra o la invisibilidad para evitar el daño."],"elder_titan":["Orden Natural de Elder Titan reduce la armadura de los enemigos que se encuentren alrededor de Elder Titan, y la resistencia mágica de los que se encuentren alrededor del Espíritu de Elder Titan."],"legion_commander":["Aunque Duelo de Legion Commander no atraviese la inmunidad a hechizos de una Vara del Rey Negro, una Esfera de Linken evitará el Duelo."],"techies":["Las Minas de Proximidad de Techies son reveladas automáticamente cuando un enemigo anda cerca de ellas. Las Trampas de Estáticas y las Minas Remotas requieren Visión Verdadera para ser reveladas.","La habilidad ¡Despegue! de Techies se puede interrumpir aplicando efectos de movimiento forzados (como Bastón de la Fuerza) durante el salto."],"ember_spirit":["Cadenas Abrasadoras de Ember Spirit pueden interrumpir un objetivo que esté canalizando, como por ejemplo un enemigo que esté huyendo con Pergamino de Teletransporte."],"earth_spirit":["Golpe de Roca de Earth Spirit no aturde a la unidad objetivo directamente, solo las unidades alcanzadas por un remanente golpeado.","Earth Spirit puede usar objetos y habilidades durante Roca Rodante, lo que le permite prepararse para futuros ataques.","Ponerse delante de un Earth Spirit que ha usado Roca Rodante es una manera efectiva de evitar que se escape.","Con la sincronización adecuada, Earth Spirit puede usar el mismo Remanente de Piedra para aturdir y silenciar a un enemigo, lo que le permitirá conservar Remanentes para su futuro uso.","Usar Golpe de Roca en aliados puede ser una forma efectiva de llevarlos a un lugar seguro o recolocarlos en una posición ventajosa.","Mejorar Atracción Geomagnética con su talento facilita a Earth Spirit salvar aliados que estén siendo atacados por enemigos.","Encantar Remanente hace al objetivo temporalmente invulnerable, permitiéndole a Earth Spirit usarlo para salvar a aliados que estén en peligro."],"abyssal_underlord":["La habilidad Tormenta de Fuego de Underlord inflige un porcentaje de los puntos de vida máximos de la víctima como daño mágico con cada oleada, lo que la hace muy eficaz contra determinados héroes."],"terrorblade":["Desgarrar de Terrorblade no atraviesa la inmunidad a hechizos de una Vara del Rey Negro. Una Esfera de Linken también evitará la acción de Desgarrar."],"phoenix":["Phoenix puede usar objetos y lanzar habilidades durante Picado de Ícaro."],"oracle":["Edicto del Destino de Oracle impide el daño mágico al objetivo, incluyendo el daño de Llamas Purificadoras. Esta combinación se puede usar para curar a los aliados de Oracle.","Fin de la Fortuna de Oracle puede disipar muchos efectos negativos de héroes enemigos, incluyendo el efecto de curación de Llamas Purificadoras.","La habilidad definitiva Falsa Promesa de Oracle doblará toda la curación realizada al objetivo cuando esté activa. Esto incluye objetos como Urna de las Sombras, Varita y Mekansm.","Durante Falsa Promesa de Oracle, el orbe superior será rojo si el objetivo ha recibido daño letal y se predice su muerte cuando el efecto finalice."],"winter_wyvern":["Los fragmentos de Esquirla Explosiva de Winter Wyvern golpearán a las unidades invisibles, así como a las unidades que se encuentren en la niebla de guerra.","Las unidades afectadas por Maldición del Invierno de Winter Wyvern no pueden recibir daño."],"arc_warden":["Campo Magnético de Arc Warden otorga evasión a los aliados que se encuentran dentro del campo frente a los ataques que vienen de fuera de él, incluidos los ataques de torres.","Campo Magnético de Arc Warden otorga evasión a las estructuras aliadas que están dentro del campo.","Duplicado de la Tempestad de Arc Warden disipará un humo enemigo, a diferencia de otras unidades invocadas.","El daño y la ralentización de Flujo de Arc Warden pueden evitarse estando cerca de una unidad aliada."],"monkey_king":["Golpe Infinito de Monkey King ignora la evasión y no puede fallar."],"pangolier":["Bravuconería de Pangolier ignora la evasión y no puede fallar."],"dark_willow":["Mientras está bajo el efecto de Reino de las Sombras, Dark Willow no puede ser revelada por visión verdadera."]}}