{"beginner":["Si notas que un héroe enemigo en tu senda desaparece, avisa a tus compañeros diciendo \"Missing Top (superior); Middle (central); Bottom (inferior)\". ¡Quizás salves la vida de un compañero!","Puedes subir de nivel tus habilidades manteniendo presionado el botón Control y pulsando su tecla asociada.","Usa Guardianes para mostrar partes del mapa y aumentar tu conocimiento sobre los movimientos del equipo enemigo.","Asegúrate de que tu equipo tiene un mensajero para que te traiga objetos de la tienda, así puedes permanecer en tu senda ganando experiencia y oro.","Los Guardianes Centinela revelan unidades invisibles cercanas, así como guardianes enemigos.","Roshan es mucho más fácil de asesinar si reduces su armadura.","Hacer clic manteniendo Mayús en objetos de la tienda los añadirá a la compra rápida.","Asestar el último golpe a una torre te dará más oro por haberla destruido.","La \"senda segura\" es la más larga en el lado del río de tu equipo. Para los Dire es la senda superior y para los Radiant la inferior.","La \"senda difícil\" es la más corta en el lado del río de tu equipo. Para los Dire es la senda inferior y para los Radiant la superior.","Normalmente un equipo sólo necesita un mensajero.","La bonificación de velocidad por llevar botas no es acumulable. No importa cuántas patas tenga el héroe que has elegido, sólo necesitas unas botas.","Puedes ver el inventario y las habilidades de un héroe enemigo seleccionándolo.","Suele ser buena idea llevar un Pergamino de Teletransporte.","Hay muchos senderos secretos escondidos entre los árboles, a menudo llamados \"puntos de esquive\". Recurre a éstos para eludir ataques o preparar emboscadas.","Usa Polvo de la Revelación para descubrir a los enemigos invisibles cercanos.","Cada dos minutos aparecerá una runa en el río, ya sea al norte o al sur de la senda central. A partir del minuto 40, se generarán dos runas, una al norte y la otra al sur.","Si tienes una Botella, recoger una runa la almacenará para usarla más tarde. Almacenar una runa también rellenará la Botella.","Puedes seleccionar una de las muchas guías creadas por otros usuarios para tu héroe usando el botón de guías situado a la izquierda de la barra superior.","¡Comprueba el minimapa a menudo! Puede que descubras que estás a punto de ser emboscado.","A menudo la mejor forma de aprender los puntos débiles de un héroe es jugar con él.","Destruir los barracones de tus enemigos aumentará la fuerza de los creeps de tu equipo en esa senda.","Las torres pueden ver y atacar a unidades invisibles.","Sé consciente de tu posición al atacar creeps. Puede que termines llevando a los creeps de tu equipo y a ti mismo hacia una ubicación peligrosa.","Las tiendas laterales venden muchos objetos útiles, incluyendo el Pergamino de Teletransporte y componentes para muchos tipos de botas.","Hay varios puntos elevados con marcas que indican buenas localizaciones para colocar Guardianes Observadores.","Permanecer cerca de la fuente de tu equipo restaurará tu vida y maná rápidamente.","La fuerza aumenta la vida máxima. La agilidad aumenta la velocidad de ataque. La inteligencia aumenta el maná máximo.","En realidad la Tienda Secreta no es secreta.","Un \"Asesino\" es un héroe que aumenta de poder poco a poco, volviéndose más fuerte a medida que la partida avanza. Un héroe de \"Apoyo\" suele ser más poderoso al principio de la partida, para después favorecer la efectividad de su equipo.","Siempre que tu héroe esté dentro del rango de un asesinato, ganarás experiencia.","Al activar el Glifo de Fortificación, puedes fortificar tus estructuras y creeps temporalmente y evitar todo el daño que reciban. Úsalo con sensatez; tiene un tiempo de recarga muy largo.","Usar un Pergamino de Teletransporte te permite teletransportarte a cualquier estructura aliada. Las Botas de Viaje te permiten teletransportarte a cualquier unidad aliada.","Si asesinan a tu mensajero, este reaparecerá junto con todos los objetos que cargaba dentro de 120 segundos. El mensajero volador tardará 180 segundos.","Cuando utilices un Tango, la regeneración de vida es siempre la misma sin importar el tamaño del árbol que consumas.","Hay muchas páginas web y vídeos que pueden ayudarte a aprender más sobre tácticas generales, formación de equipos y estrategias para tus héroes favoritos.","Puedes darle un Tango a un compañero de equipo usándolo sobre él.","Puedes usar Bálsamos Curativos o Claridades en tus compañeros. ¡Compartir es amor!","En la mayoría de los modos, cada jugador obtiene automáticamente 1 de oro cada 0.6 segundos o 100 cada minuto.","Puedes dar Pergaminos de Teletransporte a tus compañeros de equipo.","No se pueden colocar Guardianes Observadores o Centinelas dentro de la cueva de Roshan.","Las runas no recogidas serán reemplazadas cada dos minutos.","Conseguir oro matando creeps se suele llamar \"recolectar\" (o \"farming\" en inglés).","Hay ubicaciones de runa de recompensa en cada una de las cuatro junglas. Aparecen al comienzo de la partida y cada 5 minutos."],"intermediate":["Cuando Roshan haya sido asesinado, reaparecerá pasado un tiempo aleatorio de entre 8 y 11 minutos.","Los creeps neutrales aparecen en el minuto 1 y a partir de ahí reaparecerán cada minuto.","Algunos hechizos pueden esquivarse usando una Daga de Traslación o haciéndose invisible.","Atacar desde una posición elevada te da ventaja, ya que tu oponente puede fallar los ataques o perderte en la niebla de guerra.","Usar la Pipa de la Perspicacia te permite mitigar el daño por hechizos de los héroes enemigos.","Coraza de Asalto potencia la armadura de los aliados cercanos.","Cuando una torre te esté atacando, forzar un ataque y hacer clic a un creep aliado reiniciará el objetivo de la torre.","Colocar un Guardián o una unidad cerca de un campamento neutral puede prevenir que los creeps de dicho campamento reaparezcan cuando el contador marque el minuto.","La Vara del Rey Mono te dará precisión, lo que a menudo evita que los héroes enemigos evadan tus ataques, incluso cuando atacas cuesta arriba.","Hacer doble clic sobre tu Daga de Traslación hará que te teletransporte automáticamente hacia la fuente de tu equipo.","Puedes atacar creeps aliados que estén a punto de morir. Usa esto para denegar al enemigo el oro obtenido por los últimos golpes.","El daño mágico puede reducirse con objetos que otorguen resistencia al daño mágico.","El daño físico puede reducirse con objetos que otorguen armadura.","El daño puro no se puede reducir ni con armadura ni con resistencia al daño mágico.","Cambiar el atributo principal de las Botas de Poder puede romper la invisibilidad e interrumpir cualquier hechizo canalizado como el uso de un Pergamino de Teletransporte.","Atraer todos los creeps neutrales de un campamento cuando el contador esté cerca del minuto permitirá que reaparezcan nuevos creeps. Recurre a esto para aumentar el número de creeps que puedes matar.","Mantener presionada la tecla Control te permite usar las cargas de tu Botella en un héroe aliado. Las Runas embotelladas, sin embargo, no se pueden compartir.","¿Atrapado en tu base? Todavía puedes realizar compras en la Tienda Secreta enviando a tu mensajero allí. ¡Pero ten cuidado de no enviarlo hacia las fuerzas enemigas!","El daño adicional de la Hoja Mitigante solo afecta a los creeps enemigos y neutrales.","El daño bloqueado por el Escudo Robusto, el Escudo del Miserable y Vanguardia está determinado por el tipo héroe que lleve dicho objeto y no por el atacante.","Dagón, Necronomicón y Botas de Viaje se pueden mejorar volviendo a comprar sus recetas.","Puedes dar un único guardián a un compañero de equipo manteniendo pulsado Control, haciendo clic en el guardián en tu inventario y a continuación haciendo clic en tu compañero.","La Daga de Traslación y el Bastón de la Fuerza pueden usarse para descender o subir un acantilado.","Usa una Hoja Mitigante o Furia de Batalla para talar árboles y abrirte paso a través de los bosques.","Las ilusiones u otros creeps no disipan el Humo del Engaño, sólo los héroes enemigos y las torres lo hacen.","Mantener Alt pulsado mostrará información adicional en las descripciones de diversas habilidades y objetos.","Los barracones no pueden revelar unidades invisibles o guardianes.","Resurrección tiene un tiempo de recarga de 8 minutos.","Cada héroe tiene un atributo principal de Fuerza, Agilidad o Inteligencia. Cada punto gastado en los atributos del héroe aumenta su daño en 1.","A partir de su segunda muerte, Roshan dará un Queso además de la Égida del Inmortal. Usar el Queso rellena de forma instantánea 2500 de vida y 1500 de maná del héroe.","Recuerda comprobar el inventario de tus aliados antes de comprar un objeto por su aura. Puede ser que ya lo tenga otro miembro de tu equipo y las auras no se acumulan.","Las duraciones de aturdimiento de diferentes habilidades no se acumulan. Puedes mantener a un enemigo aturdido durante más tiempo si sincronizas tus habilidades con cuidado.","Los silencios o retrocesos no interrumpen las teleportaciones de Pergaminos de Teletransporte o Botas de Viaje.","Cuanto más cerca esté una torre de la Fortaleza Ancestral enemiga, más oro proporcionará su destrucción.","Usar un Anillo Espiritual te otorgará maná adicional incluso si tu maná está lleno del todo.","Puedes destruir torres aliadas cuando están por debajo del 10% de vida. Denegar una torre hace que el enemigo no obtenga oro por destruirla.","El daño físico, infligido mediante autoataques, algunas habilidades y objetos, puede reducirse con armadura o bloquearse al adquirir forma Etérea.","El daño mágico, infligido por la mayoría de habilidades y objetos, puede reducirse con resistencia al daño mágico o bloquearse con inmunidad a los hechizos.","Activar Estilo Manta te moverá de tu posición original cuando aparezcan las ilusiones. ¡Usa esto para confundir a tus enemigos!","Denegar creeps proporciona un 20% de su recompensa de oro al denegador.","Usa el escudo del mensajero volador sabiamente, ya que posee un tiempo de recarga muy largo.","Los héroes y unidades a distancia tienen una posibilidad del 25% de fallar cuando atacan posiciones elevadas.","Roshan se vuelve más fuerte cada minuto, obteniendo salud, daño y armadura adicionales.","Las runas de recompensa proporcionan oro a todo el equipo, independientemente del héroe que las recoja.","Algunas habilidades no se pueden bloquear con inmunidad a hechizos. La interacción de cada habilidad con la inmunidad a hechizos se muestra en su descripción.","Considera guardar oro para resucitar. Una resurrección bien calculada puede convertir una defensa a la desesperada en un veloz cambio de rumbo.","Las ilusiones infligen un 60 % menos de daño a las estructuras enemigas.","¡Recolectar en la jungla puede ser peligroso! Deberías comprar y colocar algunos guardianes para evitar que tus enemigos te embosquen.","Cada héroe alcanza su máxima eficacia en un momento diferente de la partida.","Si todos los héroes enemigos han desaparecido del minimapa, puede que estén matando a Roshan o preparando una emboscada.","Intenta colocar guardianes cerca del siguiente objetivo que tu equipo planea atacar.","Aprender a jugar como Apoyo te hará un mejor jugador de Asesino.\r\nAprender a jugar como Asesino te hará un mejor jugador de Apoyo.","Las Botas de Viaje se cancelan si la unidad de destino muere mientras se está canalizando.","Hacinar un campamento neutral te dará un porcentaje de la recompensa cuando seas asesinado.","El tercer Roshan asesinado en una partida dejará caer una Bendición de Aghanim o una Esquirla Revigorizante. El cuarto Roshan entregará ambas. Puedes seleccionar a Roshan para ver su inventario y averiguar qué objetos dejará caer al morir.","Las torres de nivel 2 o superior cuentan con un ataque multidisparo cuando se activa Glifo. Atacan hasta dos objetivos adicionales, dando prioridad a las unidades más cercanas."],"introduction":["Intenta luchar contra creeps y héroes enemigos dentro del rango de ataque de las torres de tu equipo.","Ten cuidado al cruzar el río hacia territorio enemigo.","Recuerda llevar objetos que restauren vida y maná al principio de la partida.","Compra y utiliza Pergaminos de Teletransporte para moverte por el mapa rápidamente.","Hay \"tiendas laterales\" en los límites este y oeste del mapa, donde puedes comprar diferentes objetos.","Algunos objetos sólo pueden comprarse en la \"Tienda Secreta\".","La mayoría de los héroes pueden aprender la habilidad \"definitiva\" en el nivel 6 y mejorarse en los niveles 12 y 18.","Asestar el último golpe al matar un creep o héroe te otorgará oro adicional.","Asegúrate de que tu equipo tiene un mensajero para llevaros objetos cuando estáis en las sendas.","Los objetos que compres mientras estés alejado de la tienda se pondrán en tu Reserva y podrás obtenerlos más adelante, o bien el mensajero puede llevártelos.","Si es necesario, podrás encontrar el modo para daltónicos en el menú de opciones.","La activación de un santuario proporciona regeneración de vida y maná para ti y los aliados cercanos."],"universal":["Los locutores y los aspectos del HUD se comparten entre todos los jugadores de la partida. Puedes escoger entre ellos pulsando el botón de contenido compartido del marcador.","Mantén la calma. Recuerda: es sólo un juego.","Puedes silenciar a los jugadores maleducados en la Tabla de Puntuaciones, a la que puedes acceder mediante los botones a la izquierda de la barra superior.","Tras escoger tu héroe, puedes hacer clic en el minimapa de la esquina inferior izquierda para informar a tus compañeros de equipo de qué senda pretendes usar cuando comience la partida.","Puedes mantener Alt y hacer clic en una de tus habilidades para informar a tus compañeros de equipo del estado del tiempo de recarga de esa habilidad.","Puedes informar a tus compañeros de equipo de que falta un enemigo manteniendo Alt y haciendo clic en sus respectivos retratos de la barra superior.","Intenta ser amable, sobre todo con tus compañeros de equipo. La gente no escucha a los maleducados.","Los jugadores que abandonen una partida serán penalizados.","Cualquiera puede adquirir guardianes y comprar al mensajero. ¡Si tus compañeros necesitan algo, no dudes en comprarlo!","Sé amable con los nuevos jugadores. Todos fuimos principiantes alguna vez.","Buena suerte. Pásalo bien.","La elección de los héroes es importante. Muchos héroes pueden contrarrestar a otros, y algunas combinaciones de héroes son mucho más poderosas y útiles que un héroe en solitario.","Mantener pulsado Mayús te permite acumular acciones y realizarlas en una secuencia.","¡Tu opinión cuenta! Visita el Workshop de Dota 2 y vota por los objetos que te gustaría que se vendiesen en Dota 2.","Los objetos globales pueden añadirse a la selección aleatoria, de este modo tendrás un objeto diferente para ese hueco en cada partida.","Unos buenos refuerzos pueden abrirte camino hacia la victoria.","¿Prefieres los iconos de los héroes en vez de símbolos de colores en el minimapa? Puedes cambiarlo en los ajustes.","Recuerda levantarte y estirarte entre partida y partida.","Recuerda: todo el mundo tiene malas partidas. Todos cometemos errores.","¿Quieres que el minimapa aparezca al otro lado de la pantalla? Puedes cambiarlo en los ajustes.","Puedes cambiar la frecuencia con que se escuchan las voces de los héroes en los ajustes.","Puedes descargarte las repeticiones de tus partidas desde la lista de partidas recientes tu perfil. ¡Un buen modo de mejorar ver tus propias partidas desde una nueva perspectiva!","Puedes hacer Alt + clic en una habilidad u objeto para informar a tus compañeros de que está listo para su uso, en recarga o si no tienes suficiente maná.","Puedes usar objetos mientras estás silenciado.","¿Has cancelado el Pergamino de Teletransporte sin querer? En ajustes tienes la opción para que cancelar el teletransporte requiera un comando.","Hacer Alt + clic en un objeto del inventario de un héroe enemigo alertará a todo tu equipo de que tiene dicho objeto.","Hacer Alt + clic en el botón de resurrección o en tu oro, avisará a tus compañeros de tu estado de resurrección.","En Elección libre, los jugadores que no hayan elegido un héroe antes de que se agote el tiempo empezarán a perder su oro inicial.","Dota 2 está en constante evolución. Se agregan nuevas características, se introducen nuevos héroes y pueden aparecer nuevos ajustes para héroes y mecánicas ya existentes. ¡Mantente al día de los últimos cambios en el blog de Dota 2!","Ten cuidado y no vayas a hacer más enemigos de los cinco a los que ya te enfrentas.","Si es necesario, podrás encontrar el modo para daltónicos en el menú de opciones.","Mantener pulsado Alt y hacer clic en las barras de vida y maná de un héroe o en las tuyas informará a tu equipo de la salud y el maná actuales de ese héroe.","Puedes informar a tu equipo de efectos activos de tu héroe manteniendo pulsado Alt y haciendo clic en sus iconos. Esto también funciona con héroes enemigos.","Si mantienes pulsado Alt y haces clic en el glifo de fortificación, informarás a tu equipo de su estado actual. Para decir a tu equipo que no usen el glifo, pulsa Control y Alt a la vez y haz clic en el glifo.","Mantener pulsado Alt y hacer clic en tu tiempo de resurrección anunciará a tu equipo tu tiempo de resurreción actual.","Usa la rueda de chat para enviar rápidamente mensajes preseleccionados a tus compañeros de equipo. Puedes personalizarla en el menú de opciones.","Los mensajes de la rueda de chat están traducidos para aparecer en el idioma que esté utilizando el jugador receptor.","Asigna las teclas de habilidad como lanzamiento rápido para utilizar habilidades en la localización actual de tu cursor pulsando la tecla una sola vez.","Puedes exponer tus datos de partidas públicas para que se recojan por terceros en el menú de opciones.","Desde el menú de opciones puedes establecer que los objetos y las habilidades se usen automáticamente en tu héroe haciendo doble clic en el icono de la habilidad o pulsando dos veces la tecla asignada.","¡No te rindas! Matar a un héroe enemigo vale más oro y experiencia si tu equipo es menos poderoso que tus oponentes.","Es responsabilidad de todos intentar hacer de la comunidad de Dota un lugar amigable y acogedor en el que competir.","¿Te gustaría ver cómo juegan a Dota los profesionales? Echa un vistazo a la gran cantidad de torneos que tienen lugar en todo el mundo. Puede que aprendas unos cuantos trucos nuevos para tu héroe favorito.","Puedes deshabilitar el ataque automático en el menú de opciones.","Muestra tu agradecimiento con los que compran Guardianes y Mensajeros.","Normalmente, destruir la torre o los barracones de un enemigo es más beneficioso para tu equipo que matar a un héroe enemigo.","Mantén la calma y sé educado y tendrás más éxito motivando a tus aliados.","Los jugadores que guardan la calma casi siempre toman mejores decisiones.","Planea siempre tu siguiente movimiento.","Incluso una derrota es una práctica para tu siguiente victoria.","Usa la opción de probar héroes, accesible desde la pestaña Héroes, para aprender a jugar con nuevos héroes, practicar últimos golpes o darle un nuevo aspecto a tu favorito.","Puedes ver el alcance de lanzamiento de tus hechizos activando el trazador de alcance de las habilidades en el menú de ajustes.","No tengas miedo de experimentar jugando con un héroe con el que no estés familiarizado.","Dota se disfruta más con amigos.","No dudes en silenciar a un jugador maleducado.","Intenta no lamentarte de tus errores. Aprende de ellos y continúa.","Mantén siempre un ojo puesto en el minimapa.","Si experimentas tirones durante la partida al usar el chat de voz, intenta activar la opción \"Pulsar para hablar simplificado\" desde el menú de ajustes.","Cuatro runas de recompensa aparecerán al comenzar la partida y reaparecerán cada cinco minutos.","Si tienes problemas para jugar contra un héroe en concreto, intenta jugar con él. Aprenderás sus debilidades rápidamente.","El estado de enmudecido impide a un héroe utilizar objetos.","La Gema de Visión Verdadera no funcionará cuando la lleve el mensajero o el Espíritu Oso de Lone Druid.","Mantén presionada la tecla Alt y haz clic izquierdo en el mapa para proporcionar un ping contextual para tus compañeros de equipo.","Una Gema de Visión Verdadera tirada en el suelo proporcionará un pequeño radio de visión en ese lugar para el equipo que la dejó caer."],"advanced":["El oro seguro se obtiene al matar héroes, a Roshan y mensajeros o destruyendo torres enemigas o usando Mano de Midas. Todas las demás fuentes de oro son oro no seguro, que se puede perder al morir.","Puedes atraer los creeps neutrales del campamento más cercano a la senda segura de tu equipo para que luchen contra los creeps de tu senda.","Varios objetos pueden desmontarse y recuperar sus componentes haciendo clic derecho sobre ellos en tu inventario y seleccionando \"Desmontar\". ¡Reutiliza los componentes para crear nuevos objetos!","Utiliza los grupos de control para elaborar órdenes hacia las diferentes unidades que estén bajo tu control. Para establecer un grupo de control, selecciona una o varias unidades, mantén presionada la tecla Control y teclea un número. Para seleccionar un grupo de control, pulsa el número correspondiente a dicho grupo.","¡Si estás a punto de morir, pulsa la tecla \"Adquirir compra rápida\" para gastar tu oro antes de que desaparezca!","Cambiar el atributo principal de las Botas de Poder a inteligencia puede darte un poco de maná adicional.","Si posees un Brazalete de Mordiggian, puedes activar Fuerza Impura para aumentar temporalmente tu vida en 500. Al desactivar Fuerza Impura la vida adicional desaparecerá, siempre con un mínimo de 1 de vida.","Activar Estilo Manta elimina muchos efectos negativos y hará que los proyectiles en movimiento fallen.","Tras usar Resurrección, se añaden 25 segundos a su próxima muerte.","El queso y la Esquirla Revigorizante se pueden vender por 500 de oro.","Si estás dentro del rango de varias auras con el mismo efecto, sólo la más poderosa estará activa.","Si crees que estás a punto de morir, considera la posibilidad de invadir un campamento neutral o ir a Roshan y deja que te maten. De este modo podrás denegar al equipo enemigo el oro y la experiencia que ganarían con tu muerte.","Los barracones cuerpo a cuerpo regeneran 5 puntos de vida por segundo. Los barracones a distancia no se regeneran.","Un punto de Agilidad aumenta la velocidad de ataque del héroe en 1, así como su armadura en 0.05 %.","Un punto de Inteligencia añade 12 de maná máximo, así como 1.8 % de regeneración de maná. También aumenta el daño de tus hechizos un 1% por cada 15 puntos.","Un punto de Fuerza añade 18 de vida máxima, así como 0,55 % de regeneración de vida y 1 % de resistencia mágica cada 13 puntos.","La Hoja Sombría puede activarse mientras canalizas un Pergamino de Teletransporte o cualquier hechizo canalizado.","Cambiar el atributo de las Botas de Poder a Agilidad hará que regeneres vida y maná un poco más rápido. ¡No te olvides de volverlas a cambiar!","La Égida del Inmortal puede ser atacada y denegada.","Las ilusiones otorgan auras del héroe original a las unidades cercanas.","No necesitas destruir los barracones de un equipo para dañar las torres cercanas al Ancestro. Destruir los barracones es opcional.","Los guerreros invocados con un Necronomicón de nivel 3 poseen visión verdadera.","Los efectos del Polvo de la Revelación pueden ser purgados.","Las runas se pueden atacar y denegar.","El daño por hendidura es un daño físico y es mitigado por la armadura.","Malla de Cuchillas devuelve el mismo tipo de daño que se recibió.","El daño devuelto de Malla de Cuchillas atraviesa la inmunidad a hechizos si la fuente original lo hace.","Los creeps neutrales con la habilidad Golpear solo la usarán cuando tres o más objetivos válidos estén a su alcance."],"hero":{"axe":["El efecto de Sed de Batalla de Axe se puede disipar dando el último golpe a un creep de senda o neutral.","Hoja Selectiva de Axe puede matar a los objetivos incluso a través de Tumba Vacía de Dazzle o Falsa Promesa de Oracle."],"mirana":["La Flecha Sagrada de Mirana volará a través de sus unidades aliadas.","Flecha Sagrada de Mirana tiene un tiempo de recorrido considerable. Un compañero de equipo que pueda incapacitar aumentará enormemente las posibilidades de que Mirana impacte en los héroes enemigos.","Flecha Sagrada de Mirana puede ser muy útil para explorar las áreas oscuras del mapa.","Sombra a la Luz de la Luna de Mirana se puede utilizar ofensivamente para atacar por sorpresa al equipo enemigo.","Las habilidades con disipaciones fuertes, como Escudo Afótico de Abaddon, son excelentes para eliminar un aturdimiento largo de un aliado causado por Flecha Sagrada de Mirana."],"nevermore":["Réquiem de las Almas se lanzará al morir Shadow Fiend, incluso si está interrumpido.","Shadow Fiend es experto en matar creeps y neutrales muy rápidamente. Negarle la oportunidad de hacerlo perjudica enormemente su efectividad más adelante en la partida.","Réquiem de las Almas de Shadow Fiend tiene un tiempo de lanzamiento relativamente largo y puede ser cancelada por los enemigos o por el propio Shadow Fiend sin que tenga que recargarse ni cueste maná."],"phantom_lancer":["Phantom Lancer a menudo opta por crear una Hoja Difusora; la inmunidad mágica de la Vara del Rey Negro puede usarse para contrarrestar este efecto.","Phantom Lancer puede usar Doppelganger para disipar efectos y esquivar proyectiles."],"puck":["Silencio puede ser efectiva para sujetar a un Puck complicado."],"razor":["La habilidad Campo de Plasma de Razor hace más daño cuanto más lejos está el objetivo.","Ojo de la Tormenta de Razor dará prioridad a los objetivos que estén siendo drenados con Vínculo Estático."],"sven":["Gran Hendidura de Sven causa daño físico en un área que es mitigado por la armadura.","El Grito de Guerra de Sven te otorga a ti y a los héroes aliados cercanos una velocidad de movimiento adicional y un escudo de vida que bloquea el daño de ataque según la salud del escudo."],"windrunner":["Windranger puede elegir no atacar al objetivo de su Fuego Concentrado atacando a un objetivo diferente o cancelando la acción actual."],"slardar":["Neblina Corrosiva de Slardar proporciona visión verdadera y visión del objetivo."],"riki":["Riki es invulnerable e invisible durante Secretos del Oficio, y no puede ser revelado con visión verdadera durante este hechizo."],"beastmaster":["Rugido Primordial de Beastmaster aturdirá a los objetivos inmunes a hechizos."],"pugna":["La habilidad Explosión Abisal de Pugna inflige la mitad de daño a las estructuras."],"luna":["La habilidad Eclipse de Luna continuará hasta el final, incluso si Luna está silenciada o aturdida. Eclipse se detendrá si Luna muere."],"rattletrap":["La habilidad Batería de Asalto de Clockwerk continuará, incluso si Clockwerk está silenciado o aturdido. Batería de Asalto se detendrá si Clockwerk muere."],"dark_seer":["Caparazón Iónico de Dark Seer dañará a las unidades cercanas aunque sean invisibles."],"night_stalker":["Las bonificaciones nocturnas de Night Stalker también se aplican durante el Eclipse de Luna."],"chen":["La Penitencia de Chen hace que todas las unidades aliadas que atacan a la unidad objetivo ganen velocidad de ataque."],"gyrocopter":["Misil Buscador de Gyrocopter puede seguir objetivos invisibles, pero no otorga visión verdadera."],"alchemist":["El oro que Alchemist gana mediante Avaricia de Greevil no es fiable.","Ácido Pulverizado de Alchemist inflige daño físico y reduce la armadura, lo que lo convierte en una herramienta eficaz para matar a los neutrales ancestrales o a Roshan.","Si Alchemist está silenciado o no tiene ningún héroe enemigo al que atacar cuando Mezcla Inestable alcance su máximo potencial, el propio Alchemist quedará aturdido y vulnerable ante sus enemigos."],"invoker":["Impacto Solar de Invoker inflige daño puro, que no puede mitigarse con resistencia mágica o inmunidad a hechizos."],"lycan":["La habilidad Aullido de Lycan tiene alcance global y afecta a todos los aliados sin importar la distancia."],"brewmaster":["Al finalizar Escisión Primordial, Brewmaster intentará reaparecer en la posición de Tierra si está vivo, luego en la de Tormenta si está vivo y, por último, en la de Fuego.","El espíritu Tormenta de Brewmaster puede utilizar Disipar Magia para cancelar su propio Ciclón."],"chaos_knight":["Cuando Chaos Knight lanza Fantasma, esquiva los proyectiles y, durante un breve periodo, es invulnerable e inmune a hechizos."],"ogre_magi":["Sed de Sangre de Ogre Magi puede lanzarse sobre las torres."],"disruptor":["Impacto Atronador de Disruptor emite una pulsación cada dos segundos. Vislumbrar traslada al objetivo cuatro segundos atrás en el tiempo. Puedes utilizar Impacto Atronador para calcular el momento perfecto para lanzar Vislumbrar."],"slark":["Mientras está bajo el efecto de Baile de Sombras, Slark no puede ser revelado por visión verdadera."],"centaur":["Represaliar de Centaur Warrunner refleja el daño recibido como daño físico. También refleja el daño de los ataques de las torres."],"magnataur":["La habilidad Potenciar de Magnus le otorga el objetivo de Hendidura, lo que causa daño físico en un área alrededor de cada ataque."],"bristleback":["Cuando Bristleback está interrumpido, su habilidad Espalda Espinosa queda desactivada, lo que reduce sustancialmente su capacidad de supervivencia."],"tusk":["Bola de Nieve de Tusk hace más daño cuantos más héroes hay dentro de ella."],"abyssal_underlord":["La habilidad Tormenta de Fuego de Underlord inflige un porcentaje de los puntos de vida máximos de la víctima como daño mágico con cada oleada, lo que la hace muy eficaz contra determinados héroes."],"phoenix":["Phoenix puede usar objetos y lanzar habilidades durante Picado de Ícaro."],"arc_warden":["Campo Magnético de Arc Warden otorga evasión a los aliados que se encuentran dentro del campo frente a los ataques que vienen de fuera de él, incluidos los ataques de torres.","Campo Magnético de Arc Warden otorga evasión a las estructuras aliadas que están dentro del campo.","El daño y la ralentización de Flujo de Arc Warden pueden evitarse estando cerca de una unidad aliada."],"monkey_king":["Golpe Infinito de Monkey King ignora la evasión y no puede fallar."],"pangolier":["Bravuconería de Pangolier ignora la evasión y no puede fallar."],"dark_willow":["Mientras está bajo el efecto de Reino de las Sombras, Dark Willow no puede ser revelada por visión verdadera."],"earthshaker":["A diferencia de las otras habilidades de Earthshaker, Golpe Resonante tiene un tiempo de lanzamiento muy corto, lo que lo hace ideal para iniciar combates con enemigos antes de que puedan reaccionar con objetos defensivos.","El largo alcance de Fisura es ideal para bloquear la ruta de escape de un enemigo o incluso para evitar que los creeps aliados avancen durante un corto periodo de tiempo."],"juggernaut":["Furia de la Hoja de Juggernaut puede utilizarse para otorgar inmunidad mágica antes o después de usar un Pergamino de Teletransporte."],"doom_bringer":["Tierra quemada daña a los enemigos cercanos y proporciona a Condenación una mayor velocidad de movimiento."],"earth_spirit":["Earth Spirit puede usar objetos y habilidades durante Roca Rodante, lo que le permite prepararse para futuros ataques.","Ponerse delante de un Earth Spirit que ha usado Roca Rodante es una manera efectiva de evitar que se escape."],"bane":["Bane puede cancelar su Pesadilla en cualquier momento, en unidades enemigas o aliadas.","Bane tiene muchas habilidades de objetivo único, lo que hace que la Esfera de Linken y el Orbe de Loto sean muy efectivos cuando se usan contra él."],"drow_ranger":["Drow Ranger puede activar su Aura de Precisión dando velocidad de ataque a los creeps asaltantes que están atacando torres."],"morphling":["Morphling seguirá cambiando sus atributos incluso si está incapacitado o silenciado."],"pudge":["Pudge a menudo basa su juego en atacar desde ángulos inesperados. Tener una visión adecuada con Guardianes Observadores aumentará enormemente la capacidad de supervivencia del equipo enemigo."],"sand_king":["Llevar medios de detección, como Polvo de la Revelación, o tener una habilidad que incapacite o silencie a los enemigos en un área, como Escisión Fluctuante de Puck, puede ser muy importante cuando se trata de atrapar a Sand King durante Tormenta de Arena."],"storm_spirit":["La invulnerabilidad de Storm Spirit durante Rayo Esférico significa que puede ignorar completamente la mayoría de los efectos negativos de los hechizos basados en el movimiento, como la Ruptura de Bloodseeker."],"tiny":["La ausencia de armadura base de Tiny hace que sea muy vulnerable a los ataques físicos y a las habilidades que reducen la armadura."],"vengefulspirit":["Intercambio Abisal de Vengeful Spirit interrumpe los hechizos canalizados tanto de aliados como de enemigos."],"lich":["Escudo de Hielo de Lich puede lanzarse sobre estructuras aliadas."]}}