{"beginner":["Wenn Sie merken, dass ein gegnerischer Held aus Ihrer Lane verschwunden ist, dann melden Sie Ihren Teammitgliedern \"Top/Mid/Bottom fehlt\". Damit könnten Sie Leben retten!","Sie können Ihre Fähigkeiten aufwerten, indem Sie die \"Strg\"-Taste gedrückt halten und die Schnelltaste der Fähigkeit drücken.","Benutzen Sie Wards, um Teile der Karte aufzudecken und um die Bewegungen des gegnerischen Teams verfolgen zu können.","Stellen Sie sicher, dass Ihr Team über einen Kurier verfügt, der Ihre Gegenstände vom Shop direkt zu Ihnen bringen kann, damit Sie in Ihrer Lane bleiben und Erfahrung und Gold verdienen können.","Sentry Wards decken sowohl unsichtbare Einheiten in der Nähe als auch gegnerische Wards auf.","Roshan ist viel leichter zu töten, wenn Sie seine Rüstung verringern.","Klicken Sie bei gedrückter Umschalttaste auf einen Gegenstand, um ihn zum Schnellkauf hinzuzufügen.","Für die Zerstörung eines Turms erhalten Sie mehr Geld, wenn Sie den Last Hit erzielen.","Die \"Safe-Lane\" ist die längste Lane auf der Seite Ihres Teams des Flusses. Für Dire ist es die Top-Lane, für Radiant die Bottom-Lane.","Die \"Hard-Lane\" ist die kürzeste Lane auf Ihrer Seite des Flusses. Bei den Dire ist dies die Bottom-Lane, bei den Radiant die Top-Lane.","Normalerweise benötigt ein Team nur einen Kurier.","Der Bewegungstempobonus von Schuhwerk summiert sich nicht. Ganz egal wie viele Beine Ihr Held auch hat, Sie brauchen nur ein Paar Stiefel.","Sie können das Inventar und die Fähigkeiten eines gegnerischen Helden betrachten, indem Sie ihn auswählen.","In der Regel ist es eine gute Idee, eine Town Portal Scroll dabei zu haben.","Zwischen den Bäumen gibt es viele versteckte Wege, die \"juke spots\" genannt werden. Nutzen Sie diese, um zu fliehen oder aus dem Hinterhalt anzugreifen.","Nutzen Sie Dust of Appearance, um unsichtbare Gegner in der Nähe aufzudecken.","Alle 2 Minuten erscheint eine Rune im Fluss, entweder nördlich der Mid-Lane oder südlich von dieser. Nach 40 Minuten erscheint an beiden Plätzen jeweils eine Rune.","Falls Sie eine Bottle haben, werden aufgehobene Runen darin gelagert. Die Bottle füllt sich dabei vollständig auf.","Sie können aus vielen von Spielern erstellten Builds für Ihren Helden wählen, indem Sie die Schaltfläche \"Build-Guide\" auf der linken Seite der oberen Leiste nutzen.","Behalten Sie immer die Minikarte im Auge! Es könnte sein, dass Sie in einen Hinterhalt geraten.","Um die Schwächen eines Helden herauszufinden, ist es oftmals am Besten, eine Partie als dieser zu spielen.","Das Zerstören der gegnerischen Kasernen wird Ihre Creeps in dieser Lane verstärken.","Türme können unsichtbare Einheiten sehen und angreifen.","Achten Sie auf Ihre Positionierung, wenn Sie Creeps angreifen. Es kann passieren, dass Sie die Creeps Ihres Teams und sich selbst in eine gefährliche Lage bringen.","Die Side Shops verkaufen viele nützliche Gegenstände, darunter Town Portal Scrolls und Bestandteile vieler Arten von Schuhwerk.","Einige Felskuppen sind speziell markiert, da sich dort gute Positionen für Observer Wards befinden.","In der Nähe des Brunnens Ihres Teams werden Ihre Lebenspunkte und Ihr Mana schnell wiederhergestellt.","Stärke erhöht das maximale Leben. Agilität erhöht das Angriffstempo. Intelligenz erhöht das maximale Mana.","Der Secret Shop ist gar nicht so geheim.","Ein \"Carry\"-Held nimmt nur langsam an Stärke zu und entfaltet erst spät im Spiel sein volles Potenzial. Ein \"Support\" ist oft sehr früh im Spiel am stärksten und später vor allem darauf bedacht, sein Team zu unterstützen.","Wenn in Ihrem Umkreis ein Gegner stirbt, erhalten Sie Erfahrungspunkte.","Ihre Gebäude und Creeps können mit der Glyphe der Verstärkung kurzzeitig unverwundbar gemacht werden. Benutzen Sie diese jedoch mit Bedacht; sie hat eine sehr hohe Abklingzeit.","Mit einer Town Portal Scroll können Sie sich zu jedem verbündeten Gebäude teleportieren. Mit den Boots of Travel können Sie sich außerdem zu jeder verbündeten Einheit teleportieren.","Falls Ihr Kurier stirbt, wird er erst nach 120 Sekunden wieder erscheinen, zusammen mit allen gerade transportierten Gegenständen. Der fliegende Kurier erscheint nach 180 Sekunden wieder.","Wenn Sie ein Tango benutzen, erhalten Sie immer gleich viel Lebensregeneration, unabhängig davon, wie groß der Baum war, den Sie konsumiert haben.","Es gibt viele Websites, auf welchen Sie sich über allgemeine Taktiken, Teamzusammenstellungen und Strategien Ihrer Lieblingshelden informieren können.","Sie können einem Mitglied Ihres Teams eines Ihrer Tangos geben, indem Sie dieses auf dessen Helden anwenden.","Sie können Healing Salves und Clarities auf Ihre Mitspieler anwenden. Teilt die Liebe!","In den meisten Modi erhält jeder Spieler automatisch alle 0,6 Sekunden 1 Gold bzw. 100 Gold pro Minute.","Sie können Town Portal Scrolls an Teammitglieder weitergeben.","Observer und Sentry Wards können nicht innerhalb der Roshan-Grube platziert werden.","Nicht aktivierte Runen werden alle 2 Minuten ersetzt.","Das Verdienen von Gold durch Töten von Creeps wird oft als \"Farmen\" bezeichnet."],"intermediate":["Wenn Roshan getötet wurde, wird er nach 8 bis 11 Minuten respawnen (die Zeit wird zufällig bestimmt).","Neutrale Creeps erscheinen nach einer Minute und danach jede weitere Minute.","Einigen Zaubersprüchen kann ausgewichen werden, indem Sie einen Blink Dagger benutzen oder unsichtbar werden.","Von einer erhöhten Position anzugreifen gibt Ihnen einen Vorteil, da die Angriffe Ihres Gegners verfehlen könnten oder der Gegner Sie durch den Nebel des Krieges aus den Augen verlieren könnte.","Eine Pipe of Insight eignet sich sehr gut, um gegnerischen magischen Schaden zu mindern.","Assault Cuirass verbessert die Rüstungswerte von in der Nähe befindlichen Teamkameraden.","Werden Sie von einem Turm angegriffen, so erzwingen Sie einen Angriff auf einen befreundeten Creep. Der Turm wählt danach ein neues Ziel aus.","Durch das Platzieren eines Wards oder einer Einheit neben einem neutralen Creep-Lager können Sie verhindern, dass die Creeps dieses Lagers zum Minutenwechsel spawnen.","Monkey King Bar gewährt Ihnen Präzision, wodurch Feinde Ihren Angriffen seltener ausweichen können, auch wenn Sie bergauf angreifen.","Durch Doppelklicken auf Ihren Blink Dagger werden Sie sich automatisch in Richtung des Brunnens Ihres Teams teleportieren.","Sie können verbündete Creeps angreifen, die kurz vorm Sterben sind. Dies verwehrt Ihrem Gegner das Gold eines Last Hits.","Magischer Schaden kann durch Gegenstände verringert werden, die Magieresistenz verleihen.","Physischer Schaden kann durch Gegenstände verringert werden, die Rüstung verleihen.","Reiner Schaden wird weder durch Rüstung noch durch Magieresistenz verringert.","Das Wechseln des Primärattributs Ihrer Power Treads beendet sowohl Unsichtbarkeit als auch kanalisierende Fähigkeiten, wie beispielsweise das Benutzen einer Town Portal Scroll.","Wenn Sie kurz vor der vollen Minute alle neutralen Einheiten von ihrem Camp weglocken, erlauben Sie dem Camp einen Respawn. Nutzen Sie diese Technik, um die Anzahl der Creeps, die Sie töten, zu maximieren.","Halten Sie Steuerung gedrückt, um den regenerierenden Effekt Ihrer Bottle auf einen Verbündeten anzuwenden. Darin aufbewahrte Runen können jedoch nicht weitergegeben werden.","Sitzen Sie in Ihrer Basis fest? Einkäufe im Secret Shop können Sie immernoch mithilfe Ihres Kuriers erledigen. Passen Sie nur darauf auf, dass Sie ihn nicht in die Hände Ihrer Gegner fallen lassen!","Solange keine gegnerischen Creeps in der Nähe sind, genießen Türme Backdoor-Schutz, wodurch sie weniger Schaden nehmen und ihre Gesundheit regenerieren können.","Der Bonusschaden von Quelling Blade wirkt nur auf gegnerische oder neutrale Creeps.","Die verschiedenen Werte der Schadenblock-Eigenschaften von Stout Shield, Vanguard und Crimson Guard beziehen sich auf den Typ des Helden, der den Schild trägt, nicht den Typ des Angreifers.","Dagon, Necronomicon und Boots of Travel können aufgewertet werden, indem Sie nochmals das Rezept kaufen.","Sie können einem Mitglied Ihres Teams einen einzelnen Ward geben, indem Sie bei gedrückter \"Strg\"-Taste erst auf den Ward in Ihrem Inventar und dann auf Ihren Mitspieler klicken.","Blink Dagger und Force Staff können benutzt werden, um Klippen hoch oder runter zu springen.","Benutzen Sie Quelling Blade oder Battle Fury, um Bäume zu fällen und sich so Ihren eigenen Weg durch den Wald zu bahnen.","Feindliche Illusionen und Creeps unterbrechen den Effekt von Smoke of Deceit nicht, lediglich feindliche Helden und Türme.","Wenn Sie die \"Alt\"-Taste gedrückt halten, werden bei den Beschreibungen von einigen Fähigkeiten und Gegenständen zusätzliche Informationen angezeigt.","Kasernen können keine unsichtbaren Einheiten oder Wards aufdecken.","Rückkauf hat eine Abklingzeit von 8 Minuten.","Jeder Held hat ein primäres Attribut: Stärke, Agilität oder Intelligenz. Jeder Punkt auf dem primären Attribut erhöht den Angriffsschaden des Helden um 1.","Ab seinem zweiten Tod wird Roshan zusätzlich zur Aegis of the Immortal einen Käse fallen lassen. Dieser stellt bei Benutzung sofort 2500 Lebenspunkte und 1500 Mana wiederher.","Heldenillusionen fügen Roshan deutlich verringerten Schaden zu.","Vergessen Sie nicht, sich das Inventar Ihrer Verbündeten anzusehen, bevor Sie einen Gegenstand für seinen Aura-Effekt kaufen. Vielleicht besitzt ein Teammitglied den Gegenstand bereits und die meisten Auren summieren sich nicht.","Die Betäubungsdauer verschiedener Fähigkeiten wird nicht aufsummiert. Sie können einen Gegner länger betäuben, indem Sie den Einsatz von Fähigkeiten mit Ihrem Team abstimmen.","Teleportationen durch Town Portal Scroll und Boots of Travel werden nicht von Silences oder Rückstößen unterbrochen.","Je näher ein Turm dem gegnerischen Ancient ist, desto mehr Gold gibt es bei seiner Zerstörung.","Das Benutzen eines Soul Rings gewährt Ihnen extra Mana, sogar wenn Ihr Mana bereits voll ist.","Sie können verbündete Türme zerstören, wenn deren Lebenspunkte unter 10 % sind. Das Denyen eines Turms verhindert, dass Ihre Gegner Gold für dessen Zerstörung erhalten.","Sie können Quelling Blade oder Battle Fury benutzen, um gegnerische Observer und Sentry Wards zu zerstören. So können auch Nahkämpfer schwer zu erreichende Wards entwurzeln.","Physischer Schaden, der durch normale Angriffe sowie einige Heldenfähigkeiten und Gegenstände ausgeteilt wird, kann durch Rüstung verringert oder in der ätherischen Form blockiert werden.","Der Magieschaden der meisten Heldenfähigkeiten und Gegenstände kann durch Magieresistenz reduziert oder durch Zauberimmunität blockiert werden.","Bei Aktivierung bewegt Manta Style Sie von Ihrer ursprünglichen Position weg. Nutzen Sie diese Tatsache und die geschaffenen Illusionen, um Ihre Gegner zu verwirren.","Für denyte Creeps erhalten Sie 20 % der Goldprämie.","Benutzen Sie den Schild des Kuriers weise, er hat eine sehr lange Abklingzeit.","Fernkampfhelden und -einheiten haben eine 25%ige Chance zu verfehlen, wenn Sie bergauf angreifen.","Roshan wird jede Minute stärker, erhält zusätzliche Gesundheit, Schaden und Rüstung.","Runen der Gunst gewähren dem gesamten Team Gold, egal wer sie aufhebt.","Einige Fähigkeiten können durch Zauberimmunität nicht geblockt werden. Die Interaktion mit Zauberimmunität steht in der Beschreibung jeder Fähigkeit.","Erwägen Sie Gold für einen Rückkauf zu sparen. Ein gut geplanter Rückkauf kann den Spieß in einer hoffnungslosen Verteidigungsschlacht umdrehen.","Illusionen verursachen an gegnerischen Gebäuden 60 % weniger Schaden.","Im Dschungel zu farmen kann gefährlich sein! Sie sollten ein paar Wards kaufen und platzieren, um gegnerische Hinterhalte zu verhindern.","Jeder Held erreicht sein maximales Potential an einer anderen Stelle der Partie.","Wenn alle gegnerischen Helden von der Minikarte verschwinden, versuchen sie vielleicht Roshan zu töten oder einen Hinterhalt vorzubereiten.","Versuchen Sie Wards in der Nähe des Ziels zu setzen, das Ihr Team als nächstes angreifen möchte.","Wenn Sie lernen, Support zu spielen, werden Sie ein besserer Carry-Spieler. Wenn Sie lernen, Carry zu spielen, werden Sie ein besserer Support-Spieler.","Nach 40 Minuten erscheinen Kraftrunen jeweils an beiden Runenpunkten im Fluss.","Bei Gegenständen in Ihrem Lager oder Rucksack vergeht die Abklingzeit nur halb so schnell.","Ein Scan zeigt für kurze Zeit an, ob sich gegnerische Helden im Zielgebiet aufhalten.","Eine Teleportation mit Boots of Travel bricht ab, wenn die Zieleinheit während der Kanalisierungszeit stirbt.","Wenn Sie ein neutrales Lager stacken, erhalten Sie zusätzlich einen Prozentanteil der Kopfgelder."],"introduction":["Versuchen Sie, Creeps und gegnerische Helden innerhalb der Angriffsreichweite Ihrer Türme zu bekämpfen.","Seien Sie vorsichtig, wenn Sie das feindliche Terrain jenseits des Flusses betreten.","Denken Sie daran, zu Beginn des Spiels Gegenstände zu kaufen, die Ihre Lebenspunkte und Ihr Mana wiederherstellen können.","Kaufen und benutzen Sie Town Portal Scrolls, um sich schnell über die Karte bewegen zu können.","Es gibt sogenannte \"Side Shops\" im äußersten Osten und Westen des Schlachtfelds, in welchen Sie diverse nützliche Gegenstände kaufen können.","Manche Gegenstände können nur in einem \"Secret Shop\" gekauft werden.","Die meisten Helden können ihre ultimative Fähigkeit ab Level 6 erlernen und ab Level 12 sowie 18 verbessern.","Schaffen Sie es, den \"Last Hit\" auf einem Creep zu landen, werden Sie mit zusätzlichem Gold belohnt.","Stellen Sie sicher, dass Ihr Team einen Kurier besitzt, damit dieser Ihre gekauften Gegenstände auf die Lanes transportieren kann.","Gegenstände, die Sie außerhalb der Reichweite eines Shops kaufen, wandern in Ihr Lager, von wo Sie sie später abholen oder dem Kurier Ihres Teams übergeben können.","Bei Bedarf kann in den Einstellungen ein Modus für Farbenblinde aktiviert werden."],"universal":["Während eines Spiels werden die Ansager und HUD-Skins aller Spieler geteilt. Sie können unter diesen auswählen, indem Sie auf die Schaltfläche \"Gemeinsame Inhalte\" in der Punktetabelle klicken.","Bleiben Sie ruhig und denken Sie daran: Es ist nur ein Spiel.","Unhöfliche Spieler können in der Punktetabelle stummgeschaltet werden. Diese können Sie über die Schaltflächen am oberen linken Rand erreichen.","Nachdem Sie einen Helden gewählt haben, können Sie Ihren Teammitgliedern durch einen Klick auf die Minikarte in der unteren linken Ecke mitteilen, zu welcher Lane Sie nach Beginn des Spiels gehen möchten.","Mochten Sie einen Ihrer Mitspieler? Sprechen Sie eine Empfehlung aus, indem Sie nach dem Spiel über seinem Namen auf das entsprechende Symbol klicken.","Klicken Sie bei gedrückter \"Alt\"-Taste auf eine Fähigkeit, um Ihren Teammitgliedern die aktuelle Abklingzeit dieser mitzuteilen.","Sie können Ihre Teammitglieder über die Abwesenheit eines gegnerischen Helden informieren, indem Sie die \"Alt\"-Taste gedrückt halten und auf das Porträt des Helden in der oberen Leiste klicken.","Bleiben Sie immer freundlich, besonders gegenüber Ihrem Team. Die meisten Menschen geben sich nicht gerne mit Rüpeln ab.","Spieler, die ein Spiel vorzeitig verlassen, werden bestraft.","Jeder kann Wards oder den Kurier kaufen. Falls Ihr Team etwas braucht, kaufen Sie es einfach!","Seien Sie nett zu neuen Spielern. Es ist noch kein Meister vom Himmel gefallen.","Viel Glück. Viel Spaß.","Die Heldenauswahl ist wichtig. Viele Helden sind besonders stark gegen andere Helden und viele Heldenpaare sind weitaus mächtiger als ein Held alleine.","Wenn Sie die Umschalttaste gedrückt halten, können Sie Aktionen hintereinander ausführen.","Verschaffen Sie Ihrer Stimme Gehör. Besuchen Sie den Dota 2 Workshop und geben Sie Ihre Stimme für Gegenstände ab, die Sie in Dota 2 sehen möchten.","Globale Gegenstände können einer Zufallsliste hinzugefügt werden, wodurch für jede Partie ein anderer Gegenstand für den jeweiligen Slot ausgewählt wird.","Positive Gedanken können große Auswirkungen haben und schließlich zum Sieg führen.","Bevorzugen Sie die Gesichter der Helden anstelle bunter Symbole auf der Minikarte? Sie können dies in den Einstellungen ändern.","Denken Sie daran, zwischen den Spielen aufzustehen und sich zu strecken.","Zur Erinnerung: Jeder hat mal ein schlechtes Spiel. Jeder macht Fehler.","Möchten Sie die Minikarte auf der anderen Seite Ihres Bildschirms anzeigen lassen? Sie können dies in den Einstellungen ändern.","Sie können in den Einstellungen anpassen, wie häufig die Stimmen der Helden hörbar sind.","Sie können die Aufzeichnungen Ihrer Spiele in Ihrer Liste kürzlich gespielter Spiele herunterladen. Sich seine Spiele aus einer anderen Perspektive anzusehen, ist ein guter Weg, um sich zu verbessern!","Wenn Sie die \"Alt\"-Taste gedrückt halten und auf eine Fähigkeit oder einen Gegenstand klicken, werden Ihre Teammitglieder darüber informiert, ob die Fähigkeit bereit ist, abklingt oder nicht genug Mana vorhanden ist, um sie zu benutzen.","Sie können immernoch Gegenstände benutzen, wenn Sie gesilenced sind.","Haben Sie versehentlich Ihre Town Portal Scroll abgebrochen? In den Einstellungen gibt es eine Option, um einen Stoppbefehl erforderlich zu machen, damit die Teleportation abgebrochen wird.","Wenn Sie die \"Alt\"-Taste gedrückt halten und auf einen Gegenstand im Inventar eines gegnerischen Helden klicken, wird Ihr Team darüber informiert, dass der Gegner diesen Gegenstand besitzt.","Wenn Sie die \"Alt\"-Taste gedrückt halten und auf die Rückkaufschaltfläche oder Ihr Gold klicken, wird Ihr Team über Ihren Rückkaufstatus informiert.","Im \"All Pick\"-Modus verlieren Spieler, die beim Ablaufen der Zeit noch keinen Helden ausgewählt haben, einen Teil ihres Startgolds.","Dota 2 entwickelt sich stetig weiter. Es werden neue Funktionen hinzugefügt, neue Helden eingeführt und bestehende Helden und Funktionen werden überarbeitet. Lesen Sie den offiziellen Blog, um auf dem Laufenden zu bleiben.","Achten Sie darauf, sich nicht noch mehr Feinde zu machen, als die fünf, gegen die Sie bereits antreten.","Bei Bedarf kann in den Einstellungen ein Modus für Farbenblinde aktiviert werden.","Wenn Sie mit gedrückter \"Alt\"-Taste auf ihre Lebens- oder Manaanzeige, oder die eines Gegners, klicken, teilen Sie Ihrem Team automatisch deren aktuelle Werte mit.","Sie können Ihr Team über aktive Stärkungs- und Schwächungseffekte informieren, indem Sie mit gedrückter \"Alt\"-Taste auf die entsprechenden Symbole klicken – das funktioniert auch bei gegnerischen Helden.","Halten Sie die \"Alt\"-Taste gedrückt und klicken Sie auf die Glyphe der Verstärkung, um Ihrem Team deren aktuellen Status mitzuteilen. Um Ihrem Team zu sagen, dass es die Glyphe nicht benutzen soll, halten Sie beim Anklicken der Glyphe sowohl die \"Steuerung\"- als auch die \"Alt\"-Taste gedrückt.","Wenn Sie die \"Alt\"-Taste gedrückt halten und auf Ihre Wiedereinstiegszeit klicken, können Sie Ihrem Team Ihre aktuelle Wiedereinstiegszeit mitteilen.","Benutzen Sie das Chatrad, um schnell vordefinierte Nachrichten an Ihr Team zu senden. Sie können die Nachrichten des Chatrads in den Einstellungen anpassen.","Chatrad-Nachrichten werden übersetzt und erscheinen den Spielern jeweils in ihrer Sprache.","Weisen Sie Schnellzaubertasten zu, um Ihre Fähigkeiten direkt an der aktuellen Position Ihres Mauszeigers auszulösen zu können.","In den Einstellungen können Sie festlegen, ob die öffentlichen Daten Ihrer gespielten Partien auch von externen Diensten ausgelesen werden können.","In den Einstellungen können Sie festlegen, dass bei einem Doppelklick auf einen Gegenstand oder eine Fähigkeit, beziehungsweise ein doppelter Druck der zugewiesenen Taste, der Effekt automatisch auf Ihren eigenen Helden angewendet wird.","Geben Sie niemals auf! Wenn Ihr Team Ihrem Gegner unterlegen ist, erhalten Sie mehr Gold und Erfahrung für das Töten gegnerischer Helden.","Es liegt in der Verantwortung aller Spieler, die Dota-Community zu einer freundlichen Wettkampfsumgebung zu machen.","Möchten Sie sehen, wie die Profis Dota spielen? Sehen Sie sich die vielen Dota-2-Turniere an, die rund um die Welt stattfinden. Vielleicht lernen Sie ein paar neue Tricks für Ihren Lieblingshelden.","Das automatische Angreifen Ihres Helden kann im Optionenmenü deaktiviert werden.","Seien Sie immer freundlich zu denjenigen, die Wards und Kuriere kaufen.","Gegnerische Türme oder Kasernen zu zerstören, ist für Ihr Team meistens mehr Wert, als einen gegnerischen Helden zu töten.","Bleiben Sie ruhig und höflich. Dann haben Sie mehr Erfolg dabei, Ihre Teamkameraden zu motivieren.","Ruhige Spieler treffen fast immer bessere Entscheidungen.","Planen Sie immer Ihren nächsten Schritt.","Auch eine Niederlage ist Übung für Ihren nächsten Sieg.","Benutzen Sie den Testmodus im Helden-Tab, um neue Helden kennenzulernen, Last-Hits zu üben oder einen Look für Ihren Lieblingshelden zu entwerfen.","Sie können Die Zauberreichweite Ihrer Zauber sehen, wenn Sie in den Einstellungen den \"Reichweitenmesser\" aktivieren.","Scheuen Sie sich nicht zu experimentieren, indem Sie einen ungewohnten Helden spielen.","Dota macht mit Freunden am meisten Spaß.","Zögern Sie niemals einen gemeinen Spieler stummzuschalten.","Verzweifeln Sie nicht an Ihren Fehlern. Lernen Sie aus ihnen und machen Sie weiter.","Haben Sie immer ein Auge auf Ihrer Minikarte.","Falls Ihr Spiel ruckelt, wenn Sie den Sprachchat verwenden, versuchen Sie in den Einstellungen \"Streamlined Push-to-Talk\" zu aktivieren.","Es erscheinen vier Runen der Gunst zu Spielbeginn und danach alle 5 Minuten.","Goldprämien und verdiente Erfahrungspunkte sind bei Jungle-Creeps signifikant niedriger, als bei Lane-Creeps.","Gebäude mit aktivem Backdoor-Schutz sind von einer blauen Barriere umgeben und haben ein Schildsymbol neben ihrem Lebensbalken.","Türme, der Ancient und der Brunnen gewähren Klarsicht, decken also unsichtbare Einheiten in ihrer Nähe auf, Schreine und Kasernen dagegen nicht.","Belagerungs-Creeps verursachen mehr Schaden an Türmen und greifen, wenn möglich, Gebäude zuerst an.","Wenn Sie sich gegen einen bestimmten Helden regelmäßig nicht behaupten können, spielen Sie ihn doch. So werden Sie sehr schnell dessen Schwächen kennenlernen.","Alle Türme gewähren ihren Verbündeten in der Nähe Bonusrüstung. Tier-1-Türme gewähren 3 Rüstung und alle anderen Türme 5 Rüstung."],"advanced":["Sicheres Gold verdienen Sie durch das Töten von Helden, Roshan und Kurieren, das Zerstören von gegnerischen Türmen oder das Benutzen von Hand of Midas. Sonstiges Einkommen ist unsicheres Gold und kann beim Tod verloren werden.","Sie können die Kreaturen aus dem neutralen Creep-Lager nahe Ihrer Safe-Lane zu Ihren Lane-Creeps ziehen.","Einige Gegenstände können wieder in Ihre Bestandteile zerlegt werden, indem Sie in Ihrem Inventar auf diese Rechtsklicken und \"Zerlegen\" auswählen. Nutzen Sie die Materialien anschließend für das Erstellen neuer Gegenstände!","Nutzen Sie Kontrollgruppen, um verschiedene Gruppierungen von Einheiten unter Ihrer Kontrolle zu befehligen. Wählen Sie zum Setzen der Kontrollgruppe eine oder mehrere Einheiten aus, halten Sie die \"Strg\"-Taste gedrückt und drücken Sie eine Zahl. Um die Kontrollgruppe auszuwählen, drücken Sie diese Zahl.","Wenn Sie kurz vorm Sterben sind, benutzen Sie die \"Durch Schnellkauf erwerben\"-Taste, um Ihr Gold zu verbrauchen, bevor es verschwindet!","Das Umstellen des primären Attributs der Power Treads auf Intelligenz gibt Ihnen ein wenig mehr Mana.","Wenn Sie ein Armlet of Mordiggian besitzen, können Sie die Fähigkeit \"Unholy Strength\" aktivieren, um Ihre Lebenspunkte temporär um 500 zu erhöhen. Das Deaktivieren von Unholy Strength entfernt die hinzugefügten Lebenspunkte wieder, bis auf ein Minimum von einem Lebenspunkt.","Das Aktivieren von Manta Style entfernt einige Buffs bzw. Debuffs und führt dazu, dass bereits in der Luft befindliche Projektile verfehlen.","Nach einem Rückkauf werden 25 Sekunden zum nächsten Tod des Helden hinzugefügt.","Der Cheese und der Refresher Shard können für jeweils 500 Gold verkauft werden.","Wenn Sie sich innerhalb des Wirkungsradius mehrerer Auren mit demselben Effekt befinden, wird nur die stärkste Aura aktiv sein.","Wenn Sie wissen, dass Sie sterben werden, ziehen Sie in Betracht, in ein neutrales Creep-Lager oder zu Roshan zu laufen, um sich von diesen töten zu lassen. Dadurch verhindern Sie, dass Ihre Gegner Gold und EP für Ihren Tod erhalten.","Nahkampfkasernen regenerieren 5 Lebenspunkte pro Sekunde. Fernkampfkasernen regenerieren sich nicht.","Ein Punkt in Agilität erhöht das Angriffstempo eines Helden um 1, die Rüstung um 0,16 und das Bewegungstempo um 0,05 %.","Ein Punkt in Intelligenz erhöht das maximale Mana um 12 und die Manaregeneration pro Sekunde um 1,8 %. Pro 15 Punkte in Intelligenz wird außerdem der Zauberschaden um 1 % erhöht.","Ein Punkt in Stärke erhöht das maximale Leben um 18 und die Lebensregeneration pro Sekunde um 0,55 %. Pro 13 Punkte in Stärke wird außerdem die Magieresistenz um 1 % erhöht.","Shadow Blade kann auch aktiviert werden, während Sie eine Town Portal Scroll oder einen Zauber kanalisieren.","Wenn Sie Ihre Power Treads während der Heilung auf Agility umschalten, können Lebenspunkte und Mana ein wenig effizienter wiederhergestellt werden. Vergessen Sie aber nicht, wieder zurückzuschalten!","Die Aegis of the Immortal kann angegriffen und so denyt werden.","Illusionen geben geteilte Auren vom ursprünglichen Helden an nahestehende Einheiten weiter.","Sie müssen die Kasernen des gegnerischen Teams nicht zerstören, um die Türme in der Nähe des Ancients zu beschädigen. Die Zerstörung der Kasernen ist optional.","Krieger, die mit einem Necronomicon auf Level 3 beschworen wurden, haben Klarsicht.","Die Wirkung von Dust of Appearance kann entfernt werden.","Runen können angegriffen und denyt werden.","Flächenschaden ist physischer Schaden und wird durch Rüstung verringert.","Wenn Sie mit einem Desolator angreifen, profitieren Sie bereits ab dem ersten Angriff von der reduzierten Rüstung des Ziels.","Tier-1-Türme haben keinen Backdoor-Schutz.","Der Backdoor-Schutz von Stufe-2-Türmen wird deaktiviert, sobald ein gegnerischer Creep in der Nähe ist. Jeder Stufe-2-Turm hat seinen eigenen Schutzstatus.","Alle Stufe-3- und Stufe-4-Türme, Kasernen sowie der Ancient teilen sich ihren Backdoor-Schutz. Er wird deaktiviert, sobald ein gegnerischer Creep irgendeinem Teil der Basis zu nahe kommt.","Der Backdoor-Schutz bleibt noch eine gewisse Zeit deaktiviert, nachdem der letzte gegnerische Creep den Bereich verlassen hat.","Der von Blade Mail zurückgeworfene Schaden entspricht der Schadensart des erlittenen Schadens.","Der von Blade Mail zurückgeworfene Schaden durchdringt Zauberimmunität, wenn der erlittene Schaden dies auch tut.","Eye of Skadi durchdringt Zauberimmunität und kann nicht entzaubert werden.","Tragen Sie immer eine Town Portal Scroll bei sich."],"hero":{"antimage":["Manabrand wirkt nicht bei Zauberimmunität, sodass Anti-Mage kein Mana verbrennen und keinen zusätzlichen Schaden verursachen kann."],"mirana":["Miranas Sacred Arrow fliegt durch verbündete Einheiten hindurch."],"phantom_lancer":["Phantom Lancer kauft sich oft ein Diffusal Blade. Die Zauberimmunität der Black King Bar kann dessen Effekt kontern.","Phantom Lancer kann mit Doppelganger manche Schwächungseffekte entfernen und Projektilen ausweichen."],"sand_king":["Sand Kings Epicenter pulsiert für die gesamte Dauer, selbst wenn Sand King stirbt."],"sven":["Svens Great Cleave verursacht physischen Flächenschaden, welcher durch Rüstung verringert wird."],"kunkka":["Aeon Disk ist oft ein guter Gegenstand in der Endphase, wenn Sie gegen einen Kunkka mit vielen Schadensgegenständen kämpfen."],"lina":["Linas Laguna Blade durchdringt Zauberimmunität, wenn Lina ein Aghanim's Scepter gekauft hat."],"lion":["Lions Hex und Mana Drain zerstören Illusionen sofort."],"slardar":["Slardars Corrosive Haze gibt Klarsicht und Sicht auf das Ziel."],"enigma":["Enigmas Midnight Pulse verursacht Schaden basierend auf einem Prozentsatz der maximalen LP des Ziels."],"sniper":["Snipers Shrapnel wirkt nicht auf Gebäude. Mehrere Shrapnel-Effekte auf das gleiche Ziel summieren sich nicht auf."],"necrolyte":["Necrophos' Ghost Shroud macht ihn immun gegen physischen, aber anfälliger gegen magischen Schaden."],"beastmaster":["Beastmasters Primal Roar betäubt auch zauberimmune Ziele."],"faceless_void":["Mit Time Walk kann Faceless Void keinen Projektilen ausweichen. Time Walk ist ein Heilungseffekt und kann durch Ancient Apparitions Ice Blast verhindert oder mit Spirit Vessel reduziert werden."],"death_prophet":["Death Prophets Exorcism-Geister verursachen physischen Schaden, welcher durch Rüstung verringert wird."],"pugna":["Pugnas Nether Blast verursacht halben Schaden an Gebäuden."],"dragon_knight":["Der Corrosive Breath von Dragon Knights Drachenform wirkt auch bei Gebäuden und ist deshalb eine gute Belagerungsfähigkeit."],"leshrac":["Leshracs Diabolic Edict verursacht an Gebäuden mehr Schaden und ist deshalb eine gute Belagerungsfähigkeit."],"dark_seer":["Dark Seers Ion Shell verursacht Schaden an in der Nähe befindlichen Einheiten, selbst wenn sie unsichtbar sind."],"clinkz":["Clinkz' Searing Arrows verursacht zusätzlichen physischen Schaden bei seinen Angriffen."],"omniknight":["Omniknights Purification verursacht reinen Schaden, welcher durch Rüstung oder Magieresistenz nicht verringert wird."],"enchantress":["Enchantress' Untouchable-Effekt kann mit Zauberimmunität geblockt oder durch einen kurzen Wechsel des Angriffsziels während des Rückschwungs umgangen werden."],"huskar":["Huskars Burning Spears verursachen je nach Wahl des Talents zusätzlichen magischen oder reinen Schaden. Burning Spears wirkt nicht auf Gebäude."],"night_stalker":["Night Stalkers Nachtboni werden auch während Lunas Eclipse aktiviert."],"bounty_hunter":["Verbündete erhalten das Bonusgold von Bounty Hunters Track nur, wenn sie sich innerhalb von 1200 Einheiten um das sterbende Opfer aufhalten. Für Bounty Hunter selbst gilt diese Reichweitenbeschränkung nicht."],"weaver":["Weavers Käferschwarm verursacht physischen Schaden, dem nicht ausgewichen werden kann. Rüstung und Blockeffekte verringern ihn jedoch."],"jakiro":["Jakiros Liquid Fire wirkt auch bei Gebäuden und ist deshalb eine gute Belagerungsfähigkeit."],"batrider":["Batriders Sticky Napalm fügt dem Ziel Bonusmagieschaden zu, wenn dieses von Batrider angegriffen wird. Sticky Napalm wird nicht ausgelöst, wenn andere Einheiten das Ziel angreifen."],"chen":["Chens Penitence gewährt allen verbündeten Einheiten, die das Ziel angreifen, zusätzlichen Angriffsschaden."],"spectre":["Spectres Dispersion wirft erlittenen Schaden auf Gegner zurück, je näher diese sich befinden, desto größer der Anteil. Die Schadensart des reflektierten Schadens orientiert sich am erlittenen Schaden."],"ancient_apparition":["Ancient Apparitions Ice Blast negiert bei betroffenen Einheiten jegliche Heileffekte. Wenn die Lebenspunkte eines Opfers unter eine gewisse Schwelle fallen, stirbt dieses sofort."],"doom_bringer":["Dooms Doom verursacht reinen Schaden, welcher durch Rüstung oder Magieresistenz nicht verringert wird.","Scorched Earth fügt in der Nähe befindlichen Gegnern Schaden zu und gibt Doom zusätzliches Bewegungstempo."],"ursa":["Ursas Fury Swipes verursacht physischen Bonusschaden, wenn ein Ziel mehrmals hintereinander angegriffen wird. Fury Swipes wirkt nicht bei Gebäuden, aber bei Roshan."],"spirit_breaker":["Mit Spirit Breakers Charge of Darkness kann eine gegnerische Linken's Sphere von überall auf der Karte ausgelöst werden, solange das Ziel sichtbar ist."],"gyrocopter":["Gyrocopters Homing Missile verfolgt unsichtbare Ziele, gewährt aber keine Klarsicht."],"alchemist":["Das Gold von Alchemists Greevil's Greed ist unsicheres Gold."],"invoker":["Invokers Sun Strike verursacht reinen Schaden, welcher durch Rüstung, Magieresistenz oder Zauberimmunität nicht verringert wird."],"silencer":["Silencers Glaives of Wisdom verursachen reinen Schaden, welcher durch Rüstung oder Magieresistenz nicht verringert wird. Zauberimmunität blockt den Schaden, solange Silencer kein Aghanim's Scepter gekauft hat."],"obsidian_destroyer":["Outworld Devourers Arcane Orb verursacht reinen Schaden, welcher durch Rüstung oder Magieresistenz nicht verringert, durch Zauberimmunität jedoch geblockt wird."],"lycan":["Lycans Howl wirkt global, also bei allen Verbündeten auf der Karte."],"brewmaster":["Am Ende der Dauer von Primal Split wird Brewmaster anstelle des Erdgeistes wieder erscheinen. Sollte dieser gestorben sein, anstelle des Blitzgeistes und falls dieser ebenfalls getötet wurde, anstelle des Feuergeistes."],"shadow_demon":["Shadow Demons Soul Catcher entzieht allen Zielen im Wirkungsbereich vorübergehend einen Teil ihrer Lebenspunkte. Soul Catcher kann auch auf Ziele angewendet werden, die mit Disruption verbannt wurden."],"lone_druid":["Lone Druids Spirit Bear fügt Gebäuden Bonusschaden zu, wodurch er bei Belagerungen sehr effektiv ist."],"chaos_knight":["Wenn Chaos Knight Phantasm aktiviert, weicht er fliegenden Projektilen aus und ist kurz unverwundbar sowie zauberimmun."],"meepo":["Meepo erhält EP oder Gold, wenn einer seiner Klone EP oder Gold erhält. Meepo stirbt, wenn einer seiner Klone stirbt."],"treant":["Die Unsichtbarkeit von Treant Protectors Nature's Guise wird durch das Einsetzen von Fähigkeiten oder Gegenständen nicht unterbrochen."],"ogre_magi":["Ogre Magi kann Bloodlust auch auf Türme einsetzen."],"undying":["Undyings Tombstone erzeugt keine Zombies für unsichtbare Gegner in Reichweite und vorhandene Zombies vergehen, wenn die von ihnen verfolgte Einheit unsichtbar wird."],"rubick":["Wenn Rubick eine gestohlene Fähigkeit einsetzt, hat diese bis auf wenige Ausnahmen nicht ihre normale Zauberzeit."],"disruptor":["Disruptors Thunder Strike trifft das Ziel alle zwei Sekunden. Glimpse setzt das Ziel vier Sekunden in der Zeit zurück. Sie können also Thunder Strike nutzen, um Glimpse zum perfekten Zeitpunkt einzusetzen."],"nyx_assassin":["Nyx Assassins Spiked Carapace reflektiert Schaden auf den Angreifer, ganz gleich, ob dieser weit entfernt oder unsichtbar ist."],"naga_siren":["Wenn Naga Siren Mirror Image aktiviert, weicht sie fliegenden Projektilen aus und ist kurz unverwundbar sowie zauberimmun."],"wisp":["Während Io mit einem Verbündeten verbunden ist, bewegt er sich gleich schnell wie dieser."],"slark":["Wenn Slark unter dem Effekt von Shadow Dance steht, kann er nicht durch Klarsicht aufgedeckt werden."],"medusa":["Medusas Mystic Snakes fügen mit jedem Sprung mehr Schaden zu und rauben auch mehr Mana. Das gestohlene Mana ist ein Prozentanteil des derzeitigen Manas des Ziels."],"troll_warlord":["Troll Warlords Fervor sammelt auch Aufladungen, wenn einem Angriff ausgewichen wurde."],"centaur":["Centaur Warrunners Retaliate reflektiert erlittenen Schaden als physischen Schaden. Dazu zählen auch Angriffe von Türmen."],"magnataur":["Durch Magnus' Empower verursacht die Zieleinheit Flächenschaden. Flächenschaden ist physischer Schaden, welcher Einheiten in der Nähe des Ziels trifft."],"tusk":["Tusks Snowball verursacht mehr Schaden, je mehr Helden in ihm rollen."],"skywrath_mage":["Skywrath Mages Arcane Bolt verursacht erheblichen Bonusschaden, welcher sich aus Skywrath Mages Intelligenz berechnet."],"elder_titan":["Elder Titans Natural Order verringert gegnerische Rüstung rund um Elder Titan und gegnerische Magieresistenz rund um seinen Geist."],"legion_commander":["Legion Commanders Duel durchdringt die Zauberimmunität der Black King Bar, wird aber von Linken's Sphere geblockt."],"techies":["Die Proximiy Mines der Techies werden aufgedeckt, wenn eine gegnerische Einheit ihnen zu nahe kommt. Stasis Traps und Remote Mines werden nur durch Klarsicht aufgedeckt."],"earth_spirit":["Earth Spirits Boulder Smash betäubt nicht die anvisierte Einheit, sondern nur von dem geschleuderten Remnant getroffene Einheiten.","Enchant Remnant macht das Ziel kurzzeitig unverwundbar, weshalb Earth Spirit auf diese Weise Verbündete aus der Gefahr retten kann."],"abyssal_underlord":["Underlords Firestorm fügt dem Ziel mit jeder Welle einen Prozentanteil dessen maximaler Lebenspunkte als magischen Schaden zu und ist daher sehr effektiv gegen bestimmte Helden."],"terrorblade":["Terrorblades Sunder durchdringt nicht die Zauberimmunität der Black King Bar. Linken's Sphere blockt Sunder ebenfalls."],"phoenix":["Phoenix kann während Icarus Dive Gegenstände und Fähigkeiten einsetzen."],"oracle":["Oracles Fate's Edict blockt gegen das Ziel gerichteten Magieschaden, einschließlich des Schadens von Purifying Flames. Mit dieser Kombo kann Oracle also seine Verbündeten heilen."],"winter_wyvern":["Die Splitter von Winter Wyverns Splinter Blast treffen auch unsichtbare Einheiten und Einheiten, die sich im Nebel des Krieges befinden."],"arc_warden":["Arc Wardens Magnetic Field lässt Verbündete innerhalb des Feldes gegnerischen Angriffen von außerhalb des Feldes ausweichen; Turmangriffe inbegriffen."],"monkey_king":["Monkey Kings Boundless Strike kann nicht verfehlen."],"pangolier":["Pangoliers Swashbuckle kann nicht verfehlen."],"dark_willow":["Wenn Dark Willow unter dem Effekt von Shadow Realm steht, kann sie nicht durch Klarsicht aufgedeckt werden."],"axe":["Axes Berserker's Call durchdringt Zauberimmunität, weshalb damit auch Gegner mit einer Black King Bar effektiv kontrolliert werden können.","Setzen Sie Eul's Scepter auf Axe ein, damit von Berserker's Call gefangene Verbündete keinen Schaden durch dessen Counter Helix nehmen."],"puck":["Puck kann Phase Shift jederzeit abbrechen, indem es eine Fähigkeit oder einen Gegenstand einsetzt.","Wenn mehrere Gegner zauberimmun werden können, kann Puck durch Kauf von Aghanim's Scepter sicherstellen, dass Dream Coil ein mächtiges Betäubungswerkzeug bleibt.","Puck hat viele Flächenzauber, weshalb es entscheidend ist, genügend Abstand zueinander einzuhalten, wenn man im Gegnerteam spielt.","Da Pucks Verteidigungsfähigkeiten fast ohne Verzögerung eingesetzt werden können, sollte man als Gegnerteam sehr schnell zuschlagen, etwa mit einem Blink Dagger oder Shadow Blade."],"pudge":["Pudge verlässt sich oft darauf, aus unerwarteten Richtungen angreifen zu können. Gegen Pudge können also Observer Wards die Überlebenschancen des eigenen Teams enorm erhöhen.","Pudge kann mit seinem Meat Hook Runen zu sich ziehen, um diese entweder selbst aufzuheben oder für Verbündete in eine sichere Position zu bringen. Dabei wird kein Mana verbraucht.","Pudges Meat Hook zieht auch zauberimmune Einheiten heran und fügt diesen Schaden zu. In diesem Fall kann das Ziel jedoch weiterhin Gegenstände einsetzen und laufende Kanalisierungen werden nicht unterbrochen.","Pudges Rot fügt sowohl ihm selbst als auch Gegnern magischen Schaden zu. Deshalb kauft er oft Gegenstände, die seine Magieresistenz erhöhen und somit seinen Anteil des Schadens verringern.","Pudges Meat Hook fügt Verbündeten keinen Schaden zu, kann also bedenkenlos eingesetzt werden, um diese aus der Gefahr herauszuziehen.","Im richtigen Moment eingesetzt, kann sich Pudge mit Rot selbst töten und so den Gegnern Gold sowie Erfahrung vorenthalten.","Der Audioeffekt von Dismember kann von allen Spielern gehört werden, sogar wenn Pudge für diese verborgen ist, und verrät deshalb viel darüber, was Pudge gerade tut.","Pudges Dismember betäubt auch zauberimmune Ziele, fügt diesen jedoch keinen Schaden zu.","Pudge hat einen niedrigen Grundrüstungswert, weshalb physische Angriffe, insbesondere gepaart mit rüstungsreduzierenden Effekten, für ihn schnell tödlich enden können.","Pudges Dismember kann durch eine starke Entzauberung auf das Ziel unterbrochen werden, etwa durch Abaddons Aphotic Shield oder Legion Commanders Press the Attack."],"razor":["Plasma Field gewährt Razor Sicht im Wirkungsbereich, weshalb er damit gut Gegner in Bäumen oder auf Klippen aufspüren kann.","Nichts kann Razors Static Link unterbrechen, weshalb die einzige Möglichkeit ist, sich so schnell wie möglich aus der Reichweite heraus zu bewegen.","Während Static Link aktiv ist, kann Razor das Ziel sehen, auch wenn dieses unsichtbar ist.","Razor verlässt sich auf sein hohes Bewegungstempo, um mit seinen Gegnern Schritt zu halten, während Eye of the Storm und Static Link aktiv sind. Deshalb sind Gegenstände, die seine Bewegung einschränken, wie etwa Rod of Atos, ein guter Weg, ihn in Schach zu halten.","Razors Eye of the Storm greift bevorzugt Ziele an, auf die gerade Static Link angewendet wird."]}}