{"beginner":["Если вы заметили, что противника не видно на линии, предупредите союзников фразой «Враг ушёл сверху/с центра/снизу!». Возможно, вы спасёте товарища по команде!","Можно изучить способность, зажав Ctrl и нажав клавишу этой способности.","Используйте варды, чтобы наблюдать за частями карты и знать, где находится враг.","Вашей команде необходим курьер, благодаря которому вам не придётся отрываться от получения золота и опыта для того, чтобы что-то купить.","Sentry Ward раскрывает невидимых существ и вражеские варды.","Рошана гораздо проще убить, если уменьшить его броню.","Нажав на предмет в магазине с зажатой клавишей Shift, вы разместите его в панели быстрой покупки.","Нанеся башне последний удар, вы получите больше золота, чем при ее уничтожении крипами.","«Лёгкая» линия — это самая длинная линия на вашей стороне карты. Для сил Тьмы это верхняя линия. Для сил Света — нижняя.","«Сложная» линия — это самая короткая линия на вашей стороне карты. Для сил Тьмы это нижняя линия. Для сил Света — верхняя.","Обычно команде хватает одного курьера.","Бонус к скорости перемещения от сапог не складывается. Не важно, сколько ног у вашего героя — вам нужен один-единственный сапог.","Вы можете просмотреть инвентарь и способности вражеского героя, просто нажав на него.","Старайтесь всегда иметь при себе Town Portal Scroll.","Между деревьями скрыто множество проходов, с помощью которых можно обмануть противника. Используйте их, чтобы скрыться из виду или подготовить засаду.","Используйте Dust of Appearance, чтобы раскрыть невидимых врагов неподалёку.","Каждые две минуты на реке появляется руна — либо севернее центральной линии, либо южнее. После 40:00 руны появляются в обеих точках.","Руну можно поместить в бутыль и применить позже. Кроме того, так вы наполните бутыль.","Вы можете выбрать одну из созданных игроками сборок для вашего героя с помощью кнопок в левом верхнем углу.","Посматривайте на мини-карту почаще! Возможно, вас пытаются застать врасплох.","Лучший способ узнать слабости героя — это поиграть за него.","Уничтожение вражеских казарм усилит ваших крипов на этой линии.","Башни могут видеть и атаковать невидимых существ.","Думайте, когда атакуете крипов. Может оказаться, что сражение перейдёт в опасное место.","В магазинах боковых линий можно купить много полезных предметов, включая Town Portal Scroll и компоненты для многих типов сапог.","На некоторых возвышенностях есть метки, указывающие хорошие места для вардов.","Находясь возле фонтана вашей команды, вы быстро восстанавливаете здоровье и ману.","Сила увеличивает максимальный запас здоровья. Ловкость увеличивает скорость атаки. Интеллект увеличивает максимальный запас маны.","Потайная лавка не такая уж и потайная.","«Керри» — это герой, который постепенно набирает силу, становясь эффективным в поздней игре. Герои поддержки зачастую сильны в ранней игре, а позже они увеличивают эффективность своей команды.","Если во время убийства ваш герой находится неподалёку, он получит опыт.","Вы можете ненадолго сделать союзные постройки и крипов неуязвимыми, укрепив их. Но используйте эту возможность с умом: она перезаряжается очень долго.","Town Portal Scroll позволяет телепортироваться к любой союзной постройке. Boots of Travel позволяют телепортироваться к любому союзному существу.","Если ваш курьер был убит, он возродится со всеми предметами, которые нёс, через 2 минуты. Летающий курьер возрождается дольше — 3 минуты.","Количество здоровья, которое восстанавливает Tango, не зависит от размера дерева.","Есть много сайтов и роликов, которые рассказывают о тактике, выборе героев и стратегиях игры за них.","Вы можете передать Tango товарищу по команде, просто применив этот предмет на него.","Healing Salve и Clarity можно использовать и на товарищей по команде. Дарите любовь!","В большинстве режимов каждый игрок автоматически получает 1 ед. золота каждые 0,6 секунды — то есть 100 золота каждую минуту.","Town Portal Scroll может быть передан товарищу по команде.","Варды нельзя поставить в логове Рошана.","Все не подобранные руны будут обновляться каждые две минуты.","Получение золота посредством убийства крипов часто называют «фармом».","Умирая, герой теряет ненадёжное золото, а его убийцы получают награду и опыт. Постарайтесь погибать как можно меньше... а убивать — как можно больше!","Руны богатства появляются в каждом из 4 лесов. Они появляются в начале игры, а затем — каждые 5 минут."],"intermediate":["После своей смерти Рошан появится через случайный промежуток времени от 8 до 11 минут.","Нейтральные крипы появляются на первой минуте игры, а потом — каждую минуту.","Некоторые способности можно избежать, использовав Blink Dagger или уйдя в невидимость.","Атаковать с возвышенности выгоднее, так как соперник может промахнуться атакой или потерять вас из видимости.","Чтобы уменьшить урон от вражеских заклинаний, наносящих магический урон, используйте Pipe of Insight.","Assault Cuirass усиливает броню союзников поблизости.","Если вас атакует башня, попытайтесь атаковать союзного крипа, и башня сменит цель атаки.","Если поставить вард возле лагеря нейтральных крипов, то они прекратят появляться каждую минуту.","Monkey King Bar увеличивает точность атак, поэтому с ним вы будете реже промахиваться даже по врагам на возвышенности.","При двойном нажатии на Blink Dagger вы автоматически телепортируетесь в направлении своего фонтана.","Вы можете атаковать союзных крипов, которые близки к смерти. Используйте это, чтобы не дать вашему врагу золото, которые дается за добивание.","Магический урон можно снизить с помощью предметов, дающих сопротивление магическому урону.","Физический урон можно уменьшить с помощью предметов, которые увеличивают броню.","Чистый урон не уменьшается бронёй или сопротивлением магическому урону.","Смена атрибута Power Treads выведет вас из невидимости и прервёт чтение заклинаний — например, телепортацию.","Если отвести нейтральных крипов из лагеря в конце минуты, в нем появятся новые. Так можно собрать в одном лагере много крипов.","Зажав Ctrl, вы можете использовать бутыль на союзного героя, но руны так передавать нельзя.","Прижали на базе? Вы по-прежнему можете совершать покупки в потайной лавке, отправляя туда курьера. Но будьте осторожны, чтобы он не попался на глаза врагам!","Когда рядом нет вражеских крипов, башни и казармы находятся под защитой от обхода. Она уменьшает урон по постройкам и восстанавливает им здоровье.","Quelling Blade увеличивает урон только по вражеским и нейтральным крипам.","Количество урона, блокируемого Stout Shield, Vanguard и Crimson Guard, зависит от типа атаки владельца, а не атакующего.","Dagon, Necronomicon и Boots of Travel можно улучшить, повторно купив их рецепт.","Вы можете передать товарищу по команде один вард, зажав Ctrl, нажав на вард в вашем инвентаре, а затем на товарища по команде.","Blink Dagger и Force Staff могут быть использованы для перемещения на возвышенности и спуска с них.","Quelling Blade и Battle Fury позволяют рубить деревья и прокладывать через леса собственный путь.","Эффект от Smoke of Deceit не снимается иллюзиями и крипами — только героями и башнями.","Удерживайте Alt для получения дополнительной информации в описании некоторых способностей и предметов.","Казармы не раскрывают невидимых существ или варды.","Выкуп перезаряжается 8 минут.","Каждый герой имеет основной атрибут — силу, ловкость или интеллект. Каждое очко основного атрибута увеличивает урон героя на 1.","Начиная со второй смерти, Рошан роняет Cheese в дополнение к Aegis of the Immortal. Cheese мгновенно восстанавливает 2500 единиц здоровья и 1500 единиц маны использовавшего его героя.","Иллюзии наносят Рошану гораздо меньше урона, чем другим существам.","Не забывайте проверять инвентарь ваших союзников перед покупкой предметов с аурой. Ваш напарник уже мог приобрести такой предмет, а эффекты от большинства аур не складываются.","Оглушения от разных способностей не складываются. Если сочетать способности аккуратно, то можно оглушить врага надолго.","Телепортация с помощью Town Portal Scroll и Boots of Travel не прерывается безмолвием или толчком.","Чем ближе башня к крепости своей команды, тем больше золота можно получить за её разрушение.","Использование Soul Ring даст вам дополнительную ману, даже если ваша мана уже полна.","Вы можете разрушить свою башню, если она имеет меньше 10% здоровья. Враг не получит награду за добитую вами союзную башню.","Предметы Quelling Blade и Battle Fury могут издалека уничтожать тотемы Observer Ward и Sentry Ward. Это особенно пригодится героям ближнего боя, потому что у них небольшая дальность атаки.","Физический урон, который наносят обычные удары, а также некоторые способности и предметы, можно уменьшить броней или полностью заблокировать призрачной формой.","Магический урон, который наносит большинство способностей и предметов, может быть уменьшен с помощью сопротивления магическому урону или заблокирован невосприимчивостью к заклинаниям.","Использовав Manta Style, вы немного переместитесь со своего первоначального расположения, когда появятся иллюзии. Запутайте своих врагов!","Добив союзного крипа, вы получите 20% золота от награды за его убийство.","Используйте щит летающего курьера с умом – у него очень долгая перезарядка.","При атаке целей, находящихся на возвышенности, герои и другие существа дальнего боя могут промахнуться с вероятностью в 25%.","Рошан становится сильнее каждую минуту, получая дополнительные здоровье, броню и урон.","Руна богатства даёт золото всей команде, кто бы её ни подобрал.","Некоторые способности игнорируют невосприимчивость к заклинаниям. Особенности каждой способности указаны в её описании.","Оставлять золото на выкуп — это неплохая идея. Выкуп, сделанный вовремя, может превратить отчаянную защиту в стремительное контрнаступление.","Иллюзии наносят на 60% меньше урона вражеским постройкам.","Убивать лесных крипов — опасное занятие! Чтобы враг не застал вас врасплох, используйте варды.","Каждый герой наиболее эффективен в определённый период игры.","Если вражеские герои пропали с мини-карты, то, возможно, они готовят засаду или убивают Рошана.","Перед наступлением не будет лишним проверить территорию при помощи вардов.","Играя за героя основы, легко понять, как должна действовать поддержка, и наоборот.","После 40:00 руны усиления появляются по обе стороны от центральной линии.","Предметы в рюкзаке и тайнике перезаряжаются вдвое медленнее.","Сканирование показывает, находятся ли в указанной области вражеские герои.","Mango можно скормить союзнику: примените предмет с зажатой клавишей Ctrl и укажите на нужную цель.","Когда владелец Divine Rapier погибает в первый раз, его союзники не будут получать бонусов, если подберут предмет. Но после следующей смерти Divine Rapier будет увеличивать урон любому, кто её поднимет.","Предметы Ring of Regen, Ring of Health, Sage's Mask, Void Stone и Perseverance являются частично передаваемыми — бонусы к восстановлению здоровья и маны действуют и на союзников.","Monkey King Bar не увеличивает точность атак по постройкам.","Большинство способностей героев имеют короткую анимацию применения. Все способности предметов применяются без задержек.","Телепортация с помощью Town Portal Scroll займёт больше времени, если в то же место недавно телепортировался другой герой.","Есть ли у вашей команды Medallion of Courage, Urn of Shadows или Vladmir's Offering? Возможно, вам стоит приобрести предмет, который поможет всей команде.","Tango вдвойне эффективно, если его применить на вард или на деревце от Iron Branch.","Применение Boots of Travel прервётся, если цель умрёт до окончания телепортации.","Вы получите часть золота за убийство стакнутого вами лагеря нейтральных крипов.","За третье убийство Рошана даётся Refresher Shard, либо Aghanim's Blessing. Нажмите на Рошана, и у него в инвентаре вы увидите, какой именно предмет вы получите. После четвёртого убийства остаются оба предмета.","При укреплении построек все башни, кроме первых, будут атаковать на две цели больше, начиная с ближайших."],"introduction":["Старайтесь сражаться с крипами и вражескими героями в пределах атаки союзной башни.","Будьте осторожны, переходя на территорию врага по реке.","В начале игры не забудьте приобрести предметы, восстанавливающие здоровье и ману.","Приобретайте и используйте Town Portal Scroll для быстрого перемещения по карте.","В боковых магазинах на правом и левом краях поля боя можно приобрести различные полезные предметы.","Некоторые предметы можно купить только в потайной лавке.","Ульт большинства героев можно изучить на 6-м уровне, а улучшить — на 12-м и 18-м.","Нанеся смертельный удар по крипу или герою, вы получите золото.","Убедитесь, что у вашей команды есть курьер, который сможет приносить предметы на линии.","Предметы, купленные вне магазина, будут помещены в тайник, из которого их можно будет забрать позже или доставить курьером.","При необходимости в настройках игры можно включить режим цветовой слепоты.","Активировав святыню, вы и союзники неподалёку от неё восстановите ману и здоровье."],"universal":["Комментаторы и стили интерфейса доступны всем участникам игры. Вы можете выбирать между ними, нажав на кнопку «Общий контент» в таблице счёта.","Сохраняйте спокойствие. Помните: это всего лишь игра.","Вы можете заглушить грубых игроков через таблицу результатов, которая открывается кнопкой в левом верхнем углу экрана.","Выбрав героя, вы можете использовать мини-карту в левом нижнем углу, чтобы сообщить товарищам по команде, куда вы собираетесь пойти в начале игры.","Понравилось с кем-то играть? Похвалите их, поставив им большой палец на экране результатов после игры.","Зажав клавишу Alt и нажав на способность, вы сообщите союзникам о её состоянии.","Если противника нет на линии, сообщите об этом союзникам, нажав на его изображение сверху с зажатой клавишей Alt.","Всегда будьте вежливы — особенно с вашими товарищами по команде. Людям не очень нравится слушать грубиянов.","Игроки, покинувшие матч до его завершения, будут наказаны.","Каждый может приобрести варды или курьера. Не стесняйтесь покупать то, что нужно команде!","Будьте вежливы с новыми игроками. Каждый когда-то был новичком.","Удачи и весёлой игры.","Выбирайте героя с умом. Зачастую один герой сильнее другого, а пара героев может оказаться эффективней, чем они же поодиночке.","Удерживая Shift, вы можете запланировать действия, которые выполните позже.","Выскажите свое мнение! Посетите мастерскую Dota 2 и проголосуйте за предметы, которые вы хотели бы увидеть в магазине Dota 2.","Общие предметы можно добавить в список случайных. Тогда они будут меняться сами по себе каждую игру.","Позитивный настрой может сыграть важную роль в победе.","Предпочитаете видеть лица героев вместо цветных символов на мини-карте? Вы можете изменить это в меню настроек.","Не забудьте встать и немножко размяться после матча.","Помните: неудачи иногда случаются. Каждый человек совершает ошибки.","Хотите, чтобы мини-карта была с другой стороны экрана? Вы можете сделать это в меню настроек.","В настройках вы можете определить, как часто герой будет разговаривать.","В вашем профиле есть раздел истории, где можно загружать записи недавних игр. Хороший способ развиться — взглянуть на себя со стороны!","Вы можете зажать клавишу Alt и нажать на способность или предмет, чтобы сообщить товарищам по команде об их готовности, оставшемся времени перезарядки или нехватке маны для их применения.","Будучи обезмолвленным, вы по-прежнему можете использовать предметы.","Случайно отменили телепортацию? В меню настроек есть опция, при включении которой телепортацию можно будет отменить только нажатием определённой клавиши.","Зажав клавишу Alt и нажав на предмет в инвентаре противника, вы сообщите своей команде о наличии этого предмета у противника.","Зажав клавишу Alt и нажав на кнопку выкупа или счетчик золота, вы сообщите своей команде о том, можете ли вы выкупиться.","Если вы не выбрали героя в режиме All Pick по истечении таймера, вы начнёте терять начальный запас золота.","Dota 2 постоянно развивается. Добавляются новые возможности и герои, а существующие часто изменяются. Будьте в курсе изменений — их можно найти в блоге Dota 2!","Постарайтесь не нажить себе больше противников, чем те пять, которые у вас уже есть.","При необходимости в настройках игры можно включить режим цветовой слепоты.","Зажав клавишу Alt и нажав на шкалу здоровья и маны вражеского или собственного героя, вы сообщите своей команде о текущем запасе здоровья и маны этого героя.","Вы можете сообщить своей команде о действующем на вас эффекте, зажав клавишу Alt и нажав на нужную иконку. Так же можно сделать и с вражескими героями.","Зажав кнопку Alt и щелкнув по кнопке «Укрепить постройки», вы сообщите команде о текущем статусе этой способности. Чтобы сказать команде не использовать укрепление, зажмите перед щелчком и Ctrl, и Alt.","Зажав клавишу Alt и нажав на свой таймер возрождения, вы сообщите своей команде о времени, оставшемся до вашего возрождения.","Используйте колесо чата, чтобы быстро отправить союзникам одно из выбранных сообщений. Фразы в колесе чата можно изменить в настройках.","Каждый игрок видит сообщения из колеса чата на своём языке.","Чтобы одним нажатием клавиши использовать способности там, где находится указатель мыши, настройте для них клавиши быстрого применения.","Вы можете предоставить сторонним лицам данные о ваших публичных матчах в меню настроек.","В меню настроек вы можете настроить применение предметов или способностей для использования их на себя по двойному щелчку по иконке способности или двойному нажатию на их клавишу.","Ни за что не сдавайтесь! Если ваша команда проигрывает, то получит больше золота и опыта за убийство вражеского героя.","Сделать сообщество игры дружелюбным и привлекательным — задача каждого игрока.","Хотите посмотреть, как играют профессионалы? Обратите внимание на множество турниров по Dota 2, проходящих по всему миру. Возможно, вы узнаете новые особенности любимого героя.","Автоатаку можно отключить в меню настроек.","Будьте вежливы с теми, кто покупает варды и курьеров.","Зачастую разрушить вражескую башню или казармы гораздо важнее, чем убить противника.","Сохраняйте спокойствие, будьте вежливы, и товарищи по команде прислушаются к вам.","Спокойные игроки чаще принимают правильные решения.","Старайтесь думать наперёд.","Поражение — это лишь очередной шаг на пути к следующей победе.","Можно научиться игре за нового героя, принарядить его или потренироваться добивать крипов, нажав «Опробовать» на его странице во вкладке «Герои».","Чтобы видеть, как далеко действуют способности, включите опцию «Показывать дальность применения способностей» в настройках.","Не бойтесь пробовать новых для себя героев.","Приятнее всего играть в кругу друзей.","Не бойтесь заглушать грубых игроков.","Не зацикливайтесь на своих ошибках. Сделайте выводы и играйте дальше.","Всегда следите за мини-картой.","Если при использовании голосового чата игра ненадолго зависает, попробуйте включить опцию «Упрощённое включение микрофона» в настройках звука.","Четыре руны богатства появляются в начале игры, а затем — каждые пять минут.","Лесные крипы дают заметно меньше золота и опыта, чем крипы на линии.","Если на постройки действует защита от обхода, то их окружает голубой барьер, а рядом с полосой здоровья находится значок щита.","Башни, крепости и фонтаны обладают эффектом True Sight, который раскрывает невидимых существ поблизости. Святыни и казармы не обладают таким эффектом.","Катапульты наносят существенный урон башням и в первую очередь атакуют вражеские постройки.","Если вам сложно играть против какого-то героя, попробуйте его сами. Так вы быстро узнаете о его слабостях.","Башни дают дополнительную броню союзникам поблизости: первые башни на линии увеличивают броню на 3, все остальные — на 5.","Заглушение не даёт герою использовать предметы.","Безмолвие не даёт герою использовать способности.","Истощение отключает пассивные способности героя.","Gem of True Sight теряет свои свойства, если его переносит курьер или медведь, призванный Lone Druid.","Только герои и Рошан могут прервать восстановление от предметов Healing Salve и Clarity.","Нажмите на карту с зажатой клавишей Alt, чтобы показать союзникам более подробное сообщение об этой территории.","Если Gem of True Sight упадёт на землю, команда его бывшего владельца получит обзор на небольшую область вокруг него."],"advanced":["Надёжное золото зарабатывается при убийстве героев, Рошана, курьеров и при разрушении вражеских башен, а также при использовании Hand of Midas. Всё остальное золото является ненадежным и может быть потеряно при смерти.","Вы можете натравить союзных крипов с лёгкой линии на ближайший к ней лагерь нейтральных существ.","Некоторые предметы можно разобрать на составные части, нажав на них правой кнопкой мыши и выбрав «Разобрать». Из составных частей можно собрать новые предметы!","Используйте подконтрольные группы, чтобы отдавать приказы существам, управляемым вами. Для настройки подконтрольной группы выберите одно или несколько существ, зажмите Ctrl и нажмите клавишу с цифрой. Для выбора данной группы нажмите настроенную клавишу с цифрой.","Если вы вот-вот умрёте, нажмите клавишу быстрой закупки, чтобы потратить золото до того, как оно исчезнет!","Переключение атрибута Power Treads на интеллект даст вам немного дополнительной маны.","Если у вас есть Armlet of Mordiggian, вы можете использовать его, чтобы временно поднять ваше здоровье на 500. Выключение уберёт дополнительное здоровье, снижая его вплоть до минимального значения в 1 очко.","Использовав Manta Style, вы развеете с себя некоторые отрицательные эффекты и собьёте с цели летящие в вас снаряды.","После выкупа к следующему времени возрождения будет добавлено 25 секунд.","И Cheese, и Refresher Shard можно продать за 500 золота.","Если вы будете находиться в области действия нескольких аур с одинаковым эффектом, действовать на вас будет лишь самая сильная из них.","Если вы знаете, что всё равно погибнете, можете попробовать забежать в лагерь нейтральных крипов или в логово Рошана и дать им убить вас. Так враги не получат золото и опыт за вашу смерть.","Казармы мечников восстанавливают 5 единиц здоровья в секунду. Здоровье казарм магов не восстанавливается.","Одно очко ловкости увеличивает скорость атаки героя на 1, скорость передвижения на 0,05% и даёт ему 0,14 брони.","Одно очко интеллекта добавляет 12 к общему запасу маны, 1,8% к восстановлению маны, а каждые 15 очков увеличивают урон от способностей на 1%.","Одно очко силы добавляет 18 к общему запасу здоровья и 0,55% к восстановлению здоровья, а каждые 13 очков увеличивают сопротивление магии на 1%.","Shadow Blade можно активировать во время телепортации или другой прерываемой способности.","Переключение Power Treads на ловкость на время лечения позволит вам восстановить здоровье и ману немного быстрее. Только не забудьте переключить атрибут назад.","Aegis of the Immortal можно сломать ударом.","Иллюзии дают ауры владельца окружающим существам.","Чтобы напасть на башни рядом с крепостью, необязательно уничтожать казармы. Как поступать — решать вам.","Воины, призванные с помощью Necronomicon 3-го уровня, видят невидимых юнитов.","Эффект Dust of Appearance можно развеять.","Руны можно разбивать.","Прорубающие атаки наносят физический урон, который снижается бронёй.","Уменьшение брони от Desolator усиливает даже первую атаку.","Первые башни на каждой линии не имеют защиты от обхода.","Защита от обхода вторых башен не зависит друг от друга и отключается, если поблизости есть вражеские крипы.","У третьих и четвёртых башен, казарм и крепости общая защита от обхода, которая отключится, если рядом с базой окажется вражеский крип.","Если убить всех вражеских крипов рядом с базой, защита от обхода включится не сразу.","Возвращаемый урон от Blade Mail имеет тот же тип, что и полученный.","Возвращаемый урон от Blade Mail игнорирует невосприимчивость к магии, если получаемый урон также её игнорирует.","Эффект от Eye of Skadi проходит сквозь невосприимчивость к магии, и его нельзя развеять.","Не забывайте носить с собой свиток телепортации.","Вы можете выключить предметы, дающие ауру союзным крипам, и тогда она будет действовать только на ваших героев. Делайте так, чтобы сохранить баланс на линии.","Нейтральные крипы применяют способность по области, только если рядом с ними находятся хотя бы три подходящих цели.","Большинство древних крипов имеет высокое сопротивление магии. Убивать их способностями гораздо сложнее, чем нейтральных крипов.","У обычных атак есть анимация «возвращения» после момента удара. Эту анимацию отменит любой приказ — так можно быстрее преследовать жертву.","Вражеские герои получают заряды Magic Wand, если они видят вас при применении способностей. Так можно понять, где находятся вражеские варды.","Shiva's Guard даёт беспрепятственный обзор в радиусе 800 единиц вокруг владельца. С её помощью можно заглянуть на возвышенность и за препятствия.","Эффекты от Silver Edge и Heaven's Halberd не проходят сквозь невосприимчивость к магии, но их нельзя развеять.","Если атаковать героя с расстояния больше 500 единиц, вражеские крипы не станут атаковать вас в ответ."],"hero":{"antimage":["Anti-Mage: невосприимчивость к магии не позволит способности Mana Break сжигать ману и наносить дополнительный урон."],"axe":["Axe: эффект способности Battle Hunger можно развеять, добив любого крипа.","Axe: способность Berserker's Call действует сквозь невосприимчивость к магии, поэтому она позволяет остановить врагов, применивших Black King Bar.","Если Axe применил Berserker's Call, поднимите его в воздух с помощью Eul's Scepter — так он нанесёт своим топором гораздо меньше урона.","Axe: скорость передвижения увеличивается за каждое существо под действием способности Battle Hunger. За вражеских крипов даётся вдвое меньше бонусной скорости.","Axe: иллюзии героя (например, от руны или Manta Style) наносят полный урон способностью Counter Helix.","Axe: способность Culling Blade убивает врагов даже под действием Shallow Grave или False Promise.","Axe: способностью Culling Blade можно убить курьера."],"bane":["Bane: атаковав союзника под действием способности Nightmare, вы разбудите его, но эффект перенесётся на вас.","Bane может в любой момент снять способность Nightmare как с союзника, так и с врага.","Bane: способность Nightmare ненадолго даёт цели неуязвимость, поэтому позволяет немного защитить союзников.","Bane: многие способности героя применяются на одиночную жертву, поэтому против него очень пригодятся предметы Linken's Sphere и Lotus Orb.","Bane: эффект способности Enfeeble нельзя снять даже развеиванием от такого предмета, как Black King Bar. Это сильно мешает врагам, полагающимся на физические атаки."],"bloodseeker":["Bloodseeker: способность Rupture не нанесёт урона, если её жертва телепортируется достаточно далеко.","Bloodseeker: способность Bloodrage увеличивает как получаемый, так и наносимый целью урон, поэтому применяйте её с умом.","Bloodseeker: союзник под действием способности Bloodrage сможет быстро вылечиться, убив несколько крипов.","Bloodseeker: способность Bloodrage увеличивает урон от способностей (например, Blood Rite и Rupture), от предметов и от физических атак.","Bloodseeker: предмет Linken's Sphere блокирует способность Rupture, поэтому окажется достойным вложением для некоторых героев.","Bloodseeker: способность Bloodrage не требует маны, но заряжает предметы Magic Stick и Magic Wand, поэтому они пригодятся в начальной стадии игры.","Bloodseeker: способность Thirst позволяет превысить максимальную скорость передвижения в 550 единиц.","Bloodseeker: если у вас достаточно здоровья, Blade Mail может обратить способность Rupture против её владельца."],"crystal_maiden":["Crystal Maiden: как и другие источники оцепенения, способность Frostbite прерывает телепортацию врага.","Crystal Maiden: способность Crystal Nova ненадолго даёт обзор в месте применения, поэтому поможет разведывать скрытую территорию и искать врагов, которые прячутся за деревьями.","Crystal Maiden: способность Frostbite накладывает оцепенение, поэтому её эффект можно снять предметами вроде Eul's Scepter или Manta Style.","Crystal Maiden: талант 15-го уровня на уменьшенное сжигание маны отлично работает против врагов, которые наносят урон таким образом, — например, Anti-Mage или Nyx Assassin."],"drow_ranger":["Drow Ranger: если применять способность Frost Arrows вручную, крипы не будут вас атаковать. Так можно отгонять врага с линии.","Drow Ranger: способность Gust не оглушает врагов и не прерывает действия наподобие телепортации. Враги, которых отталкивает способность Gust, могут применять предметы и атаковать.","Drow Ranger может применить способность Precision Aura, чтобы катапульты быстрее атаковали башни.","Drow Ranger: если приобрести Aghanim's Scepter, на дополнительные стрелы будут действовать все эффекты атаки: например, замедление от Frost Arrows или молнии от Maelstrom.","Drow Ranger предпочитает держать дистанцию с врагами, поэтому уязвима к нападениям с помощью Blink Dagger или Shadow Blade."],"earthshaker":["Earthshaker: способность Echo Slam нанесёт больше урона, если в области действия много врагов. Играя против этого героя, постарайтесь не толпиться.","Earthshaker: борозда от способности Fissure немного сдвигает задетых существ. Так можно подвинуть союзников или противников в более удачную позицию.","Earthshaker: эффект способности Enchant Totem действует дольше, чем она перезаряжается, поэтому герой может нанести много физического урона, подготовив способность перед схваткой.","Earthshaker крайне зависит от предметов, позволяющих выбрать хорошую позицию — например, Blink Dagger или Force Staff. Чем сложнее ему передвигаться в драке, тем меньше урона он нанесёт.","Earthshaker: атакой под эффектом способности Enchant Totem нельзя промахнуться, поэтому она очень эффективна против героев с предметами и способностями, дарующими уклонение.","Earthshaker: в отличие от других способностей, Echo Slam применяется очень быстро. Если начать бой с неё, врагам будет сложно защититься.","Earthshaker: борозда от способности Fissure очень длинная, поэтому она позволяет закрыть врагам путь к отступлению или ненадолго остановить союзных крипов.","Earthshaker очень полезен, потому что может надолго вывести врагов из строя. Чтобы защититься от него, очень пригодится невосприимчивость к магии, например, от предмета Black King Bar."],"juggernaut":["Juggernaut: удары от способности Omnislash наносятся случайным врагам рядом друг с другом — а значит, несколько противников смогут разделить урон между собой.","Juggernaut: чтобы телепортацию не прервали, вы можете получить невосприимчивость к магии, применив способность Blade Fury.","Juggernaut: под действием способности Omnislash можно применить предмет Blink Dagger, чтобы достать до врагов вдали от вас.","Juggernaut: способность Omnislash наносит физический урон, который можно полностью заблокировать предметом Ghost Scepter или Eul's Scepter.","Juggernaut: во время действия способности Blade Fury обычные атаки героя наносят урон только постройкам и вардам.","Juggernaut: тотем от Healing Ward крайне эффективно лечит команду, поэтому его стараются уничтожить как можно быстрее."],"mirana":["Mirana: стрела от способности Sacred Arrow пролетает сквозь союзных существ.","Mirana: способность Starstorm с Aghanim's Scepter не будет срабатывать, если герой находится в невидимости. Это позволяет занять выгодную позицию.","Mirana: стрела от способности Sacred Arrow летит достаточно долго. Если союзник может удержать вражеского героя на месте, попасть стрелой будет гораздо проще.","Mirana: стрела от способности Sacred Arrow позволяет разведывать части карты, где нет обзора.","Mirana: способность Moonlight Shadow позволяет незаметно подойти к вражеской команде.","Если против вас играет Mirana, предметы вроде Dust of Appearance и Sentry Ward могут определить исход матча.","Mirana: оглушение от Sacred Arrow снимается способностями с сильным развеиванием — например, Aphotic Shield."],"morphling":["Morphling не сможет ускользнуть из драки, если применить на него безмолвие.","Morphling: во время действия Waveform можно применять предметы и способности, например, Ethereal Blade или Town Portal Scroll.","Morphling: во время действия способности Waveform можно применять предметы, например, Ethereal Blade или Town Portal Scroll.","Morphling: вернувшись в исходную форму после Morph, герой будет иметь столько же здоровья и маны, сколько имел до превращения.","Morphling не получает здоровья от превращения ловкости в силу, если не может лечиться — например, под эффектом способности Ice Blast.","Morphling не прекратит превращать очки одного атрибута в другой, даже если его оглушить или обезмолвить."],"nevermore":["Shadow Fiend: способность Requiem of Souls применяется при смерти, даже если отключить герою пассивные способности.","Shadow Fiend: урон героя значительно зависит от способности Necromastery. После смерти он будет заметно слабее, пока не вернёт потерянные души.","Shadow Fiend убивает крипов крайне быстро, но если помешать ему, то герой будет набирать форму значительно медленнее.","Shadow Fiend имеет относительно немного здоровья и низкую мобильность. Он может стать основной целью для врагов, наносящих мгновенный урон.","Shadow Fiend: способность Requiem of Souls применяется достаточно долго, и подготовку могут остановить как враги, так и сам герой. При этом способность не начнёт перезаряжаться, а мана не потратится.","Shadow Fiend наносит невероятно много урона, поэтому против него может пригодиться предмет Blade Mail."],"phantom_lancer":["Phantom Lancer довольно часто покупает себе Diffusal Blade. Чтобы защититься, поможет невосприимчивость к магии — например, от предмета Black King Bar.","Phantom Lancer наносит большинство урона иллюзиями. Его врагам очень помогут предметы, позволяющие быстро уничтожить иллюзии: например, Shiva's Guard или Mjollnir.","Phantom Lancer: способностью Doppelganger можно развеивать некоторые отрицательные эффекты, а также сбивать с цели снаряды.","Phantom Lancer: иллюзии героя, созданные врагами, — например, способностью Disruption у Shadow Demon или Reflection у Terrorblade — также могут создавать дополнительные иллюзии.","Phantom Lancer: если на героя действует истощение от предмета наподобие Silver Edge или способности вроде Nethertoxin, то он не будет создавать дополнительные иллюзии способностью Juxtapose."],"puck":["Puck не сможет упрыгнуть из драки, если применить на него безмолвие.","Puck: способность Phase Shift можно отменить в любой момент, применив другую способность или предмет.","Puck: атаки по жертвам Dream Coil от таланта 25-го уровня происходят даже под действием способности Phase Shift.","Puck: если враги сильно полагаются на невосприимчивость к магии, им помешает способность Dream Coil, улучшенная с помощью Aghanim's Scepter.","Puck: многие способности героя действуют по области, поэтому против него лучше не сбиваться в кучу.","Puck: защитные способности героя применяются крайне быстро, поэтому для нападения на него пригодятся предметы вроде Blink Dagger и Shadow Blade."],"pudge":["Pudge: способность Dismember можно прервать безмолвием или оглушением.","Pudge зачастую полагается на неожиданные нападения. Имея хороший обзор на карте, вражеская команда будет не так уязвима.","Pudge может притягивать крюком руны для себя или для союзников.","Pudge: если жертва невосприимчива к магии, крюк притянет её и нанесёт ей урон, однако не прервёт применение предмета или способности.","Pudge: способность Rot наносит магический урон как врагам, так и самому герою, поэтому ему довольно часто покупают предметы, увеличивающие сопротивление магическому урону.","Pudge: крюк притягивает союзников и не наносит им урон, поэтому позволяет утянуть их в безопасное место.","Pudge: если подгадать время, можно убить самого себя способностью Rot, чтобы не отдать врагам ценные золото и опыт.","Pudge: звук способности Dismember слышен всем игрокам, даже если они не видят героя, поэтому так можно догадаться, чем он занят.","Pudge: способность Dismember оглушает невосприимчивую к магии жертву, но не наносит ей урона.","Pudge имеет совсем немного брони и очень страдает от любых физических атак, особенно если ему снижают броню.","Pudge: применение Dismember можно прервать, применив на жертву сильное развеивание, например, способностями Aphotic Shield и Press the Attack."],"razor":["Razor: способность Plasma Field наносит тем больше урона, чем дальше его жертва.","Razor: способность Plasma Field даёт обзор и поможет увидеть врагов в деревьях или на возвышенности.","Razor: связь от способности Static Link не снимается ничем, поэтому очень важно разорвать её как можно быстрее.","Razor видит цель способности Static Link, даже если она невидима.","Razor полагается на высокую скорость передвижения, благодаря которой он наносит урон способностью Eye of the Storm и забирает его с помощью Static Link. Против него помогут предметы, не позволяющие жертве передвигаться — например, Rod of Atos.","Razor: туча от способности Eye of the Storm в первую очередь атакует врагов под действием Static Link.","Razor: применив способность Eye of the Storm дважды, например, с помощью Refresher Orb, герой создаст две тучи одновременно."],"sand_king":["Sand King: способность Epicenter всегда применяется до конца, даже если сам герой погиб.","Sand King может перехитрить врагов, уходя в невидимость от способности Sand Storm и пересекая непреодолимые препятствия с помощью Burrowstrike.","Sand King: чтобы способность Sand Storm была не такой эффективной, пригодятся раскрывающие невидимость предметы вроде Dust of Appearance и применяемое на область оглушение или безмолвие — например, Waning Rift.","Sand King может применить способность Caustic Finale сразу на нескольких существ, чтобы нанести много урона.","Sand King: герой наносит очень много магического урона, который можно уменьшить предметами, дающими сопротивление магии или невосприимчивость к ней, например, Pipe of Insight или Black King Bar.","Sand King: если прервать подготовку способности Epicenter безмолвием или оглушением, она не сработает и начнёт перезаряжаться. Обзор от Observer Ward пригодится, чтобы этот герой не напал неожиданно."],"storm_spirit":["Storm Spirit не сможет улететь из драки, если применить на него безмолвие.","Storm Spirit неуязвим под действием способности Ball Lightning, поэтому она позволяет уворачиваться от оглушений и атак.","Storm Spirit может применять предметы и способности под действием Ball Lightning. Так можно неожиданно напасть на врага или безопасно телепортироваться на базу.","Storm Spirit: эффект Overload активируется любой другой способностью, в том числе Ball Lightning. Чтобы нанести как можно больше урона, старайтесь применять способность перед каждой атакой.","Storm Spirit: способность Ball Lightning не только повышает мобильность, но и наносит много урона, если применить её издалека. Чтобы играть эффективно, очень важно попадать по врагу даже с большого расстояния.","Storm Spirit крайне зависит от маны. Ему очень сильно помешают предметы и способности, сжигающие ману: например, Diffusal Blade и Mana Burn у Nyx Assassin.","Storm Spirit неуязвим под действием Ball Lightning, а это значит, что на него не действуют эффекты от движения — в том числе способность Rupture."],"sven":["Sven: прорубающая атака от способности Great Cleave наносит физический урон, который снижается бронёй.","Sven: способность Warcry ускоряет передвижение союзников, а также даёт им щит, который блокирует урон от атак.","Sven наносит много урона, только если находится рядом с врагами. Ограничивая его мобильность предметами вроде Rod of Atos или способностями наподобие Sprout, враги не дадут ему наносить урон под действием God's Strength.","Sven наносит больше всего урона физическими атаками. Их можно заблокировать таким предметом, как Heaven's Halberd.","Sven будет наносить меньше урона, если уклоняться от его атак с помощью Butterfly или Solar Crest или полностью защититься от физического урона предметом Ghost Scepter.","Sven: способность God's Strength пригодится не только в битвах, но и чтобы разрушить вражескую башню или убить Рошана."],"tiny":["Tiny: существа, подброшенные способностью Toss, получают тройной урон от Avalanche.","Tiny: способность Toss прерывает способности даже у союзников.","Tiny: на урон от дерева, брошенного способностью Tree Grab, влияют броня и увеличение урона от способностей, а также от него срабатывает магический вампиризм.","Tiny: в начале игры герой полагается на магический урон. Его значительно уменьшит предмет Infused Raindrops.","Tiny наносит высокий мгновенный урон, от которого защитят предметы вроде Aeon Disk.","Tiny атакует очень медленно, поэтому его урон заметно зависит от предметов и эффектов, увеличивающих скорость атаки.","Tiny не имеет базовой брони, поэтому он очень уязвим к физическим атакам и способностям, снижающим броню."],"vengefulspirit":["Vengeful Spirit: способность Vengeance Aura увеличивает базовый урон, который зависит от основного атрибута героя. Дополнительный урон — к примеру, от Divine Rapier — не увеличивается.","Vengeful Spirit: способность Nether Swap прерывает способности как союзников, так и врагов.","Vengeful Spirit: иллюзию от Aghanim's Scepter можно мгновенно уничтожить способностью наподобие Mana Drain или предметом вроде Scythe of Vyse."],"windrunner":["Windranger не будет атаковать цель способности Focus Fire, если остановится или выберет другую цель атаки."],"zuus":["Zeus: способность Lightning Bolt можно применить на землю, чтобы раскрыть невидимых существ или варды."],"kunkka":["Если в поздней игре Kunkka имеет много предметов на урон, его соперникам пригодится Aeon Disk."],"lina":["Lina: способность Laguna Blade проходит сквозь невосприимчивость к магии, если улучшить её с помощью Aghanim's Scepter."],"lion":["Lion: способности Hex и Mana Drain мгновенно уничтожают иллюзии."],"shadow_shaman":["Shadow Shaman: тотемы от способности Mass Serpent Wards игнорируют блокирование урона — к примеру, от Crimson Guard."],"slardar":["Slardar: способность Corrosive Haze показывает жертву и не позволяет ей уйти в невидимость."],"tidehunter":["Tidehunter: способность Kraken Shell развеивает с героя большинство отрицательных эффектов, если за небольшое время игроки нанесли ему достаточно урона."],"witch_doctor":["Witch Doctor: Blade Mail не возвращает урон от способности Death Ward, так как источником урона является не герой, а его тотем."],"lich":["Lich вынуждает выбранного вражеского героя медленно идти к себе прерываемой способностью Sinister Gaze.","Lich: способность Frost Shield можно применять на союзные постройки."],"riki":["Riki неуязвим и невидим во время применения способности Tricks of the Trade. Эту невидимость нельзя раскрыть."],"enigma":["Enigma: урон от способности Midnight Pulse зависит от максимального здоровья жертвы."],"tinker":["Tinker: способность Heat Seeking Missiles запускает ракеты только в видимых врагов."],"sniper":["Sniper: способность Shrapnel не наносит урон постройкам, а эффект от нескольких её зарядов не складывается."],"necrolyte":["Necrophos: способность Ghost Shroud полностью защищает от физических атак, но увеличивает получаемый магический урон.","Necrophos: способность Reaper's Scythe наносит урон не сразу. Во время её анимации жертву можно спасти лечением или защитой от урона."],"warlock":["Warlock: способность Fatal Bonds наносит общий урон всем жертвам, как бы далеко друг от друга они ни были."],"beastmaster":["Beastmaster: способность Primal Roar оглушает невосприимчивых к магии врагов.","Beastmaster: способностью Wild Axes можно срубить деревья, чтобы в них не прятались враги.","Beastmaster: способность Inner Beast действует как на героев, так и на крипов. Она послужит отличным подспорьем существам, полученным от Necronomicon или Helm of the Dominator.","Beastmaster: предмет Linken's Sphere полностью защитит основную цель способности Primal Roar.","Beastmaster: существа от способности Call of the Wild отлично разведывают местность и прогоняют вражеских героев, но противник получает за их убийство достаточно много золота.","Beastmaster: оглушение от Primal Roar снимается сильным очищением — например, от предмета Aeon Disk или способности Aphotic Shield."],"queenofpain":["Queen of Pain: способность Sonic Wave наносит чистый урон, который не снижается как бронёй, так и сопротивлением или невосприимчивостью к магии. Также она наносит урон курьерам."],"venomancer":["Venomancer: тотемы от способности Plague Wards игнорируют блокирование урона — к примеру, от Stout Shield или Crimson Guard."],"faceless_void":["Faceless Void: способность Time Walk не позволяет увернуться от снарядов. Кроме того, она является лечением, которое можно отключить способностью Ice Blast у Ancient Apparition или снизить предметом Spirit Vessel."],"skeleton_king":["Wraith King: способность Reincarnation сработает, даже если отключить ему пассивные способности. Она не сработает, если у героя недостаточно маны, но талант поможет это исправить."],"death_prophet":["Death Prophet: духи от способности Exorcism наносят физический урон, который снижается бронёй."],"phantom_assassin":["Против Phantom Assassin могут пригодиться предметы Aeon Disk или Blade Mail. Они позволят пережить большой мгновенный урон."],"pugna":["Pugna: способность Nether Blast наносит постройкам половину урона."],"templar_assassin":["Templar Assassin: способность Refraction блокирует урон определённое число раз независимо от его размера."],"viper":["Viper: способность Nethertoxin накладывает на жертв истощение, отключая им пассивные способности. Это сильно поможет в битве с такими героями, как Bristleback."],"luna":["Luna: способность Eclipse действует, даже если героя обезмолвить или оглушить, — но прервётся, если Luna погибнет."],"dragon_knight":["Dragon Knight: ядовитая атака от способности Elder Dragon Form действует и на постройки, поэтому герой очень полезен для осады.","Dragon Knight: способность Breathe Fire уменьшает урон от атак врага, позволяя эффективно размениваться с ним ударами и не давать ему добивать крипов.","Dragon Knight: выживаемость героя сильно зависит от пассивной способности Dragon Blood, увеличивающей восстановление здоровья и броню. Поэтому ему стоит опасаться истощения — например, от предмета Silver Edge или способности Nethertoxin.","Dragon Knight: под действием способности Elder Dragon Form герой сражается в дальнем бою, поэтому предметы наподобие Hurricane Pike будут более полезными, а Echo Sabre, наоборот, не сможет работать в полную силу.","Dragon Knight эффективен в бою, только если держится близко к своим жертвам. Чтобы не позволить ему сократить дистанцию, пригодятся замедляющие способности и предметы: например, Shiva's Guard или Rod of Atos.","Dragon Knight хорошо защищён от физического урона, так как имеет много брони, но её можно снизить предметами вроде Assault Cuirass или Medallion of Courage."],"dazzle":["Dazzle: способность Shallow Grave не позволяет цели умереть, сколько бы урона она ни получила, но её игнорируют способности, убивающие героя мгновенно."],"rattletrap":["Clockwerk: способность Battery Assault действует, даже если героя обезмолвить или оглушить, — но прервётся, если Clockwerk погибнет.","Clockwerk: способность Hookshot надолго оглушает врага, поэтому герой может сменить позицию и применить Power Cogs, оттолкнув жертву в нужную сторону и не позволив ей среагировать.","Clockwerk: героя в шестернях от способности Power Cogs можно вытолкнуть предметом Force Staff.","Clockwerk: способность Hookshot притягивает героя и к вражеским, и к союзным существам. Она позволяет легко сбежать от противника.","Clockwerk: способность Battery Assault хорошо прерывает вражеские способности.","Clockwerk: способность Rocket Flare отлично разведывает перемещения врага и добивает крипов, находящихся далеко от вас.","Clockwerk: предмет Black King Bar блокирует большинство способностей героя, но Hookshot оглушит цель даже с невосприимчивостью к магии."],"leshrac":["Leshrac: способность Diabolic Edict наносит постройкам дополнительный урон, поэтому очень пригодится для осады."],"furion":["Nature's Prophet: деревья от способности Sprout можно уничтожить предметами Quelling Blade или Tango."],"life_stealer":["Lifestealer: способность Open Wounds даёт союзникам эффект вампиризма по жертве — считается даже урон от способностей."],"dark_seer":["Dark Seer: способность Ion Shell наносит урон даже невидимым существам."],"clinkz":["Clinkz: способность Searing Arrows увеличивает физический урон от атак."],"omniknight":["Omniknight: способность Purification наносит чистый урон, который не снижается сопротивлением магии."],"enchantress":["Enchantress: эффект от способности Untouchable пропадёт, если получить невосприимчивость к магии или выбрать другую цель атаки сразу после попадания по Enchantress.","Enchantress: способность Nature's Attendants излечивает случайных союзников с неполным здоровьем. Она не так эффективно лечит героев, если рядом находятся раненые союзные крипы.","Enchantress: способность Enchant применяет на цель нормальное развеивание."],"huskar":["Huskar: способность Burning Spears наносит дополнительный магический урон (с талантом — чистый) и не действует на постройки.","Huskar: способность Life Break применяет на владельца обычное развеивание и даёт невосприимчивость к магии на время прыжка."],"night_stalker":["Ночные бонусы для Night Stalker действуют и во время действия способности Eclipse у Luna."],"broodmother":["Если паучки Broodmother атакуют врага, а затем он умрёт, то из его трупа появится паучонок."],"bounty_hunter":["Bounty Hunter: способность Track всегда даёт дополнительное золото владельцу, а его союзникам — только если они находятся в радиусе 1200 от места гибели жертвы.","Нажав на эффект Track с зажатой клавишей Alt, вы сообщите в чат, сколько золота есть у жертвы."],"weaver":["Weaver: урон жучков от способности The Swarm игнорирует уклонение цели, зато уменьшается её бронёй и блокировкой урона."],"jakiro":["Jakiro: способность Liquid Fire действует и на постройки, поэтому очень пригодится для осады."],"batrider":["Batrider наносит дополнительный магический урон, атакуя врагов под действием способности Sticky Napalm, а его союзники — нет."],"chen":["Chen: способность Penitence увеличивает скорость всех атак по жертве."],"spectre":["Spectre: способность Dispersion отражает во врагов урон того же типа, который получает герой. Чем враг ближе, тем больше урона он получит."],"ancient_apparition":["Ancient Apparition: способность Ice Blast не позволяет врагам восстанавливать здоровье. Если здоровье жертвы упадёт ниже определённого уровня, она умрёт."],"doom_bringer":["Doom: способность Doom наносит чистый урон, который не снижается бронёй или сопротивлением магии.","Doom: способность Devour забирает у жертвы не только активируемые, но и пассивные способности, а также ауры, отчего герой незаменим в командных сражениях.","Doom: предмет Linken's Sphere отлично защищает от способности Doom. Чтобы снять защиту, можно поглотить крипа с направленной способностью (например, сатира-колдуна) или приобрести активируемый предмет (например, Heaven's Halberd).","Doom: способность Scorched Earth наносит урон врагам неподалёку и увеличивает скорость передвижения владельца.","Если у героя под действием способности Doom осталось мало здоровья, союзники могут его добить. В этом случае Doom не получит золото и опыт за убийство.","Способность Doom, улучшенная предметом Aghanim's Scepter, отключает пассивные способности жертвы и поможет против таких героев, как Phantom Assassin или Spirit Breaker."],"ursa":["Ursa: способность Fury Swipes увеличивает физический урон по жертве с каждой атакой. Этот эффект действует на Рошана, но не на постройки."],"spirit_breaker":["Spirit Breaker: применив способность Charge of Darkness, вы можете лишить врага защиты от предмета Linken's Sphere на любом расстоянии."],"gyrocopter":["Gyrocopter: снаряд от способности Homing Missile следует даже за невидимыми существами, но не раскрывает невидимость."],"alchemist":["Alchemist: золото от способности Greevil's Greed считается ненадёжным, то есть его можно потерять при смерти.","Способность Acid Spray наносит физический урон и снижает броню, поэтому она поможет убить древних крипов или Рошана.","Alchemist: от способности Unstable Concoction можно увернуться, если вовремя использовать предметы Manta Style или Eul's Scepter. Так может сделать и сам владелец способности.","Alchemist: если отсчёт способности Unstable Concoction закончится до того, как применить её на врага, герой оглушит самого себя и станет уязвимой целью. Чтобы так произошло, постарайтесь обезмолвить героя или не дать ему вас увидеть.","Alchemist: способность Greevil's Greed даёт больше золота за руну богатства, кто бы из союзников её ни активировал. Бонус не действует на других героев.","Alchemist: способность Chemical Rage существенно увеличивает восстановление здоровья. Против неё поможет предмет Spirit Vessel или способность Ice Blast.","Alchemist может применить Aghanim's Scepter на другого героя, чтобы дать ему бонусные характеристики от предмета, даже если он не улучшает способности."],"invoker":["Invoker: способность Sun Strike наносит чистый урон, от которого никак не защищают сопротивление или невосприимчивость к магии."],"silencer":["Silencer: способность Glaives of Wisdom наносит чистый урон, который игнорирует сопротивление магии, но не проходит сквозь невосприимчивость к ней (если у Silencer нет Aghanim's Scepter)."],"obsidian_destroyer":["Outworld Devourer: способность Arcane Orb наносит чистый урон, который игнорирует сопротивление магии, но не проходит сквозь невосприимчивость к ней."],"lycan":["Lycan: способность Howl действует на всех союзников независимо от дальности.","Lycan: способность Shapeshift даёт критическую атаку и дополнительную скорость всем существам под контролем героя, в том числе и воинам от предмета Necronomicon."],"brewmaster":["Brewmaster: когда действие способности Primal Split заканчивается, герой появится на месте воина земли. Если он мёртв — на месте воина шторма. Если мёртв и он — на месте воина огня.","Brewmaster: такие предметы, как Monkey King Bar или Bloodthorn, помогут против уклонения от способности Drunken Brawler.","Brewmaster: если герой имеет гарантированный крит или уклонение от способности Drunken Brawler, его тело немного размывается.","Brewmaster: любые ауры героя (например, от Radiance или Vladmir's Offering) действуют вокруг воина земли. Если он мёртв — вокруг воина шторма. Если погиб и он — вокруг воина огня.","Brewmaster: способность Primal Split имеет существенную задержку, поэтому её применение можно прервать, оглушив или обезмолвив героя.","Brewmaster: воин шторма может развеять свой же эффект от Cyclone способностью Dispel Magic."],"shadow_demon":["Shadow Demon: способность Soul Catcher временно отнимает у всех врагов в указанной области часть их текущего здоровья и действует на существ под действием Disruption."],"lone_druid":["Lone Druid: медведь от способности Spirit Bear наносит постройкам дополнительный урон, поэтому очень пригодится для осады.","Lone Druid: медведь может активировать руны. Герою необязательно находиться рядом с ним."],"chaos_knight":["Chaos Knight: способность Phantasm ненадолго даёт невосприимчивость к магии и неуязвимость, позволяя увернуться от снарядов.","Chaos Knight: способность Chaos Bolt долго применяется, а её снаряд летит медленно, поэтому от него можно увернуться с помощью Blink Dagger или Eul's Scepter.","Chaos Kingt: если активировать Armlet of Mordiggian до ульта, у копий будет больше урона и здоровья.","Chaos Knight: копии от ульта мгновенно умирают от любых способностей, которые уничтожают иллюзии — например, от Mana Drain и Hex.","Chaos Knight: способность Reality Rift применяется достаточно долго, поэтому её можно избежать.","Chaos Knight: герой наносит много физического урона, от которого можно защититься бронёй или предметом Ghost Scepter.","Chaos Knight: способность Reality Rift перенесёт к цели все иллюзии героя, в том числе от Manta Style и руны иллюзий."],"meepo":["Meepo получает опыт и золото, заработанные своими копиями, но умирает вместе с любой из них."],"treant":["Treant Protector может применять способности и предметы, не теряя невидимость от способности Nature's Guise."],"ogre_magi":["Ogre Magi: способность Bloodlust можно применять на башни."],"undying":["Undying: надгробие от способности Tombstone не создаёт зомби для невидимых врагов, а если враг уйдёт в невидимость, то преследующие его зомби умрут."],"rubick":["Почти во всех случаях Rubick применяет украденную способность мгновенно, даже если у неё есть задержка."],"disruptor":["Disruptor: способность Thunder Strike наносит урон каждые две секунды, а Glimpse возвращает жертву на четыре секунды назад — значит, с помощью первой способности можно идеально рассчитать вторую."],"nyx_assassin":["Nyx Assassin: способность Spiked Carapace отражает урон вне зависимости от расстояния до врага и даже если он невидим."],"naga_siren":["Naga Siren: способность Mirror Image ненадолго даёт невосприимчивость к магии и неуязвимость, позволяя увернуться от снарядов.","Naga Siren: способность Song of the Siren не подействует на невосприимчивого к магии врага и позволит отделить его от союзников."],"keeper_of_the_light":["Keeper of the Light: если купить Aghanim's Scepter, волна от способности Illuminate будет излечивать союзников днём."],"wisp":["Пока Io привязан к союзнику способностью Tether, они оба передвигаются с одинаковой скоростью."],"visage":["Visage: если получить урон от игрока, способность Gravekeeper's Cloak станет действовать слабее, но вскоре восстановится. Также она действует на гаргулий.","Visage имеет базовое сопротивление магии в 10%, а почти все другие герои — 25%, поэтому он получает больше магического урона, если на него не действует способность Gravekeeper's Cloak.","Visage: способность Grave Chill увеличивает скорость атаки и передвижения не только герою, но и его гаргульям неподалёку.","Visage: гаргулья разрушит дерево, если применит над ним способность Stone Form."],"slark":["Slark: невидимость от способности Shadow Dance нельзя раскрыть даже эффектом True Sight."],"medusa":["Medusa: способность Mystic Snake наносит тем больше урона, чем больше противников задела, а также ворует долю от их текущего запаса маны."],"troll_warlord":["Troll Warlord: число эффектов способности Fervor увеличивается, даже если атака не попала по цели."],"centaur":["Centaur Warrunner: способность Retaliate наносит физический урон, отражая атаки вражеских существ и башен.","Centaur Warrunner: сопротивление магии снижает магический урон от способности Double Edge как врагам, так и самому герою.","Centaur Warrunner: способность Stampede действует на всех союзных героев и поможет им напасть или отступить когда угодно.","Centaur Warrunner: героев под действием Stampede можно остановить предметами Rod of Atos или Eul's Scepter.","Centaur Warrunner имеет внушительный запас здоровья, поэтому против него пригодятся способности, отнимающие здоровье в процентах — например, Feast и Heartstopper Aura.","Centaur Warrunner: способности Stampede, Double Edge и Hoof Stomp наносят магический урон, от которого защитит невосприимчивость к магии (например, от предмета Black King Bar)."],"magnataur":["Magnus: способность Empower даёт цели прорубающую атаку, которая наносит физический урон вокруг жертвы."],"shredder":["Timbersaw: способность Reactive Armor не набирает эффекты, если выключить её истощением, но повышенные до этого броня и восстановление здоровья всё так же действуют."],"bristleback":["Bristleback: истощение выключает способность Bristleback, отчего выживаемость героя заметно снижается.","Bristleback: предмет Linken's Sphere не сможет блокировать способность Viscous Nasal Goo, если улучшить её с помощью Aghanim's Scepter.","Bristleback: способность Viscous Nasal Goo очень эффективна против Рошана, ведь её можно применить на одного и того же врага несколько раз, значительно снижая его броню и скорость атаки.","Если Bristleback не сможет применять способность Quill Spray (например, из-за безмолвия), он нанесёт гораздо меньше урона.","Bristleback: герой получает эффекты Warpath, даже если способности никого не заденут.","Bristleback: способность Quill Spray наносит физический урон, который можно уменьшить бронёй.","Bristleback применяет способности очень часто, поэтому против него пригодится Magic Stick или Magic Wand."],"tusk":["Tusk: способность Snowball наносит тем больше урона, чем больше в снежном коме героев."],"skywrath_mage":["Skywrath Mage: урон способности Arcane Bolt сильно зависит от интеллекта героя."],"abaddon":["Abaddon: если на героя действует истощение, он всё ещё может применить способность Borrowed Time вручную.","Abaddon: урон от способности Aphotic Shield не зависит от поглощённого урона.","Abaddon: способностью Aphotic Shield можно развеять с союзных героев оглушения и большинство других отрицательных эффектов.","Abaddon: способность Curse of Avernus действует на постройки, поэтому она очень пригодится для осады.","Abaddon: способность Borrowed Time можно применить вручную, даже если герой оглушён или спит, при этом развеяв большинство отрицательных эффектов.","Abaddon: способность Borrowed Time не сработает автоматически, если за раз нанести больше урона, чем позволяет порог здоровья.","Если Abaddon находится под действием Borrowed Time, поднимите его в воздух с помощью Eul's Scepter — так он не сможет получать урон до окончания эффекта.","Abaddon: способность Aphotic Shield не наносит урон существам, которых не видно. Используйте туман войны или невидимость, чтобы избежать урона."],"elder_titan":["Elder Titan: способность Natural Order снижает броню врагов рядом с героем и сопротивление магии — рядом с его духом от Astral Spirit."],"legion_commander":["Legion Commander: способность Duel проходит сквозь иммунитет к магии, но от неё можно защититься предметом Linken's Sphere."],"techies":["Techies: мины от способности Proximity Mines автоматически становятся видимыми, если противник приблизится к ним, а невидимость ловушек от Stasis Trap и бомб от Remote Mines нужно раскрывать вручную.","Techies: прыжок от способности Blast Off! можно прервать перемещением — например, с помощью предмета Force Staff."],"ember_spirit":["Ember Spirit: способность Searing Chains не только накладывает оцепенение, но и ненадолго оглушает, прерывая действия врага — например, телепортацию."],"earth_spirit":["Earth Spirit: способность Boulder Smash не оглушает цель способности — только существ, задетых каменной копией.","Earth Spirit: герой может применять предметы и способности во время действия Rolling Boulder, что позволяет подготовиться к дальнейшим атакам.","Earth Spirit не сможет сбежать от вас с помощью способности Rolling Boulder, если встать на пути его отступления.","Earth Spirit: вовремя применённые способности позволят и оглушить, и обезмолвить врага при помощи лишь одной каменной копии, сохранив заряды Stone Remnant на будущее.","Earth Spirit: способность Boulder Smash можно применить на союзника, оттолкнув его в безопасное место или на более выгодную позицию.","Earth Spirit: талант, улучшающий способность Geomagnetic Grip, поможет герою легче спасать союзников, вытягивая их из гущи битвы.","Earth Spirit: способность Enchant Remnant ненадолго делает цель неуязвимой, позволяя спасать союзников от опасности."],"abyssal_underlord":["Underlord: каждая волна способности Firestorm наносит магический урон, зависящий от максимального здоровья жертвы, поэтому она очень эффективна против некоторых героев."],"terrorblade":["Terrorblade: способность Sunder не проходит сквозь иммунитет к магии, и от неё можно защититься предметом Linken's Sphere."],"phoenix":["Phoenix может применять предметы и способности во время действия способности Icarus Dive."],"oracle":["Oracle: способность Fate's Edict защищает цель от магического урона, в том числе и от Purifying Flames. Эта комбинация позволяет лечить союзников.","Oracle: способность Fortune's End развеивает с врагов многие положительные эффекты, включая лечение от Purifying Flames.","Oracle: под действием способности False Promise удваивается любое лечение, в том числе от предметов наподобие Urn of Shadows, Magic Wand и Mekansm.","Oracle: если под действием False Promise сфера над целью станет красной, то герой получил смертельный урон и умрёт после окончания способности."],"winter_wyvern":["Winter Wyvern: осколки от способности Splinter Blast задевают как невидимых врагов, так и врагов в тумане войны.","Winter Wyvern: существа под действием способности Winter's Curse не получают урона."],"arc_warden":["Arc Warden: способность Magnetic Field защищает союзников внутри поля от всех атак извне, в том числе и от башен.","Arc Warden: купол от способности Magnetic Field даёт уклонение союзным постройкам в нём.","Arc Warden: копия от способности Tempest Double снимает эффект Smoke of Deceit, в отличие от других призываемых существ.","Arc Warden: урон и замедление от способности Flux не действуют, если рядом с жертвой находится её союзник."],"monkey_king":["Monkey King: способность Boundless Strike игнорирует уклонение, поэтому ею невозможно промахнуться."],"pangolier":["Pangolier: способность Swashbuckle игнорирует уклонение, поэтому ею невозможно промахнуться."],"dark_willow":["Dark Willow: героя под действием способности Shadow Realm нельзя увидеть даже под эффектом True Sight."]}}