{"introduction":["Try to fight creeps and enemy Heroes within the attack range of your team's Towers.","Be careful when crossing the river into enemy territory.","Remember to purchase items to restore your health and mana at the start of the game.","Purchase and use Town Portal Scrolls to move around the map quickly.","There are \\\"Side Shops\\\" at the extreme east and west sides of the battlefield, where several useful items can be purchased.","Some items can only be purchased at a \\\"Secret Shop\\\".","For most heroes, the \\\"Ultimate\\\" ability can be learned at level 6, and strengthened at levels 12 and 18.","Striking the last hit on a creep or hero will earn you additional gold.","Make sure your team has a Courier to bring items to them while they are in the lanes.","Items purchased while you are away from a shop will be placed in your Stash to be retrieved later, or delivered by your team's courier.","If needed, a Color Blind option is available in the settings menu."],"universal":["Announcers and HUD Skins are shared between all players in a match. You can choose among them by pressing the Shared Content button on the left side of the Top Bar.","Remain calm. Remember: it's only a game.","You can mute rude players by going to the Scoreboard, accessed using the buttons on the left side of the Top Bar.","After you have chosen your hero, you can click on the minimap in the lower left to inform your teammates which lane you intend to use when the game begins.","Enjoyed playing with someone? Commend them by clicking on their name in the Scoreboard, accessed using the buttons on the left side of the Top Bar.","You can hold Alt and click on an ability to inform your teammates of that ability's current cooldown status.","You can inform your teammates that an enemy Hero is missing by holding Alt and clicking on that Hero's portrait in the Top Bar.","Always be polite, especially to your teammates. People are less likely to listen to those who are rude.","Players who abandon a match will be penalized.","Anyone can buy wards, and anyone can buy the courier. If your team needs something, don't be afraid to buy it!","Be nice to new players. Everyone has to start somewhere.","Good luck. Have fun.","Hero choices matter. Many heroes can counter other heroes, and many hero combinations are far more powerful and useful than any hero is alone.","Holding Shift allows you to issue actions to be performed in a sequence.","Make your voice heard! Visit the Dota 2 Workshop and vote for the items you'd like to see sold in Dota 2.","Global Items can be added to a Shuffle list, causing a different random item to be chosen for that slot for every match.","Positive reinforcement can go a long way toward victory.","Prefer to see icons of Heroes' faces instead of color-coded symbols on the minimap? You can change this in the settings menu.","Remember to stand up and stretch between matches.","Remember: everyone has bad games. Everyone makes mistakes.","Want the minimap to appear on the other side of the screen? You can change it in the settings menu.","You can adjust how often hero voices are heard in the settings menu.","You can download your match replays from the Recent Games list in your Profile. A good way to improve is by viewing your matches from a new perspective!","You can hold Alt and click on an ability or item to inform your teammates if it is ready, on cooldown, or if you do not have enough mana to use it.","You can still use items while silenced.","Accidentally canceled your Town Portal Scroll? The settings menu has an option to require a Stop command when cancelling a Teleport.","Holding Alt and clicking on an item in an enemy hero's inventory will alert your team that the enemy has that item.","Holding Alt and clicking on your Buyback button, or on your gold, will alert your team of your Buyback status.","In All Pick, players who have not chosen a Hero before the timer expires will begin to lose their starting gold.","Dota 2 is always evolving. New features are added, new Heroes are introduced, and existing Heroes and mechanics may see adjustments. Keep up with the latest changes at the Dota 2 blog!","Be careful not to make more enemies than the five you are already facing.","If needed, a Color Blind option is available in the settings menu.","Holding Alt and clicking on an enemy Hero's health and mana bars, or your own, will inform your team of that Hero's current health and mana.","You can inform your team of active buffs or debuffs on your Hero by holding Alt and clicking on their icons.","If you hold Alt and click on the Glyph of Fortification, you will inform your team of its current status. To tell your team not to use the Glyph, hold both Control and Alt while clicking on the Glyph.","Holding Alt and clicking on your respawn timer will announce your current respawn time to your team.","Use the Chat Wheel to quickly send pre-selected messages to your teammates. Chat Wheel phrases can be customized in the settings menu.","Chat Wheel messages are translated to appear in whichever language the receiving player is using.","Assign ability keys to Quickcast to use skills at the location of your mouse cursor with a single key press.","You can expose your public match data to be gathered by third parties in the settings menu.","From the settings menu you can set items and abilities to automatically cast on your Hero using a double-click on the ability icon, or with a double-tap of its assigned key.","Never give up! Killing an enemy Hero is worth more gold and experience if your team is less powerful than your opponents.","It is everyone's responsibility to try to make the Dota community a friendly and inviting place to compete.","Want to see how the pros play Dota? Check out the many Dota 2 tournaments taking place around the world. You might learn a few new tricks for your favorite hero.","You can disable auto-attacking in the options menu.","Always be nice to those who buy Wards and Couriers.","Destroying an enemy tower or barracks is usually more valuable to your team than slaying an enemy hero.","Stay calm and polite and you will have better success motivating your teammates.","Calm players almost always make better decisions.","Always be planning your next move.","Even a defeat is practice for your next victory.","Use the Hero Demo feature, available in the Heroes tab, to learn how to play new heroes, practice last hits, or design a look for your favorite hero.","You see the cast range of your spells by enabling the \\\"Ability Rangefinder\\\" in the settings menu.","Don't be afraid to experiment by playing an unfamiliar hero.","Dota is best enjoyed with friends.","Never hesitate to mute a rude player.","Try not to dwell on your mistakes. Learn from them, and move on.","Always keep an eye on your minimap.","If you are experiencing gameplay stutters when using voice chat, try going to the settings menu and turning on \\\"Streamlined Push to Talk\\\"."],"beginner":["If you notice an enemy Hero missing from your lane, tell your teammates by saying \\\"Missing Top/Middle/Bottom\\\". You may save a teammate's life!","You can level up your abilities by holding Control and pressing that ability's shortcut key.","Use Wards to reveal parts of the map and increase your awareness of the enemy team's movements.","Be sure your team has a courier to deliver your items from the shop so that you can stay in the lanes gaining experience and gold.","Sentry Wards reveal nearby invisible units as well as enemy Wards.","Roshan is much easier to kill if you reduce his Armor.","Holding shift and clicking on shop items will add them to the Quickbuy.","Striking the last hit on a tower will earn you more gold for its destruction.","The \\\"Safe Lane\\\" is the longest lane on your team's side of the river. For the Dire, this is the top lane. For the Radiant, it is the bottom lane.","The \\\"Hard Lane\\\" is the shortest lane on your team's side of the river. For the Dire, this is the bottom lane. For the Radiant, it is the top lane.","Typically, a team only needs one courier.","The movement speed bonus for having boots does not stack. No matter how many legs your chosen Hero has, you only need a single set of boots.","You can view an enemy Hero's inventory and abilities by selecting them.","It is often a good idea to carry a Town Portal Scroll.","There are many secret paths hidden in the trees, which are often called \\\"juke spots\\\". Use these to escape attacks, or to set up an ambush.","Use Dust of Appearance to reveal nearby invisible enemies.","One runes will appear in the river every two minutes, either north of the middle lane or to the south. Both Runes will spawn from 40 minutes onward.","If you have a Bottle, touching a Rune will store it for later use. Storing a Rune will also refill the Bottle.","You can select from many player-created Builds for your Hero by using the Build Guide button on the left side of the Top Bar.","Check your minimap often! You may discover that you are about to be ambushed.","Often the best way to learn a Hero's weaknesses is to play a match as them.","Destroying the enemy's barracks will strengthen your team's creeps in that lane.","Towers can see and attack invisible units.","Be aware of your position when attacking creeps. You may wind up pushing your team's creeps, and yourself, into a dangerous location.","The Side Shops sell many useful items, including Town Portal Scrolls and the components for many types of boots.","Several cliff tops have special marks to highlight good locations to place Observer Wards.","Being near your team's fountain will rapidly restore your health and mana.","Strength increases maximum Health. Agility increases Attack Speed. Intelligence increases maximum Mana.","The Secret Shop is not actually a secret.","A \\\"Carry\\\" is a hero that gains power slowly, becoming strong late in the game. A \\\"Support\\\" hero is often most powerful early in the game, and later enhances their team's effectiveness.","As long as your Hero is near a kill when it occurs, you will gain experience.","You can temporarily fortify your structures and creeps, preventing all damage to them, by using the Glyph of Fortification. Use it wisely; it has a very long cooldown.","Using Town Portal Scrolls allows you to teleport to any allied structure. Using Boots of Travel allows you to teleport to any allied unit.","If your Courier is killed, it will return, along with any items it was carrying, after 120 seconds. Flying Courier after 180 seconds.","When using a Tango, the health regeneration is always the same regardless of the size of the tree you consume.","There are many websites and videos which can help you learn more about overall tactics, team construction, and strategies for your favorite heroes.","You can give a teammate one of your Tangoes by using them on that teammate.","You can use Healing Salves on your teammates to restore their health. Share the love!","In most modes, each player automatically earns 1 gold every 0.6 seconds, or 100 gold every minute.","Town Portal Scrolls can be given to teammates.","Observer and Sentry Wards cannot be placed inside Roshan's pit.","Unclaimed Runes will be replaced every two minutes.","Earning gold by killing creeps is often called \\\"Farming\\\"."],"intermediate":["After Roshan has been killed, he will respawn at a random time between 8 and 11 minutes.","Neutral creeps spawn at the one minute mark, and then at every minute mark thereafter.","Some spells can be dodged by using a Blink Dagger or by becoming invisible.","Attacking from an uphill position gives you an advantage as an enemy may miss their attacks or lose you in the fog of war.","Using a Pipe of Insight will allow you to negate spell damage from enemy Heroes.","Assault Cuirass boosts the Armor of nearby teammates.","When a tower is attacking you, attack-clicking on an allied creep will reset the tower's target.","Placing a Ward or unit near a neutral creep camp can prevent the creatures in that camp from respawning at the minute mark.","Monkey King Bar will grant you True Strike, which prevents enemy Heroes from evading your attacks even when attacking uphill. True Strike does not work on enemy structures.","Double-clicking your Blink Dagger will cause you to automatically blink toward your team's fountain.","You can attack allied creeps that are near death. Use this to deny your enemy the gold gained from last hits.","Magic damage can be reduced by items that grant Magical Damage Resistance.","Physical damage can be reduced by items that grant Armor.","Pure damage is not reduced by Armor or by Magical Damage Resistance.","Changing the primary stat on Power Treads can break invisibility, as well as interrupt channeled spells such as using a Town Portal Scroll.","Pulling all neutral creeps out of a camp near the minute mark will allow that camp to respawn. Use this to maximize the number of creeps you kill.","Holding Control allows you to use your Bottle regeneration on an allied Hero. Bottled Runes, however, cannot be shared.","Pinned in your base? You can still make purchases from the Secret Shop by sending your Courier there. Just be careful not to send it into the enemy forces!","When no enemy creeps are near Towers and Barracks have Backdoor Protection, which lessens the damage they take and allows them to restore their health.","Quelling Blade only inflicts its bonus damage on enemy and neutral creeps.","The Damage Blocked values on a Stout Shield, Vanguard or Crimson Guard refer to the type of Hero carrying the shield, not the type of attacker.","Dagon, Necronomicon, and Boots of Travel can be upgraded by purchasing their recipes again.","You can give a teammate a single ward by holding Control, clicking on the ward in your inventory, then clicking on your teammate.","Blink Dagger and Force Staff can be used to climb up and down cliff sides.","Use a Quelling Blade to cut down trees and carve your own path through the forests.","Illusions and creeps will not dispel Smoke of Deceit, only enemy Heroes and Towers will.","Holding Alt will display additional information in the descriptions of several abilities and items.","Barracks cannot reveal invisible units or wards.","Buyback has a 8 minute cooldown.","Each hero has a primary attribute of Strength, Agility, or Intelligence. Every point in your hero's primary attribute increases their attack damage by 1.","From his second death onward, Roshan will drop Cheese in addition to the Aegis of the Immortal. Using Cheese instantly refills that hero's health by 2500 and mana by 1500.","Hero illusions are instantly destroyed if they attack Roshan.","Remember to check your allies' inventories before purchasing an item for its aura effect. A teammate may already have that item, and most auras do not stack.","Stun durations from different skills do not stack. You can keep an enemy stunned for longer with careful timing of your skills.","Teleports from Town Portal Scrolls and Boots of Travel are not cancelled by silences or knockbacks.","The closer a Tower is to its team's Ancient, the more gold its destruction will yield.","Using a Soul Ring will grant you extra mana even if your mana is already full.","You can destroy allied Towers when they are below 10% health. Denying a Tower gives no gold to the enemy for its destruction.","You can use a Quelling Blade to destroy enemy observer and sentry wards.","Physical Damage, dealt by regular attacks, some hero abilities, and some items, can be reduced with Armor or blocked by becoming Ethereal.","Magical Damage, dealt by most hero abilities and items, can be reduced with Magical Damage Resistance or blocked by Spell Immunity.","Activating Manta Style will move you from your original position when the illusions appear. Use this to confuse enemies!","Denied creeps grant 25% of their normal experience - to both teams.","Use the Flying Courier's Shield wisely. It has a very long cooldown.","Ranged heroes and units have a 25% chance to miss when attacking uphill.","Roshan becomes stronger every 4 minutes, gaining additional health, damage, and armor.","Bounty Runes provide gold to the entire team regardless of which hero picks them up.","Some abilities cannot be blocked by spell immunity. Each ability's interaction with spell immunity is shown in its description.","Consider saving gold for Buyback. A well-timed Buyback can turn a desperate defense into a swift turnaround.","Illusions deal 60% less damage to enemy structures.","Farming in the jungle can be dangerous! You may want to buy and place a few wards to prevent enemy attempts to ambush you.","Each hero reaches their maximum effectiveness at a different time in the match.","If all enemy heroes have vanished from the minimap, they may be trying to slay Roshan, or setting up an ambush.","Try setting wards near the next objective your team wishes to attack.","Learning to play as a Support will make you a better Carry player. Learning to play as a Carry will make you a better Support player."],"advanced":["Reliable Gold is earned from killing Heroes, Roshan, and Couriers, from the destruction of enemy Towers, or from using Hand of Midas. All other earnings are Unreliable Gold, which can be lost upon death.","You can pull the creatures in the neutral creep camp that is nearest to your team's Safe Lane into your lane creeps.","Several items can be broken down to their component parts by right-clicking them in your inventory and choosing \\\"Disassemble\\\". Re-use those components to create new items!","Use Control Groups to issue orders to different sets of units under your control. To set a Control Group, select a unit or units, hold Control, and press a number. To select that Control Group, press that number.","If you are about to die, press your \\\"Purchase Quickbuy\\\" key to spend your gold before it disappears!","Swapping the primary attribute on Power Treads to Intelligence can give you a little extra mana.","If you have an Armlet of Mordiggian, you can turn on Unholy Strength to temporarily raise your health by 500.  Disabling Unholy Strength will remove the added health, down to a minimum of 1 health.","Activating Manta Style removes several buffs and debuffs, and will cause projectiles that are already in flight to miss.","After using Buyback, 25% of a hero's remaining respawn time at the time of Buyback is added to their next death.","Cheese can be sold for 500 gold.","If you are within range of several auras with the same effect, only the most powerful aura will be active.","If you know you are about to die, consider entering a neutral creep camp, or going to Roshan, and letting them kill you instead. This will deny the enemy team the gold and experience earned from your death.","Melee Barracks regenerate 5 hit points per second. Ranged Barracks do not regenerate.","One point of Agility increases hero attack speed by 1, armor by 0.14 and move speed by 0.05%.","One point of Intelligence adds 12 maximum mana, 1.8% mana regeneration, and spell damage is increased by 1% for every 15 points","One point of Strength adds 18 maximum health, as well as 0.55% health regeneration and 1% magic resistance for every 13 points.","Shadow Blade can still be activated while channeling a Town Portal Scroll.","Switching Power Treads to Agility while healing allows your health and mana to restore slightly faster. Just don't forget to switch them back!","The Aegis of the Immortal can be attacked and denied.","Though illusions are not affected by auras, they will still grant shared auras from their original hero to nearby units.","You do not need to destroy the enemy team's barracks to damage the towers near their Ancient. Destroying barracks is optional.","Warriors summoned by using a Level 3 Necronomicon have True Sight.","The effects of Dust of Appearance can be purged.","Runes can be attacked and denied.","Cleave damage is physical damage that is not mitigated by armor."],"lore":["Atos, the Lord of Blight, has a fragment of his essence stored in the Rod of Atos.","The Eye of Skadi was guarded by the Azure dragons.","The Shadow Blade was once the sword of a now long-forgotten king.","Crystal Maiden and Lina are sisters."],"hero":["Magic Immunity will prevent Anti-Mage's Mana Break ability from burning mana or doing extra damage.","Axe's Battle Hunger effect can be dispelled by last hitting a lane creep or neutral.","Attacking an ally under the effect of Bane's Nightmare will release them from the Nightmare but cause you to be Nightmared instead.","It is possible to use a Town Portal Scroll while Ruptured by Blood Seeker without taking further damage.","Crystal Maiden's Frostbite is not only a root, but a very short stun, good for interrupting a hero channeling a spell.","Drow Ranger's Frost Arrows will not draw creep aggro if cast manually rather than auto-cast during an attack. You can use this to harass in lane.","Earthshaker's Echo Slam ability does more damage when many enemy units are in the area of effect. Try to spread out when facing Earthshaker.","Juggernaut's Omnislash splits attacks randomly between nearby targets - having many enemy units near Juggernaut will cause each of them to take a smaller amount of damage, instead of focusing all the hits on a single target.","Mirana's Sacred Arrow will fly through units friendly to Mirana.","Silence can be effective at locking down a slippery Morphling.","Shadow Fiend's Requiem of Souls will be cast on death, even if Shadow Fiend is affected by Break.","Phantom Lancer often chooses to build a Diffusal Blade; Magic Immunity from a Black King Bar can be used to counter this effect.","Silence can be effective at locking down a tricky Puck.","Pudge's Dismember ability is channelled and can be interrupted with a silence or stun.","Razor's Plasma Field ability does more damage the further away a target is.","Sand King's Epicenter ability will continue to pulse for the full duration, even if Sand King himself dies.","Silence can be effective at locking down an evasive Storm Spirit.","Sven's Great Cleave causes physical damage in an area that is not mitigated by armor.","Units affected by Tiny's Toss will take double damage from Tiny's Avalanche.","Vengeful Spirit's Vengeance Aura will increase base damage and damage from a hero's primary stat. Extra damage, for example from a Divine Rapier, will not be increased.","Windranger can choose not to attack her Focus Fire target, by attacking a different target or by issuing a stop command.","Zeus' Lightning Bolt can be cast on the ground to reveal nearby invisible units, including wards.","An Aeon Disk is often a good item to build late game when facing a Kunkka with many damage items.","Lina's Laguna Blade ability will pierce spell immunity, if Lina builds an Aghanim's Scepter.","Lion's Hex and Mana Drain abilities will instantly destroy an illusion.","Shadow Shaman's Mass Serpent Wards are not affected by damage block, for example from a Crimson Guard.","Slardar's Corrosive Haze provides True Sight and vision of the target.","Tidehunter's Kraken Shell ability will trigger a Strong Dispel on Tidehunter when enough player caused damage is done to him within a short time.","Blade Mail will not return damage from Witchdoctor's Death Ward, as the source of the damage is the ward and not Witchdoctor himself.","Lich's Ice Armor can be put on auto-cast which will automatically cast on nearby heroes who are being attacked.","Riki is invulnerable and invisible during Tricks of the Trade, and cannot be revealed with True Sight during this spell.","Enigma's Midnight Pulse does damage based on a percentage of the target's maximum HP.","Tinker's Heat Seeking Missiles will only lock onto targets that Tinker has vision of.","Sniper's Shrapnel does not affect buildings.  Multiple Shrapnel effects do not stack on the same target.","Necrolyte's Ghost Shroud ability makes him immune to physical attacks, but he takes additional magical damage in this state.","Warlock's Fatal Bonds ability causes damage on the victims to be shared, regardless of the distance between the victims.","Beastmaster's Primal Roar will stun spell immune targets.","Queen of Pain's Sonic Wave ability is pure damage, and is not prevented by armor, spell resistance or spell immunity. It will also damage couriers.","Damage from Venomancer's Plague Wards is not affected by damage block, for example from a Stout Shield or Crimson Guard.","Faceless Void's Time Walk does not disjoint projectiles. Time Walk is a healing effect and can be prevented by Ancient Apparition's Ice Blast or reduced with Spirit Vessel.","Wraith King's Reincarnate will trigger even if Wraith King is affected by Break. It will not trigger if Wraith King has insufficient mana; a talent can reduce this cost to 0.","The damage from Death Prophet's Exorcism spirits is physical damage and can be mitigated by armor.","An Aeon Disk or Blade Mail can be a good item to build facing a Phantom Assassin with high burst damage.","Pugna's Nether Blast ability deals half damage to structures.","Templar Assassin's Refraction ability blocks a number of damage instances, regardless of the amount of damage those instances would cause.","Viper's Nethertoxin causes Break on affected targets, which disables passive abilities. This can be very effective against heroes like Bristleback.","Luna's Eclipse ability will continue for the full duration, even if Luna is silenced or stunned. Eclipse will stop if Luna is killed.","Dragon Knight's Elder Dragon Form Corrosive Breath affects structures in addition to units, making it an effective siege ability.","Dazzle's Shallow Grave ability prevents the target from dying for the duration from any amount of damage from any source - however instant death abilities can still kill a unit during Shallow Grave.","Clockwerk's Battery Assault ability will continue, even if Clockwerk is silenced or stunned. Battery Assault will end if Clockwerk is killed.","Leshrac's Diabolic Edict does additional damage to structures, making it an effective siege ability.","Nature's Prophet's Sprout trees can be cut down with Quelling Blade or consumed with a Tango.","Life Stealer's Open Wounds ability causes allies of Lifestealer to gain Lifesteal against the victim with any attack, including spells.","Dark Seer's Ion Shell will do damage to nearby units even if they are invisible.","Clinkz's Searing Arrows ability causes extra physical damage on his attacks.","Omniknight's Purification ability causes pure damage, which cannot be mitigated with magic resistance.","Enchantress' Untouchable debuff can be mitigated by having spell immunity, or briefly attacking a different target during the attack backswing.","Huskar's Burning Spears deal extra magical damage, or pure damage if a talent is chosen. Burning Spears does not affect buildings.","Night Stalker's nighttime bonuses also apply during Luna's Eclipse.","Broodmother's Spiderlings can in turn spawn Spiderites from units they damage which are then killed.","Allies will only get the bonus gold from Bounty Hunter's Track if they are within 900 of the victim when it dies. Bounty Hunter himself has no range restriction for bonus gold from Track.","Weaver's Swarm Beetles apply physical damage that ignores evasion, but is mitigated by armor or block effects.","Jakiro's Liquid Fire affects buildings, making it an effective siege ability.","Batrider's Sticky Napalm deals extra magical damage to the victim when Batrider attacks. Sticky Napalm does not trigger when other units attack the target.","Chen's Penitence ability causes the target to take additional damage from physical, magical and pure damage types.","Spectre's Dispersion ability reflects damage back to attackers, of the same type as the damage inflicted. It reflects more damage to units which are closer to Spectre.","Ancient Apparition's Ice Blast prevents healing effects to units affected. If a victim's health drops below a critical threshold, the victim is killed.","Doom's Doom ability causes pure damage, which cannot be mitigated by armor or magic resistance.","Ursa's Fury Swipes ability causes extra physical damage when attacking a target repeatedly. Fury Swipes does not work on structures, though it does affect Roshan.","Spirit Breaker's Charge of Darkness ability can be used to trigger an enemy's Linken's Sphere at any range, so long as Spirit Breaker has vision of the target.","Gyrocopter's Homing Missile can track invisible targets, but do not grant true sight.","Gold Alchemist earns through Grevil's Greed is unreliable.","Invoker's Sun Strike deals pure damage, which cannot be mitigated with magic resistance or spell immunity.","Silencer's Glaives of Wisdom deals pure damage, which cannot be mitigated with magic resistance but does not pierce spell immunity, unless Silencer has an Aghanim's Scepter.","Outworld Devourer's Arcane Orb deals pure damage, which cannot be mitigated with magic resistance, but does not pierce spell immunity.","Lycan's Howl ability has global range, affecting all allies regardless of distance. It is more effective at night.","When Brewmaster's Primal Split ends Brewmaster will try to reappear at the position of the Earth spirit if alive, then Storm spirit if alive, and finally at the position of the Fire spirit.","Shadow Demon's Soul Catcher increases all damage the victim will take from all sources. Soul Catcher can be cast on targets Banished by Disruption.","Lone Druid's Spirit Bear does additional damage to structures, making it very effective at sieging.","When Chaos Knight casts Phantasm, he disjoints projectiles and is briefly invulnerable and spell immune.","Meepo gains XP or gold when any of his clones gain XP or gold. Meepo dies whenever any of his clones die.","Casting spells or using items does not break the invisibility of Treant Protector's Nature's Guise.","Ogre Magi's Bloodlust can be cast on towers.","Undying's Tombstone does not spawn zombies for nearby invisible units, and existing zombies will expire if the unit they are tracking becomes invisible.","When Rubick casts a stolen spell he can do so with zero casting time, even if the spell normally has a cast time (with very few exceptions).","Disruptor's Thunder Strike pulses every two seconds. Glimpse moves the target back in time four seconds. You can use Thunder Strike to perfectly time a Glimpse.","Nyx Assassin's Spiked Carapace will reflect damage no matter how far away the attacker is, and even if the attacker is invisible.","Naga Siren is briefly invulnerable and spell immune during the casting of Mirror Image and will disjoint projectiles.","It is possible to use a Town Portal Scroll while Mana Leaked by Keeper of the Light. If you teleport even a short distance away, Mana Leak will not drain mana for the teleport.","While Io is tethered to an ally, it moves at the same speed as that ally.","Visage's Gravekeeper's Cloak ability decreases in effectiveness as players damage Visage but will quickly regenerate. Gravekeeper's Cloak also affects Visage's familiars.","While Slark is under the effect of Shadow Dance, he cannot be revealed by True Sight.","Medusa's Mystic Snakes increase their damage and mana steal with each successive bounce. The mana stolen is a percentage of the target's current mana.","Troll Warlord's Fervor gains stacks even when the attack is evaded or disjointed.","Centaur Warrunner's Return reflects incoming damage back as physical damage. It also reflects damage from tower attacks.","Magnus' Empower ability grants the target Cleave, which causes physical damage which ignores armor in an area around each attack.","When Timbersaw is affected by Break, he will not gain additional stacks of Reactive armor, but existing stacks will continue to provide armor and health regen.","When Bristleback is affects by Break, his Bristleback ability is disabled, substantially reducing his survivability.","Tusk's Snowball does more damage when more heroes are inside it.","Skywrath Mage's Arcane Bolt does substantially more damage based on Skywrath's intelligence.","Abaddon's Borrowed Time can still be activated manually when Abaddon is affected by Break.","Elder Titan's Natural Order causes enemies to have armor reduced around Elder Titan, and magic resistance to be reduced around Elder Titan's Spirit.","While Legion Commander's Duel will pierce spell immunity from a Black King Bar, a Linken's Sphere will prevent a duel.","Techies' Proximiy Mines are automatically revealed when an enemy units walks nearby. Stasis Traps and Remote Mines require True Sight to reveal.","Ember Spirit's Searing Chains can interrupt a channelling target, for example an enemy escaping with a Town Portal scroll.","Earth Spirit's Boulder Smash does not stun the unit directly targeted, only units hit by the Smashed unit or remnant.","Underlord's Firestorm ability does a percentage of the victim's maximum hp as magical damage with each wave.","While Terrorblade's Sunder will pierce spell immunity from a Black King Bar, a Linken's Sphere will prevent the Sunder.","Phoenix can use items and cast abilities during Icarus Dive.","During Oracle's False Promise, the overhead orb will be red if the target has taken lethal damage and is predicted to die when the effect expires.","Winter Wyvern's Splinter Blast shards will hit invisible units as well as units in the fog of war.","Arc Warden's Magnetic Field grants evasion to allies within the field to attacks that come from outside the field, including tower attacks.","Monkey King's Boundless Strike ignores evasion, and cannot miss.","Pangolier's Swashbuckle ignores evasion, and cannot miss.","When Dark Willow is under the effect of Shadow Realm, she cannot be revealed by True Sight."]}