{"beginner":["自分のレーンから敵ヒーローが消えたときには、「トップ/ミッド/ボトムで見失った」と言って、チームメイトに警告しましょう。あなたがチームメイトの命を救うのです！","アビリティをレベルアップさせるには、コントロールキーを押したまま、レベルアップさせたいアビリティーのショートカットキーを押しましょう。","敵チームの動きを把握するため、マップ上の様々な場所にワードを設置しましょう。","チームに1体、ショップからアイテムを運ぶクーリエを確保しましょう。そうすればレーンを離れる必要が無くなり、ゴールドと経験値を上げ続けることができるでしょう。","Sentry Wards は周囲の透明化しているユニットだけでなく、敵ワードをあばくことができます。","「セーフレーン」とは、川を挟んで自分の陣地から伸びる最も長いレーンを意味します。Dire にとってはトップレーンが、Radiant にとってはボトムレーンがこれに該当します。","「ハードレーン」とは、川を挟んで自分の陣地から伸びる最も短いレーンを意味します。Dire にとってはボトムレーンが、Radiant にとってはトップレーンがこれに該当します。","通常、1チームが必要とするクーリエの数は1です。","ブーツを複数持っても移動速度ボーナスは重なりません。選んだヒーローに脚が沢山生えていたとしても、ブーツは一足で十分です。","敵ヒーローをクリックすると、そのインベントリとアビリティを見ることが出来ます。","Town Portal Scroll を常に所持することをおすすめします。","近くに潜む透明化している敵をあばくにはDust of Appearance を使いましょう。","トップバー左側のビルドガイドボタンをクリックすると、そこからユーザー作成のビルドを選択することが出来ます。","敵のバラックを破壊すると、そのレーンに居る自チームのクリープが強化されます。","タワーは、透明なユニットを看破して攻撃することができます。","クリープを攻撃するときに自分の位置を確認しましょう。自チームのクリープを結果的にプッシュして、いつの間にか危険地帯に入ってしまうかもしれません。","サイドショップでは、Town Portal Scrolls や様々な種類のブーツを作成するための材料などを含め、多数の有益なアイテムが販売されています。","自分のチームの泉の近くにいると、ヘルスとマナの回復速度が速まります。","Strength が最大ヘルスを、Agility は攻撃速度を、そして Itelligence は最大マナを上昇させます。","シークレットショップといいますが、実際秘密ではありません。","Town Portal Scrolls を使用すると味方チームの建造物へテレポートできます。Boots of Travel で味方ユニットの所へテレポートできます。","Town Portal Scrolls はチームメイトにあげられます。","Observer ワードと Sentry ワードはRoshan の洞窟内に設置できない。","拾われなかったルーンは２分毎に別のルーンに変わります。","クリープを殺してゴールドを獲得することは、「ファーミング」と呼ばれている。"],"intermediate":["Roshan は殺されてから、8-11分（ランダム）後に生き返る。","いくつかのスペルは Blink Dagger を使用するか透明になることで回避することが出来ます。","丘から攻撃すると、敵が戦場の霧であなたを見失ったり攻撃をミスしたりすることがあり、有利となります。","Assault Cuirass は周囲の味方チームメイトのアーマーを上昇させる。","タワーに攻撃されているときに、味方クリープを攻撃クリックすれば、タワーの目標がリセットされます。","ワードやユニットを中立クリープのキャンプに設置すると、1分経過後もそのキャンプ内のクリープが再出現できなくすることができます。","バラックは透明ユニットやワードを看破で来ません。","Town Portal Scrolls とBoots of Travelによるテレポートは、サイレンスやノックバックで取り消しになりません。","Ranged ヒーローとユニットは 25% の確率で、自分より高い位置にいるユニットへの攻撃をミスする。"],"introduction":["自チームのタワーの攻撃範囲内で敵クリープや敵ヒーローと戦うようにしましょう。","川を渡って敵地に入っていくときには注意が必要です。","ゲーム開始時には、マナとヘルスを回復させるアイテムの購入をお忘れなく。","マップ上を素早く動き回る為に、Town Portal Scrolls を購入して使用しましょう。","忘れずにレーン内のチームメイトにアイテムを運ぶためのクーリエをチームとして購入しましょう。","設定メニューから色覚異常用のオプションも選択できる。"],"universal":["落ち着きましょう。覚えておいてください。これはただのゲームです。","スコアボードから、無礼なプレイヤーをミュートにすることが出来ます。スコアボードを開くには、トップバーの左側のボタンをクリックしてください。","いつも礼儀正しくしましょう（特にチームメイトに対して）。通常、人は無礼な人の意見を耳に入れません。","マッチを放棄したプレイヤーにはペナルティがあります。","新しいプレイヤーには優しくしてあげましょう。誰でも初めは新入りです。","Good luck. Have fun.","ヒーロー選択は重要です。多くのヒーローは相手ヒーローへカウンター出来ますが、複数のヒーローのコンビネーションで戦う方が単体のヒーローよりもより強力で優勢となります。","シフトキーを長押しすると、連続アクションが可能となります。","グローバルアイテムはシャッフルリストに追加でき、毎回のマッチでそのスロットに対して異なるアイテムが選択されます。","味方を褒めたり認めると、勝利につながることもある。","ミニマップ上で、カラーコードされたシンボルではなくヒーローの顔を表示させたいですか？設定メニューから変更できますよ。","マッチとマッチの間は、椅子から立ち上がって、ストレッチするのを忘れずに。","覚えておいてください：上手くいかない試合もあります。人はミスを犯すものです。","スクリーンの反対側にミニマップを移動させたいですか？設定メニューから変更できますよ。","設定メニューから、ヒーローの発言頻度を調整することが出来ます。","Alt キーを押しながらアビリティあるいはアイテムをクリックすると、チームメイトに使用状況９直ぐに使用可能、クールダウン中、マナが足りないなど）を伝えることができます。","サイレンスを受けている最中もアイテムを使用することはできます。","Alt キーを押しながら敵ヒーローのインベントリ内にあるアイテムをクリックすると、チームメイトに敵がそのアイテムを持っているという警告することが出来ます。","Alt キーを押しながらバイバックボタン或いはゴールドをクリックすると、バイバックのステータスが表示されます。","オールピックでは、タイマーが切れる前にヒーローをピックしないと、開始時のゴールドが減っていきます。","Dota 2 は常に進化を続けます。新機能が追加され、秦ヒーローが登場するだけでなく、既存のヒーローやメカニクスも調整が加わります。最新の変更については、Dota 2 ブログでチェックしよう！","既に対峙している5人の敵以外に敵を作らないように気をつけてください。","設定メニューから色覚異常用のオプションも選択できる。","Alt キーを押しながら敵ヒーローあるいは自分のヘルスとマナバーをクリックすると, チームメイトにそのヒーローの現在のヘルスとマナを教えます。","Alt キーを押しながら Glyph of Fortification をクリックすると、チームメイトにその現状を伝えられます。チームメイトに Glyph を使わないよう伝えるには、Cntrl  キーと Alt キーを同時に押しながら Glyph をクリックしてください。","Alt キーを押しながら自分のリスポーンタイマーをクリックすると、チームメイトに現在のリスポーンタイマーを伝えます。","チャットホィールを使うと、予めセットされたメッセージをチームメイトに送信できます。チャットホィールのフレーズは設定メニューからカスタマイズできます。","チャットホィールメッセージは、受け取り手のプレイヤーが使用している言語に翻訳されて送信されます。","アビリティーキーをクイックキャストに割り当てると、マウスカーソルの位置で一度キーを押すだけでスキルを使用できるようになります。","設定メニューからパブリックマッチデータを公開して、サードパーティーが収集できるようにできます。","設定メニューから、アビリティアイコンをダブルクリックするか、割り当てキーのダブルタップで自分のヒーローにアビリティを自動キャストするように設定することができます。","あきらめないで！自分のチームが相手チームより弱い状態で敵ヒーローを倒すと、大量のゴールドと経験が手に入ります。","Dota コミュニティをフレンドリーかつ競争性のある場所にできるかどうかは全員の肩にかかっています。","プロ選手による Dota を見たいなら、是非世界各地で開催されている Dota 2 トーナメントをチェックしてください。お気に入りのヒーローで使えるトリックを見つけられるかもしれません。","オプションメニューから自動攻撃を無効化できます。","ワードやクーリエを買ってくれるプレイヤーに感謝しましょう。"],"advanced":["メレーバラックは、1秒ごとに5HP自然回復する。レンジバラックは回復しない。","Aegis of the Immortal は攻撃してディナイできる。","Level 3 Necronomicon で召喚された Warriors は True Sight を持つ。","Dust of Appearance の効果はパージできます。","ルーンを攻撃してディナイできます。"]}