{"beginner":["Dacă observi că un Erou inamic lipsește de pe lane-ul tău, spune-le coechipierilor tăi folosind \"Lipsește Top/Middle/Bottom\". S-ar putea să-i salvezi viața unui coechipier!","Îți poți îmbunătăți abilitățile ținând apăsat Control și apăsând pe butonul scurtătură a acelei abilități.","Folosește Ward-uri pentru a descoperi părți din hartă și a spori șansele de a cunoaște mișcările echipei inamice.","Asigură-te că echipa ta are un curier pentru a-ți livra obiectele de la magazin, așa că poți rămâne pe lane-uri pentru a obține experiență și aur.","Sentry Ward-urile dezvăluie unitățile invizibile din apropiere, precum și Ward-urile inamice.","Roshan este mult mai ușor de ucis dacă îi reduci armura.","Dacă ții apăsat de shift și dai click pe obiecte din magazin, acestea vor fi adăugate în zona de cumpărare rapidă.","Aplicând ultima lovitură unui turn îți va oferi mai mult aur pentru distrugerea acestuia.","„Safe Lane-ul” este cel mai lung lane din partea ta de hartă de dinainte de râu. Pentru Dire, lane-ul acesta este cel de sus. Pentru Radiant, este cel de jos.","„Hard lane-ul” este cel mai scurt lane din partea ta de hartă de dinainte de râu. Pentru Dire, acesta este lane-ul de jos. Pentru Radiant, acesta este lane-ul de sus.","De obicei, o echipă are nevoie doar de un curier.","Viteza de mișcare bonus de la mai multe perechi de papuci nu se suprapune. Nu contează câte picioare are Eroul ales, ai nevoie doar de un singur set de papuci.","Poți vedea inventarul și abilitățile unui Erou la selectarea acestuia.","De multe ori e o idee bună să cari Town Portal Scroll.","Sunt multe cărări secrete ascunse între copaci, care sunt numite de multe ori \"juke spots\". Folosește-le pentru a scăpa de atacuri sau pentru a pregăti o ambuscadă.","Folosește Dust of Appearance pentru a dezvălui inamicii invizibili din apropiere.","Poți selecta dintre multe Build-uri create de jucători pentru Eroul tău folosind butonul Ghid Build din partea stângă a Barei de Sus.","Verifică miniharta des! Poți descoperi dacă ești pe cale de a fi surprins.","De multe ori, cea mai bună metodă de a afla slăbiciunile unui Erou este de a juca un meci cu acesta.","Distrugând baraca inamicului va crește puterea creep-ilor echipei tale de pe acel lane.","Turnurile pot vedea și ataca unitățile invizibile.","Ține cont de poziția ta atunci când ataci creepi. S-ar putea să-ți împingi creepii, cât și pe tine, într-o zonă periculoasă.","Magazinele Laterale pot oferi multe obiecte utile, inclusiv Town Portal Scroll și componente pentru multe tipuri de cizme.","Câteva stânci au însemne speciale pentru a marca zone bune în care poți pune Observer Wards.","Îți vei regenera rapid mana și viața cât timp timp stai lângă fântâna echipei tale.","Strength mărește viața maximă. Agility mărește viteza de atac. Intelligence mărește mana maximă.","Magazinul Secret nu prea este un secret.","Un erou „Carry” este acel tip de erou care crește în putere în mod treptat, spre sfârșitul meciului devenind puternic. Un erou „Support” este adesea foarte puternic la începutul meciului, iar mai târziu sporește eficacitatea echipei sale.","Cât timp eroul tău este în apropiere atunci când are loc o ucidere, vei primi experiența.","Poți să-ți fortifici temporar structurile și creepii, prevenind tot damage-ul către aceștia prin folosirea a Glyph of Fortification. Ai grijă când îl activezi, are un cooldown foarte lung.","Town Portal Scroll îți permite să te teleportezi către orice structură aliată. Boots of Travel îți permit să te teleportezi către orice unitate aliată.","După ce moare Curierul tău, acesta se va întoarce în 120 de secunde, împreună cu obiectele pe care le căra. Curierul zburător se întoarce în 180 de secunde.","Când folosești un Tango, regenerarea vieții e aceeași, indiferent de mărimea copacului pe care îl consumi.","Există multe site-uri și videoclipuri care te pot ajuta să înveți mai multe despre tactici în general, modalități de compunere a echipei și strategii pentru eroii tăi preferați.","Poți oferi unui coechipier un Tango prin folosirea Tangoului pe acel coechipier.","În majoritatea modurilor de joc, fiecare jucător primește automat 1 aur la fiecare 0,6 secunde, adică un total de 100 de aur pe minut.","Poți să dai Town Portal Scroll coechipierilor tăi.","Nu poți pune Observer Ward sau Sentry Ward în bârlogul lui Roshan.","Runele nerevendicate vor fi înlocuite la fiecare două minute.","Obținerea de aur prin omorârea de creep-i se numește deseori \"Farming\".","Decesul unui erou duce la pierderea unei sume variabile de aur și oferă aur și experiență ucigașilor. Încearcă să nu mori și să-ți ucizi inamicii atunci când ai oportunitatea!"],"intermediate":["După ce Roshan a fost ucis, el va apărea din nou după o perioadă de timp aleatorie cuprinsă între 8 și 11 minute.","Creepii neutri apar după ce ceasul jocului ajunge la un minut, iar apoi la fiecare minut după.","Unele vrăți pot fi evitate folosind Blink Dagger sau devenind invizibil.","Atacând de la deal îți oferă un avantaj în sensul că un inamic te poate rata sau să fie afectat de ceața războiului, astfel pierzându-te din câmpul vizual.","Folosind Pipe of Insight vei putea nega damage-ul magic al eroilor inamici.","Assault Cuirass sporește armura tuturor coechipierilor din apropiere.","Când un turn te atacă, atacă un creep aliat pentru a reseta ținta turnului.","Punând un Ward sau o unitate în apropierea unei tabere de creep-i neutri îi poate opri din a reînvia la sfârșitul minutului.","Apăsând de două ori pe Blink Dagger, acesta te va face să te teleportezi automat spre fântâna echpei tale.","Poți ataca creepii aliați care sunt aproape de moarte. Poți folosi această metodă pentru a nega inamicilor aurul și experiența cuvenită în urma loviturilor finale.","Damage-ul magic poate fi redus de obiectele care oferă Rezistență la Damage Magic.","Damage-ul fizic poate fi redus de obiectele care oferă armură.","Damage-ul pur nu este redus de către Armură sau Rezistență la Damage Magic.","Schimbând atributul primar al Power Treads îți poate întrerupe invizibilitatea cât și vrăjile care necesită concentrare, cum ar fi folosirea de Town Portal Scroll.","Tragerea tuturor creepilor neutri dintr-o tabără atunci când se apropie momentul apariției noilor creepi va permite taberei aceleia să creeze alți creepi. Folosește trucul acesta pentru a ucide cât mai mulți creepi cu putință.","Dacă ții apăsat pe Control, vei putea să folosești regenerarea din Bottle pe un Erou aliat. Runele din Bottle nu pot fi împărtășite.","Nu poți ieși din bază? Mai poți face achiziții de la Magazinul Secret folosind Curierul. Ai grijă să nu-l trimiți în forțele inamice!","Când niciun creep nu e în apropiere de Turnuri și Barăci acestea vor avea Backdoor Protection, care va reduce damage-ul pe care îl vor primi și va permite structurilor să-și regenereze viața.","Quelling Blade cauzează damage bonus numai creep-ilor neutri și inamici.","Poți oferi unui coechipier un singur ward ținând apăsată tasta Control, dând clic pe wardul din inventar, iar apoi clic pe coechipier.","Obiectele Blink Dagger și Force Staff pot fi folosite ca să urci sau să cobori anumite stânci.","Iluziile și creepii nu vor înlătura efectul de la Smoke of Deceit, numai eroii și turnurile pot face asta.","Dacă ții apăsata tasta Alt, vei observa informații suplimentare în descrierile mai multor obiecte și abilități.","Barăcile nu pot dezvălui unități invizibile sau ward-uri.","Răscumpărarea are un cooldown de 8 minute.","Fiecare Erou are un atribut principal de Forţă (Strength), Agilitate (Agility) sau Inteligenţă (Intelligence). Fiecare punct din aceste atribute le creşte Eroilor damage-ul de atac cu 1.","Începând cu a doua moarte, Roshan va oferi Cheese pe lângă Aegis of the Immortal. Când e folosit de un erou, Cheese va vindeca instant 2500 viață și 1500 mana.","Iluziile eroilor îi cauzează lui Roshan mult mai puțin damage decât o fac în mod normal.","Amintește-ți să verifici inventarele aliaților înainte de a cumpăra un obiect pentru efectul său de aură. Un coechipier ar putea avea deja acel obiect, iar majoritatea aurelor nu se cumulează.","Duratele năucirilor de la abilități diferite nu se adună. Poți să faci ca un inamic să fie năucit mai mult timp prin sincronizarea cu grijă a abilităților tale.","Teleportările folosind Town Portal Scroll și Boots of Travel nu sunt întrerupte de amuțiri sau împingeri.","Cu cât mai aproape se află un Turn de Ancient-ul echipei sale, cu atât mai mult aur va rezulta din distrugerea lui.","Prin folosirea unui Soul Ring vei primi mana în plus chiar dacă mana ta e plină.","Poți distruge turnurile aliate care au mai puțin de 10% viață. Sacrificarea unui turn nu oferă inamicilor aur pentru distrugerea sa.","Damage-ul fizic dat de atacurile obişnuite, de unele abilităţi ale eroilor şi de unele obiecte poate fi redus cu ajutorul armurii sau blocat transformându-l în stare eterică.","Damage-ul magic cauzat de majoritatea abilităților de erou și de obiecte poate fi redus cu rezistența la damage magic sau poate fi blocat de imunitatea la vrăji.","Activarea Manta Style te va muta din poziția ta inițială atunci când apar iluziile. Folosește-te de asta pentru a-ți deruta inamicii!","Eroii ranged și unitățile au o șansă de 25% de a rata atacurile în deal.","Unele abilități nu pot fi blocate de imunitatea la vrăji. Interacțiunea fiecărei abilități cu imunitatea la vrăji este afișată în descriere.","Ia în calcul păstrarea de aur pentru Răscumpărare. O Răscumpărare la timpul potrivit poate întoarce o defensivă disperată într-o schimbare rapidă de situație.","Iluziile provoacă cu 60% mai puțin damage structurilor inamice.","Farmingul din junglă poate fi periculos! Poate vei vrea să cumperi și să amplasezi câteva warduri pentru a împiedica încercările inamicului de a te ambusca.","Fiecare erou își atinge eficacitatea maximă la un moment diferit în meci.","Dacă toți eroii inamici au dispărut de pe minihartă, s-ar putea că ei să pună la cale o ambuscadă sau să îl nimicească pe Roshan.","Încearcă să poziţionezi ward-urile lângă obiectivul pe care echipa ta vrea să-l atace.","Dacă înveți să joci ca Support vei deveni un jucător Carry mai bun. Dacă înveți să fii Carry vei deveni un jucător de Support mai bun.","Începând cu minutul 40, runele cu puteri vor apărea în ambele puncte de apariție ale râului.","După ce un Divine Rapier este scăpat pentru prima oară, acesta nu poate fi folosit de aliați după ce aceștia îl ridică (dar obiectul poate fi înapoiat). Oricine poate folosi Divine Rapierul numai după ce un inamic îl ridică și îl scapă din nou.","Majoritatea vrăjilor au o animație scurtă de invocare înainte ca efectul să aibă loc. Toate obiectele își invocă efectele instantaneu, fără să aibă nevoie de un timp de invocare.","Concentrarea unui Town Portal Scroll va dura mai mult timp dacă un alt erou s-a teleportat recent în aceeași zonă.","Echipa ta are un Medallion of Courage, un Urn of Shadows sau un Vladmir's Offering? Câteodată poate fi mai bine să-ți iei obiecte care să-ți ajute întreaga echipă.","Tangourile sunt de două ori mai eficace atunci când sunt folosite pentru a se consuma un Ward sau un copac creat de un Iron Branch."],"introduction":["Încearcă să te bați cu creep-i și Eroi inamici în zonele în care Turnurile echipei tale pot ataca.","Ai grijă când treci râul și ajungi în teritoriu inamic.","Ține minte să cumperi obiecte care să-ți regenereze viața și mana la începutul jocului.","Cumpără și utilizează Town Portal Scroll pentru a te mișca mai repede pe hartă.","Există „magazine laterale” în extremitățile estice și vestice ale câmpului de luptă, de unde se pot cumpăra câteva obiecte folositoare.","Unele obiecte pot fi cumpărate doar de la un \"Magazin Secret\".","Pentru majoritatea eroilor, abilitatea „Ultimate” poate fi învățată la nivelul 6 și îmbunătățită la nivelurile 12 și 18.","Vei primi aur suplimentar dacă omori un creep sau un erou folosind o lovitură finală.","Nu uita să verifici dacă echipa ta are un Curier care să aducă obiectele cât timp coechipierii nu sunt în bază.","Obiectele achiziționate atunci când ești departe de magazin se vor transfera în depozitul tău și le poți revendica mai târziu sau pot fi livrate de curierul echipei tale.","Dacă este necesar, o opțiune pentru Mod Daltonist este disponibilă în meniul de setări."],"universal":["Crainicii și aspectele de HUD sunt împărtășite între toți jucătorii dintr-un meci. Poți alege una dintre ele apăsând butonul \"Conținut împărtășit\", din partea stângă de pe bara de sus.","Fii calm. Ține minte: e doar un joc.","Poți amuți jucătorii nepoliticoși din tabela de scor, care poate fi accesată folosind butoanele din partea stângă a barei de sus.","După ce ți-ai ales eroul, poți face clic pe miniharta din stânga jos, ca să îți informezi coechipierii cu privire la laneul pe care intenționezi să mergi când începe jocul.","Poți ține apăsat alt+clic pe o abilitate pentru a-ți informa coechipierii cu privire la cooldownul acelei abilități.","Poți să îți informezi coechipierii că un Erou inamic lipsește ținând tasta Alt apasată și dând clic pe portretul Eroului din Bara de Sus.","Fii întotdeauna politicos, în special cu proprii coechipieri. Oamenii sunt mai puțin dispuși să asculte de cei nepoliticoși.","Jucătorii care abandonează un meci vor fi penalizați.","Fii amabil cu jucătorii noi. Toți trebuie să înceapă de undeva.","Baftă. Distracție plăcută.","Contează ce erou alegi. Mulți eroi contracarează alți eroi și există multe combinații de eroi care sunt mai puternice și utile împreună decât orice alt erou care e de unul singur.","Poți face ca o serie de acțiuni să fie efectuată consecutiv folosind tasta Shift.","Fă-te auzit! Vizitează Atelierul Dota 2 și votează obiectele pe care ai dori să le vezi vândute înl Dota 2.","Obiecte Globale pot fi adăugate într-o listă de Amestecare, cauzând ca un obiect aleator să fie ales în acel loc pentru fiecare meci.","Încurajarea poate ajuta mult atunci când vrei să câștigi.","Preferi iconițe cu fețele eroilor în locul simbolurilor colorate pe minihartă? Poți schimba asta în meniul de setări.","Ține minte să te ridici și să te întinzi între meciuri.","Ține minte: toată lumea mai are jocuri proaste. Toată lumea greșește.","Vrei ca miniharta să apară în celălalt colț al ecranului? Poți schimba asta în meniul de setări.","Poți ajusta cât de des sunt auzite vocile eroilor din meniul de setări.","Poți descărca reluări cu meciurile tale din lista Jocuri Recente de pe Profilul tău. O metodă bună de a învăța e să vizionezi meciurile tale dintr-o nouă perspectivă!","Poți să ții apăsat pe Alt și să dai clic pe o abilitate sau un obiect pentru a-ți informa coechipierii dacă e gata de utilizare, dacă are cooldown sau dacă nu ai mana suficientă pentru utilizare.","Poți folosi în continuare obiecte în timp ce ești amuțit.","Ai întrerupt din greșeală un Town Portal Scroll? În setările din meniu există o opțiune care te forțează să folosești comanda „Stop” pentru a întrerupe teleportarea.","Ținând tasta Alt apăsată și dând clic pe un obiect din inventarul unui erou inamic va alerta echipa ta că inamicul are acel obiect.","Apăsarea tastei Alt și a butonului de răscumpărare, sau pe aurul tău, îți va alerta echipa cu privire la starea răscumpărării tale.","La alegerea din toți, jucătorii care nu au ales un Erou înainte de expirarea timpului vor începe să piardă din aurul oferit la început.","Dota 2 evoluează continuu. Sunt adăugate funcţionalităţi noi, sunt introduşi eroi noi, iar eroii şi mecanicele care există în prezent primesc îmbunătăţiri. Ține pasul cu ultimele schimbări notate pe blogul Dota 2!","Ai grijă să nu-ţi faci mai mulţi duşmani decât cei 5 pe care îi ai deja.","Dacă este necesar, o opțiune pentru Mod Daltonist este disponibilă în meniul de setări.","Ținând apăsat Alt si apăsând pe bara de viață sau de mana a unui inamic, sau a ta, îți vei informa echipa asupra vieții sau manei curente a acelui Erou.","Dacă ții apăsat Alt și apeși pe Glyph of Fortification, îți vei informa echipa cu privire la statutul său actual. Pentru a-ți sfătui echipa să nu folosească Glyph of Fortification, ține apăsat atât Control cât și Alt în timp ce apeși click pe Glyph.","Dacă ții apăsat Alt și faci click pe cronometrul tău de revenire, echipa ta va fi anunțată cu privire la cât timp a mai rămas până la revenirea ta.","Folosește Rotița de Chat pentru a trimite rapid mesaje pre-selectate coechipierilor tăi. Mesajele Rotiței de Chat pot fi personalizate din meniul de setări.","Mesajele Rotiței de Chat sunt traduse pentru a apărea în orice limbă folosește jucătorul care recepționează mesajul.","Setează butoanele pentru abilități în meniul de Invocare Rapidă pentru a folosi abilitățile la locația cursorului mouse-ului cu o singură apăsare de buton.","Îţi poţi expune datele meciurilor publice pentru a fi preluate de terţi din meniul cu setări.","Din meniul de setări poți seta ca obiectele și abilitățile să fie utilizate pe Eroul tău folosind dublu-click pe iconița abilității sau cu o apăsare dublă a tastei sale desemnate.","Să nu te dai niciodată bătut! Uciderea unui erou inamic valorează mai mult aur și experiență dacă echipa ta este mai puțin puternică decât cea a adversarilor.","Este responsabilitatea tuturor să transforme comunitatea Dota într-un loc prietenos şi ospitalier pentru competitori.","Vrei să vezi cum joacă profesioniștii Dota? Vizionează multiplele turnee de Dota 2 care se desfășoară în toată lumea. S-ar putea să înveți trucuri noi pentru eroul tău preferat.","Poți să dezactivezi atacul automat în meniul de opțiuni.","Să te porți mereu frumos cu cei care cumpără warduri și curieri.","Distrugerea unui turn inamic sau a unor barăci este de obicei mai de valoare pentru echipă decât uciderea unui erou inamic.","Rămâi calm şi politicos şi vei reuşi să îţi motivezi mai mult coechipierii.","De regulă, jucătorii calmi iau decizii mai bune.","Întotdeauna planifică-ţi următoarea mişcare.","Chiar și o înfrângere este o modalitate de exercițiu pentru următoarea ta victorie.","Utilizează funcția Demo Erou, disponibilă din secțiunea Eroi, pentru a învăța cum să joci cu un erou nou, exersa loviturile finale, sau să creezi obiecte pentru Eroul tău preferat.","Poți vedea raza de folosire a vrăjilor tale dacă permiți \"Indicarea razei abilității\" din meniul de setări.","Nu te teme să experimentezi prin alegerea unui erou nefamiliar.","Cea mai bună experiență de Dota are loc cu prietenii.","Nu ezita niciodată să amuţeşti un jucător nepoliticos.","Încearcă să nu te împotmoleşti în propriile greşeli. Învaţă din ele şi mergi mai departe.","Fii întotdeauna cu ochii pe minihartă.","Dacă jocul îți merge sacadat atunci când folosești chatul vocal, încearcă să intri în meniul de setări și să activezi „Push To Talk simplificat”.","Clădirile cu o protecție activă împotriva backdooringului pot fi identificate folosind bariera albastră din jurul clădirii și iconița cu scut de lângă bara sa cu viață.","Turnurile, Ancientul și fântâna oferă True Sight, astfel dezvăluind unitățile invizibile din apropiere. Altarele și barăcile nu oferă True Sight.","Siege creepii cauzează turnurilor damage suplimentar și vor ținti clădirile inamice atunci când e posibil.","Dacă întâmpini probleme împotriva unui anumit erou, încearcă să joci cu acesta. Vei afla rapid care e slăbiciunea acestuia.","Toate turnurile oferă armură aliaților din apropiere, 2 armură pentru turnurile din primul rând și 3 armură pentru restul turnurilor.","Un Gem of True Sight nu va funcționa atunci când este cărat de curier sau de spirit bearul lui Lone Druid."],"advanced":["Aurul constant este câștigat prin uciderea eroilor, a lui Roshan, a curierilor, prin distrugerea turnurilor inamice și prin utilizarea a Hand of Midas. Toate celelalte câștiguri sunt în aur variabil, care poate fi pierdut în urma unui deces.","Poți atrage creaturile din tabăra creep-ilor neutri cea mai apropiată de Safe-Lane-ul echipei tale către creep-ii lane-ului tău.","Majoritatea obiectelor pot fi dezbinate în părțile componente atunci când dai clic dreapta pe ele în inventar și folosind opțiunea „Dezasamblare”. Poți refolosi componentele acelea pentru a crea obiecte noi!","Utilizează Grupele de Control pentru a da ordine unor seturi diferite de unități aflate sub controlul tău. Pentru a crea o Grupă de Control, selectează una sau mai multe unități, ține apăsat tasta Control și apasă un număr. Pentru a selecta acel Grup de Control, apasă acel număr.","Dacă ești pe cale de a muri, apasă tasta \"Achiziționează Cumpărare Rapidă\" pentru a-ți cheltui aurul înainte să dispară!","Schimbând atributul primar din Power Treads la Inteligență îți poate da puțină mana în plus.","Dacă ai un Armlet of Mordiggian, poți activa Unholy Strength pentru a-ți mări temporar viața cu 500. Dezactivarea abilității Unholy Strength va înlătura viața suplimentară, până la un minim de 1 viață.","Activarea Manta Style elimină o serie de buffuri și debuffuri și va face ca proiectilele deja aflate în aer să rateze ținta.","Dacă ești în raza a mai multe aure cu același efect, numai cea mai puternică dintre acestea va fi activă.","Dacă știi că ești pe cale să mori, consideră intrarea într-o tabără de creep-i neutri, sau să te duci la Roshan, și să-i lași pe aceștia să te omoare în schimb. Astfel, moartea ta nu va genera experiență și aur pentru echipa adversă.","Baraca Melee își regenerează 5 puncte de viață pe secundă. Baraca Ranged nu se regenerează.","Un punct de agility mărește viteza de atac a eroului cu 1, armura cu 0,14 și viteza mișcare cu 0,05%.","Un punct de intelligence crește mana maximă cu 20 de puncte, iar regenerarea de mana cu 0,55%. De asemenea, pentru fiecare 15 puncte de intelligence, damage-ul vrăjilor este mărit cu 1%.","Un punct de Strenght crește viața maximă cu 20 de puncte, iar regenerarea vieții cu 0,55%. De asemenea, pentru fiecare 13 puncte de strength, rezistența la magie este mărită cu 1%.","Shadow Blade poate fi activat și atunci când se concentrează Town Portal Scroll sau orice altă vrajă cu concentrare.","Schimbând atributul principal al Power Treads în Agility în timpul vindecării face ca viața și mana proprii să se încarce puțin mai rapid. Doar să nu uiți să le schimbi înapoi!","Aegis of the Immortal poate fi atacat și sacrificat.","Nu trebuie să distrugi barăcile echipei inamice pentru a putea să distrugi turnurile de lângă Ancientul lor. Distrugerea barăcilor este opțională.","Warriorul invocat prin folosirea unui Necronomicon de nivelul 3 are True Sight.","Efectele ale Dust of Appearance pot fi descântate.","Runele pot fi atacate și sacrificate.","Când ataci cu un Desolator, chiar și primul atac va beneficia de armura redusă asupra țintei.","Protecția împotriva backdooringului a turnurilor din rândul al 2-lea se dezactivează dacă un creep inamic este în apropiere. Protecția fiecărui turn din rândul al 2-lea împotriva backdooringului este independentă de celelalte.","Toate turnurile din rândurile 3 și 4, barăcile și Ancientul au aceeași protecție împotriva backdooringului, protecție care se dezactivează oricând un creep inamic se apropie de orice porțiune a bazei.","Protecția împotriva backdooringului continuă să fie dezactivată pentru o scurtă durată și atunci când toți creepii inamici au părăsit zona.","Blade Mailul returnează același tip de damage ca cel primit.","Obiectele care generează o aură care se aplică creepilor aliați poate fi comutată pentru a aplica efectele numai eroilor din apropiere. Folosește acest fapt pentru a nu împinge lane-ul pe care te afli.","Majoritatea creepilor ancient au o rezistență mare la magie, așa că e mai greu să-i ucizi pe aceștia folosind vrăji, spre deosebire de ceilalți creepi neutri.","Atacurile normale au o animație care are loc după momentul atacului. Orice ordin dat va anula animația aceasta și îți va permite să-ți urmărești victima mult mai repede.","Shiva's Guard oferă vedere din aer într-o zonă de 800 de unități în jurul celui care invocă abilitatea, astfel încât aceasta este o abilitate utilă pentru a verifica zone precum cele situate deasupra ta sau dincolo de obstacole.","Silver Edge și Heaven's Halberd nu străpung imunitatea la vrăji, dar nu pot fi descântate.","Dacă ataci un erou cât timp ești la o distanță de 500 de unități sau mai mare față de creepi, aceștia nu te vor ataca."],"hero":{"antimage":["Imunitatea la magie va împiedica abilitatea Mana Break a lui Anti-Mage din a arde mana sau din a cauza damage suplimentar."],"bane":["Atacarea unui aliat afectat de Nightmare-ul lui Bane va face ca acesta să scape de sub efectul vrăjii, dar în același timp, tu vei prelua Nightmare-ul.","Bane poate să-și anuleze Nightmare-ul oricând, indiferent dacă unitatea este aliată sau inamică.","Bane are multe abilități care țintesc o singură unitate, astfel încât Linken's Sphere și Lotus Orb devin foarte eficace atunci când sunt folosite împotriva lui."],"bloodseeker":["E posibil să folosești un Town Portal Scroll cât timp ești afectat de Rupture-ul lui Bloodseeker, iar astfel nu vei primi damage suplimentar.","Bloodseeker poate aplica Bloodrage pe inamici pentru a mări damage-ul pe care aceștia îl primesc de la toate atacurile posibile. Acest fapt, însă, le va mări damage-ul de atac, așa că abilitatea ar trebui folosită cu foarte mare grijă.","Prin invocarea Bloodrage-ului pe un aliat, Bloodseeker poate să-l ajute să se vindece rapid prin uciderea creepilor din apropiere.","Linken's Sphere va bloca Rupture-ul lui Bloodseeker, astfel încât obiectul acesta poate fi o investiție bună pentru anumiți eroi care se vor înfrunta cu Bloodseeker.","Chiar dacă nu costă mana, Bloodrage-ul lui Bloodseeker va mări numărul de încărcături ale unui Magic Stick sau Magic Wand, acest fapt fiind util împotriva acestuia în faza de laning a meciului.","Thirstul lui Bloodseeker îi permite să depășească limita normală de viteză de 550.","Dacă ai suficientă viață, Blade Mailul poate fi foarte eficace pentru a folosi Rupture împotriva lui Bloodseeker."],"earthshaker":["Echo Slamul lui Earthshaker cauzează mai mult damage cu cât mai multe unități inamice se află în zona sa de efect. Încercați să stați cât mai departe unul de celălalt atunci când vă înfruntați cu un Earthshaker.","Datorită faptului că bonusul de damage de la Enchant Totemul lui Earthshaker durează mai mult decât cooldownul abilității, acestuia i se permite să cauzeze cantități masive de damage dacă este folosit înainte și în timpul luptei.","Earthshaker se bazează foarte mult pe obiecte ca Blink Dagger și Force Staff pentru a găsi o poziție bună pentru a-și folosi vrăjile. Limitarea mobilității acestuia este esențială pentru a reduce damage-ul posibil pe care îl poate cauza.","Enchant Totemul lui Earthshaker are True Strike, astfel încât acesta este foarte eficace împotriva eroilor care au evasion, ca Phantom Assassin sau a obiectelor precum Butterfly.","Spre deosebite de celelalte abilități ale lui Earthshaker, Echo Slam are un timp de invocare foarte scurt, așa că abilitatea aceasta poate fi folosită pentru a începe luptele cu inamicii înainte ca aceștia să poate reacționa cu obiecte defensive.","Distanța mare a Fissure este grozavă pentru a bloca calea de scăpare a inamicilor sau pentru a împiedica avansarea creepilor aliați pentru o durată scurtă de timp.","O parte semnificativă a utilității lui Earthshaker rezultă din cantitatea sa masivă de năuciri pe care o poate genera. Imunitatea la vrăji de la un obiect, cum ar fi cea rezultată de la un Black King Bar, este crucială pentru a-i reduce eficacitatea."],"juggernaut":["Omnislash-ul lui Juggernaut atacă unitățile din apropiere în mod aleator. Dacă sunt mai multe unități inamice lângă Juggernaut, atunci fiecare dintre acestea va primi mai puțin damage, iar tot damage-ul nu va mai fi concentrat pe o singură țintă.","Blade Fury-ul lui Juggernaut poate fi folosit pentru a acorda imunitate la magie înainte sau după ce folosești un Town Portal Scroll.","Juggernaut poate folosi un Blink Dagger în timpul Omnislash-ului pentru a intra în contact cu ținte pe care, de regulă, nu le-ar putea atinge.","Omnislash-ul lui Juggernaut cauzează damage fizic care poate fi negat complet folosind Ghost Scepter sau Eul's Scepter.","Atacurile normale ale lui Juggernaut nu cauzează damage cât timp Blade Fury este activ, cu excepția clădirilor și wardurilor.","Healing Wardul este extrem de eficient pentru vindecarea echipei lui Juggernaut, iar astfel s-ar putea ca acesta să fie o țintă prioritară a inamicilor în timpul luptelor."],"mirana":["Sacred Arrow-ul Miranei va zbura prin unitățile aliate acesteia.","Îmbunătățirea cu Aghanim's Scepter a Miranei nu va declanșa Starmstormul dacă aceasta este invizibilă, astfel permițându-i să se poziționeze în mod strategic înainte de a-l folosi.","Sacred Arrow-ul Miranei are un timp de traversare considerabil. Un coechipier poate pregăti o năucire care poate mări șansa Miranei de a lovi eroii inamici cu săgeata.","Sacred Arrow-ul Miranei poate fi foarte util pentru a cerceta zonele întunecate ale hărții.","Moonlight Shadow-ul Miranei poate fi folosi în mod ofensiv pentru a pregăti atacuri surpriză împotriva echipei inamice.","Cărarea unui Dust of Appearance sau a unui Sentry Ward poate face diferența dintre o înfrângere și o victorie atunci când înfrunți o echipă care o are pe Mirana.","Abilitățile cu descântece puternice, precum Aphotic Shieldul lui Abaddon, sunt grozave pentru înlăturarea unei năuciri de lungă durată cauzată unui erou aliat de Sacred Arrow-ul Miranei."],"phantom_lancer":["Phantom Lancer cumpără adesea un Diffusal Blade, astfel încât imunitatea la magie de la un Black King Bar poate fi folosită pentru a contracara efectul acestui obiect.","Aplicarea de Break unui Phantom Lancer, cum ar fi de la un obiect ca Silver Edge sau o abilitate ca Nethertoxinul lui Viper, va face ca Phantom Lancer să nu mai poată genera iluzii suplimentare din Juxtapose."],"puck":["Amuțirea poate fi o metodă eficace de a opri un Puck enervant.","Dacă este ales talentul „Foc rapid pentru Dream Coil”, Puck va continua să atace inamicii afectați de Dream Coil, chiar și atunci când este sub efectul Phase Shift.","Dacă adversarii se bazează pe imunitatea la magie, Puck poate achiziționa un Aghanim's Scepter pentru a se asigura că Dream Coilul său va rămâne în continuare o năucire puternică.","Puck are multe abilități care afectează zone întregi, așa că este extrem de important să stați cât mai depărtați unii de alții când jucați în echipa adversă acestuia.","Deoarece abilitățile defensive ale lui Puck au timpi de invocare extrem de mici, echipa adversă poate opta să inițieze un atac asupra lui Puck folosind obiecte precum Blink Dagger sau Shadow Blade."],"sand_king":["Abilitatea Epicenter a lui Sand King va continua să pulseze pe toată durata, chiar dacă Sand King moare.","Sand King poate aplica Caustic Finale pe mai multe unități în același timp, fapt ce poate rezulta într-o cantitate masivă de damage atunci când se declanșează.","Sand King cauzează o cantitate masivă de damage magic care poate fi redus de obiecte care oferă rezistență sau imunitate la magie, cum ar fi Pipe of Insight sau Black King Bar.","Amuțirea sau năucirea lui Sand King înainte ca acesta să-și termine concentrarea pentru Epicenter va face ca abilitatea să intre în cooldown, fără să rănească echipa inamică. Vederea de la Observer Warduri este esențială pentru a urmări poziția lui Sand King înainte de luptele în echipă."],"storm_spirit":["Amuțirea poate fi o metodă eficace de a opri un Storm Spirit buclucaș.","Storm Spirit este invulnerabil în timp ce folosește Ball Lightning, abilitatea permițându-i să ignore multe năuciri și atacuri.","Storm Spirit este foarte dependent de mana pentru a lupta. Obiectele și abilitățile care îi reduc mana, cum ar fi Diffusal Blade sau Mana Burnul lui Nyx, pot fi extrem de devastatoare împotriva lui Storm Spirit."],"vengefulspirit":["Vengeance Aura a lui Vengeful Spirit va mări damage-ul de bază și damage-ul de la statistica principală a unui erou. Damage-ul suplimentar, cum ar fi cel de la un Divine Rapier, nu va fi mărit.","Iluzia lui Vengeful Spirit de la îmbunătățirea cu Aghanim's Scepter poate fi ucisă instantaneu cu abilități precum Mana Drainul lui Lion sau obiecte precum Scythe of Vyse."],"zuus":["Lightning Boltul lui Zeus poate fi invocat pe sol pentru a dezvălui unitățile invizibile din apropiere, inclusiv wardurile."],"lina":["Dacă Lina construiește un Aghanim's Scepter, Laguna Blade-ul acesteia va străpunge imunitatea la vrăji."],"shadow_shaman":["Mass Serpent Wardurile lui Shadow Shaman nu sunt afectate de blocarea de damage, cum ar fi cea de la un Crimson Guard."],"slardar":["Corrosive Haze-ul lui Slardar oferă True Sight și vedere asupra țintei."],"tidehunter":["Abilitatea Kraken Shell a lui Tidehunter va aplica un descântec puternic pe acesta atunci când încasează suficient damage de la jucători într-un interval scurt de timp."],"witch_doctor":["Blade Mail nu va returna damage-ul de la Death Wardul lui Witch Doctor, deoarece sursa de damage este wardul, nu Witch Doctor."],"riki":["Riki este invulnerabil și invizibil în timpul a Tricks of the Trade și nu poate fi dezvăluit în timpul vrăjii acesteia."],"sniper":["Shrapnelul lui Sniper nu afectează clădirile. Mai multe efecte de Shrapnel nu se suprapun pe aceeași țintă."],"necrolyte":["Abilitatea Ghost Shroud a lui Necrophos îl face imun la atacurile fizice, dar primește damage magic suplimentar cât timp se află în starea acesta.","Reaper's Scythe-ul lui Necrophos cauzează damage după o întârziere. Victima poate fi salvată dacă în timpul animației abilității Reaper's Scythe este vindecată sau dacă se află sub efecte care împiedică damage-ul."],"queenofpain":["Abilitatea Sonic Wave a Queen of Pain cauzează damage pur și nu poate fi redus de armură, rezistența la magie sau imunitatea la vrăji. În plus, va cauza damage și curierilor."],"venomancer":["Damage-ul de la Plague Wardurile lui Venomancer nu este afectat de blocarea de damage, cum ar fi cea de la un Stout Shield sau de la un Crimson Guard"],"skeleton_king":["Reincarnate-ul lui Wraith King se va declanșa chiar și atunci când acesta este afectat de Break. Nu se va declanșa dacă Wraith King nu are suficientă mana, dar un talent poate să reducă la 0 costul de mana al abilității."],"death_prophet":["Damage-ul de la spiritele din Exorcismul lui Death Prophet este de tip fizic și poate fi redus de armură."],"pugna":["Nether Blastul lui Pugna cauzează structurilor jumătate din damage."],"templar_assassin":["Abilitatea Refraction a lui Templar Assassin blochează un număr de instanțe de damage, indiferent de cât damage este cauzat de instanțele acelea."],"viper":["Nethertoxinul lui Viper aplică Break pe țintele afectate, fapt ce va dezactiva abilitățile pasive. Efectul acesta poate fi foarte bun împotriva eroilor ca Bristleback."],"luna":["Eclipse-ul Lunei va continua pentru toată durata, chiar dacă Luna este amuțită sau năucită, dar se va opri dacă Luna este ucisă."],"dragon_knight":["Corrosive Breath din Elder Dragon Formul lui Dragon Knight afectează structurile, cât și unitățile, așa că este o abilitate de asediu eficace.","Reducerea de damage din Breathe Fire-ul lui Dragon Knight este o metodă foarte eficace atunci când faci schimb de lovituri cu un adversar sau când vrei să reduci abilitatea adversarului de a aplica lovituri finale.","Motivul rezistenței sporite a lui Dragon Knight reiese din abilitatea sa pasivă, Dragon Blood, care îi oferă bonusuri pentru regenerarea de viață și armură, astfel încât acesta este vulnerabil la efectul de Break de la lucruri precum Nethertoxinul lui Viper sau un Silver Edge.","În timpul Dragon Formului, Dragon Knight devine un erou ranged, iar astfel poate beneficia de obiecte precum Hurricane Pike, dar va pierde bonusurile oferite de obiectele melee ca Echo Sabre.","Dragon Knight se bazează pe faptul că se poate apropia de inamici pentru a fi eficace. Abilitățile și obiectele care îl pot încetini, cum ar fi Shiva's Guard sau Rod of Atos, sunt foarte utile pentru a-l ține pe acesta la distanță.","Armura mare a lui Dragon Knight îl face extrem de rezistent la damage-ul fizic, dar acest fapt poate fi diminuat cu obiecte care reduc armura precum Assault Cuirass sau Medallion of Courage."],"rattletrap":["Battery Assaultul lui Clockwerk va continua chiar dacă acesta este amuțit sau năucit. Totuși, Battery Assaultul se va sfârși dacă Clockwerk este ucis.","Hookshotul lui Clockwerk năucește inamicii pentru o durată semnificativă de timp, astfel având suficient timp pentru a se repoziționa și a plasa Power Cogs în mod strategic pentru a-și muta inamicul în direcția dorită și a-l năuci și mai mult timp.","Un Force Staff este eficace pentru a scoate un erou aliat din Power Cogs ale lui Clockwerk.","Hookshotul îl va trage pe Clockwerk către orice unitate, inamică sau aliată, așa că abilitatea poate fi un mijloc eficace de a scăpa dintr-o situație periculoasă.","Battery Assaultul lui Clockwerk este extrem de bun la oprirea inamicilor cu vrăji care au concentrare sau durată de invocare lungă.","Rocket Flare-ul lui Clockwerk este foarte util pentru a căuta poziții adverse și pentru a împinge creepi inamici care sunt departe de echipa sa.","Black King Bar va împiedica cea mai mare parte a damage-ului cauzat de abilitățile lui Clockwerk. Totuși, Hookshotul său va mai năuci o țintă imună la magie."],"leshrac":["Diabolic Edictul lui Leshrac cauzează damage suplimentar structurilor, așa că este o abilitate de asediu eficace."],"life_stealer":["Abilitatea Open Wounds a lui Lifestealer face ca aliații acestuia să fure viață după orice atac, inclusiv după vrăji."],"dark_seer":["Ion Shellul lui Dark Seer va cauza damage unităților din apropiere chiar și atunci când sunt invizibile."],"clinkz":["Abilitatea Searing Arrows a lui Clinkz face ca atacurile sale să cauzeze mai mult damage fizic."],"omniknight":["Abilitatea de Purification a lui Omniknight cauzează damage pur, care nu poate fi redus de rezistența la magie."],"night_stalker":["Bonusurile pe timp de noapte ale lui Night Stalker se aplică și în timpul Eclipse a Lunei."],"jakiro":["Liquid Fire-ul lui Jakiro afectează clădirile, așa că este o abilitate de asediere eficace."],"batrider":["Sticky Napalmul lui Batrider cauzează victimei damage magic suplimentar atunci când este atacată de Batrider. Sticky Napalmul nu are niciun efect atunci când alte unități atacă ținta."],"spectre":["Abilitatea Dispersion a lui Spectre reflectă damage-ul primit înapoi către atacatori, având același tip ca damage-ul primit. Reflectă mai mult damage unităților care sunt mai apropiate de Spectre."],"ancient_apparition":["Ice Blastul lui Ancient Apparition împiedică efectele de vindecare ale unităților afectate. Dacă viața unei victime scade sub un procent critic, victima este ucisă."],"ursa":["Abilitatea Fury Swipes a lui Ursa cauzează damage fizic suplimentar atunci când atacă o țintă în mod repetat. Fury Swipes nu funcționează pe structuri, dar îl afectează pe Roshan."],"spirit_breaker":["Abilitatea Charge of Darkness a lui Spirit Breaker poate fi folosită pentru a declanșa Linken's Sphere-ul unui inamic de la orice distanță, cât timp Spirit Breaker vede ținta aceea."],"alchemist":["Aurul dobândit de Alchemist folosind Greevil's Greed este variabil.","Dacă este sincronizat corect, năucirea de la Unstable Concoctionul lui Alchemist poate fi evitată prin folosirea a Manta Style sau a Eul's Scepter of Divinity, chiar și de însuși Alchemist.","Dacă Alchemist este amuțit sau nu are vreun erou inamic pe care să-l țintească cu Unstable Concotion până în momentul în care abilitatea ajunge la apogeu, însuși Alchemist va fi năucit și va fi vulnerabil împotriva inamicilor.","Bonusul pentru runa de Bounty de la Greevil's Greedul lui Alchemist se aplică numai lui Alchemist și nu contează cine ridică runa.","Chemical Rage-ul lui Alchemist îi oferă o regenerare de viață masivă, dar care poate fi redusă cu Spirit Vessel sau cu Ice Blastul lui Ancient Apparition."],"invoker":["Sun Strike-ul lui Invoker cauzează damage pur, care nu poate fi redus de rezistența la magie sau de imunitatea la vrăji."],"obsidian_destroyer":["Arcane Orbul lui Outworld Devourer cauzează damage pur care nu poate redus de rezistența la magie, dar nu străpunge imunitatea la vrăji."],"lycan":["Abilitatea Howl a lui Lycan are o distanță globală, astfel afectând toți aliații indiferent unde s-ar afla. Abilitatea este mai eficace pe timp de noapte.","Shapeshiftul lui Lycan aplică lovituri critice și bonusuri pentru viteza de mișcare tuturor unităților controlate de Lycan, inclusiv cele invocate cu un Necronomicon."],"brewmaster":["Când Primal Splitul lui Brewmaster se termină, Brewmaster va încerca să reapară la poziția lui Earth, dacă e în viață, iar apoi la poziția lui Storm dacă acesta este în viață, iar în sfârșit, la poziția lui Fire dacă acesta este în viață.","După Primal Split, orice aură deținută de Brewmaster, precum aura oferită de Radiance sau Vladimir's Offering, afectează unitățile din împrejurul lui Earth. Dacă Earth este mort, le afectează pe cele din jurul lui Storm, iar dacă Storm este mort, pe cele din preajma lui Fire.","Primal Splitul lui Brewmaster are un timp de invocare substanțial, astfel încât abilitatea poate fi contracarată ușor cu năuciri sau amuțiri."],"lone_druid":["Spirit Bearul lui Lone Druit cauzează damage suplimentar structurilor, astfel încât acesta este foarte eficace când vine vorba de asediere.","Spirit Bearul lui Lone Druid poate ridica rune. Lone Druid nu trebuie să fie în apropiere pentru acest lucru."],"chaos_knight":["Când Chaos Knight invocă Phantasm, acesta evită proiectilele și devine invulnerabil și imun la vrăji pentru o durată scurtă de timp.","Chaos Boltul lui Chaos Knight are un timp de invocare semnificativ, dar mai este și un proiectil lent, astfel încât te poți feri de acesta folosind un Blink Dagger sau un Eul's Scepter of Divinity.","Activarea a Armlet of Mordiggian înainte de a folosi Phantasm oferă copiilor lui Chaos Knight damage și viață bonus.","Iluziile din Phantasmul lui Chaos Knight sunt susceptibile la orice abilitate care distruge instantaneu iluziile, precum Mana Drainul lui Lion sau Hexul lui Shadow Shaman.","Reality Riftul lui Chaos Knight are un timp de invocare substanțial, așa că te poți feri de abilitate după ce se începe invocarea acesteia.","Majoritatea damage-ului de la Chaos Knight este fizic, așa că poți să faci față acestuia dacă folosești obiecte care oferă armură sau un Ghost Scepter.","Reality Riftul lui Chaos Knight va aduce toate iluziile sale, chiar și pe cele de la Manta Style sau de la runa de Illusion."],"meepo":["Meepo primește XP sau aur oricând una dintre clonele sale primește XP sau aur. Meepo moare oricând oricare dintre clonele sale moare."],"undying":["Tombstone-ul Undying nu creează zombi pentru unitățile invizibile din apropiere, iar zombi vor expira dacă unitatea pe care o urmăresc devine invizibilă."],"rubick":["Când Rubick invocă o vrajă furată, aceasta de obicei nu are un timp de invocare, chiar dacă vraja ar avea unul (cu câteva excepții)."],"disruptor":["Thunder Strike-ul lui Disruptor pulsează la fiecare două secunde, iar Glimpse mută ținta în locul unde era în urmă cu patru secunde. Astfel, te poți folosi de Thunder Strike pentru a sincroniza perfect un Glimpse."],"nyx_assassin":["Spiked Carapace-ul lui Nyx Assassin va reflecta damage-ul indiferent de cât de departe este atacatorul sau dacă acesta este invizibil."],"naga_siren":["Naga Siren este invulnerabilă, imună la vrăji și va evita proiectile pentru o scurtă durată atunci când folosește Mirror Image.","Song of Sirenul lui Naga Siren nu adoarme inamicii imuni la vrăji, astfel încât abilitatea poate fi folosită pentru a separa un singur erou inamic imun la vrăji de echipa sa."],"visage":["Abilitatea Gravekeeper's Cloak a lui Visage e mai puțin eficace cu cât acesta încasează mai mult damage de la alți jucători, dar se va regenera rapid. Gravekeeper's Cloak mai afectează și Familiarii lui Visage.","Visage are o rezistență la magie de bază de 10%, mai mică decât majoritatea eroilor, aceștia având 25%. Acest fapt face ca Visage să fie extrem de vulnerabil împotriva damage-ului magic dacă Gravekeeper's Cloak este eliminat."],"slark":["Cât timp Slark este sub efectul Shadow Dance, acesta nu poate fi dezvăluit de True Sight."],"medusa":["Mystic Snake-ul Medusei își mărește succesiv damage-ul și furtul de mana după fiecare salt. Mana furată este un procentaj din mana din prezent a țintei."],"shredder":["Când Timbersaw este afectat de Break, nu va primi suprapuneri suplimentare de la Reactive Armor, dar suprapunerile existente vor continua să ofere armură și regenerare de viață."],"bristleback":["Când Bristleback este afectat de Break, abilitatea sa de Bristleback este dezactivată, reducându-i în mod simțitor speranța de viață.","Dacă Viscous Nasal Goo-ul lui Bristleback este îmbunătățit de Aghanim's Scepter, această abilitate nu va mai fi blocată de Linken's Sphere.","Bristleback poate invoca de mai multe ori Viscous Nasal Goo pe inamici, astfel reducându-le viteza de mișcare și armura în mod semnificativ. Drept urmare, abilitatea aceasta este eficace când este folosită împotriva lui Roshan.","Prin împiedicarea lui Bristleback din a folosi în mod constant abilitatea Quill Spray, cum ar fi prin folosirea unei amuțiri, vei reduce astfel damage-ul pe care Bristleback îl poate cauza.","Damage-ul din Quill Spray-ul lui Bristleback este fizic și poate fi redus folosind armura.","Lui Bristleback îi place să invoce vrăji, așa că un Magic Stick sau un Magic Wand ar fi extrem de util când e folosit împotriva lui."],"tusk":["Snowballul lui Tusk cauzează mai mult damage cu cât mai mulți eroi sunt în acesta."],"skywrath_mage":["Arcane Boltul lui Skywrath Mage cauzează cu mult mai mult damage în funcție de intelligence-ul lui Skywrath."],"abaddon":["Borrowed Time-ul lui Abaddon mai poate fi activat manual atunci când acesta este afectat de Break.","Abaddon își poate folosi abilitatea Aphotic Shield pentru a înlătura cele mai multe debuffuri și năuciri aplicate eroilor aliați.","Debufful din Curse of Avernusul lui Abaddon este aplicat clădirilor, astfel încât acesta este foarte eficace când vine vorba de asediere.","Borrowed Time-ul lui Abaddon poate fi activat manual, chiar și atunci când ești năucit sau adormit, abilitatea înlăturând majoritatea debuffurilor.","Dacă Abaddon primește mai mult decât pragul pasiv de damage, atunci efectul abilității Borrowed Time nu se va activa în mod automat.","O metodă eficace de a-l ține pe Abaddon în loc fără să primească damage după ce acesta folosește Borrowed Time este utilizarea unui Eul's Scepter of Divinity.","Aphotic Shieldul lui Abaddon nu va cauza damage unităților pe care acesta nu le vede. Drept consecință, poți folosi ceața războiului sau invizibilitatea pentru a evita damage-ul."],"elder_titan":["Natural Orderul lui Elder Titan face ca inamicii din jurul acestuia să aibă armura redusă și rezistența la magie redusă în jurul Spiritului lui Elder Titan."],"legion_commander":["În timp ce Duelul lui Legion Commander străpunge imunitatea la vrăji de la un Black King Bar, un Linken's Sphere va împiedica duelul întrutotul."],"ember_spirit":["Searing Chainsurile lui Ember Spirit pot întrerupe o țintă care se concentrează, spre exemplu, un inamic care încearcă să scape cu un Town Portal Scroll."],"abyssal_underlord":["Abilitatea Firestorm a lui Underlord cauzează un procentaj din viața maximă a victimei ca damage magic după fiecare val, astfel încât abilitatea aceasta este extrem de eficace împotriva anumitor eroi."],"winter_wyvern":["Fragmentele din Splinter Blastul lui Winter Wyvern vor lovi unitățile invizibile, cât și pe cele aflate în ceața războiului."],"arc_warden":["Magnetic Fieldul lui Arc Warden oferă evasion aliaților aflați în câmp împotriva atacurilor din afara acestuia, inclusiv de la atacurile turnurilor.","Magnetic Fieldul lui Arc Warden oferă evasion clădirilor aliate aflate în interiorul câmpului.","Damage-ul și încetinirea de la Fluxul lui Arc Warden pot fi evitate dacă stai lângă o unitate aliată."],"monkey_king":["Boundless Strike-ul lui Monkey King ignoră evasionul și nu poate rata ținta."],"axe":["Berserker Callul lui Axe ignoră imunitatea la vrăji, așa că devine util la oprirea în loc a inamicilor care folosesc Black King Bar.","Folosirea unui Eul's Scepter pe Axe după ce folosește Berserker's Call este o metodă bună de a reduce damage-ul pe care aliații tăi l-ar primi de la Counter Helixul său.","Axe primește viteză de mișcare bonus pentru fiecare inamic care este afectat de Battle Hunger. Acest fapt include creepii inamici și neutri.","Iluziile lui Axe de la runa de Illusion sau Manta Style, de exemplu, au un Counter Helix de putere maximă.","Culling Blade-ul lui Axe poate ucide țintele chiar și prin Shallow Grave-ul lui Dazzle sau False Promise-ul lui Oracle.","Culling Blade-ul lui Axe poate fi folosit pentru a ucide curierul."],"beastmaster":["Inner Beastul lui Beastmaster afectează eroii aliați, cât și creepii și unitățile invocate. Unitățile create cu Necronomicon sau cu Helm of the Dominator beneficiază foarte mult de aura aceasta.","Un descântec puternic, precum Aeon Disk sau Aphotic Shieldul lui Abaddon, poate fi folosit pentru a înlătura năucirea de la Primal Roarul lui Beastmaster."],"doom_bringer":["Devour îi va oferi lui Doom nu numai abilitatea activă a unității țintă, dar și abilitățile pasive și aurele; Doom este astfel indispensabil în luptele în echipă.","Un Linken's Sphere este o metodă grozavă de a bloca Doomul lui Doom. Doom poate contracara acest obiect prin devorarea unei unități cu o abilitate care necesită țintire, cum ar fi un Satyr Banisher sau prin achiziționarea unui obiect cu o abilitate activă precum Heaven's Halberd.","Un erou afectat de Doom poate fi ucis de aliații acestuia atunci când viața sa este foarte redusă. Acest fapt va nega aurul și experiența lui Doom pentru acea ucidere.","Îmbunătățirea lui Doom cu un Aghanim's Scepter va aplica un efect de Break pe țintă, abilitatea devenind astfel extrem de eficientă împotriva inamicilor care au abilități pasive puternice, cum ar fi Phantom Assassin sau Spirit Breaker."],"centaur":["Double Edge-ul lui Centaur Warrunner cauzează damage magic care poate fi redus de rezistența la magie, atât de inamici, cât și de Centaur.","Rod of Atos sau Eul's Scepter este o metodă bună de a-i opri pe aliații lui Centaur să scape atunci când folosește Stampede.","Centaur are o cantitate de viață considerabilă, așa că abilitățile care cauzează damage în funcție de viața adversarului, cum ar fi Feastul lui Lifestealer sau Hearthstopper Aura a lui Necrophos, sunt foarte eficace.","Imunitatea la magie, precum cea de la un Black King Bar, este eficace pentru evitarea unei părți semnificative din damage-ul lui Centaur Warrunner provenit de la combinația de Stampede, Double Edge și Hoof Stomp."],"earth_spirit":["Earth Spirit poate folosi obiecte și abilități în timpul a Rolling Boulder, astfel încât acesta are posibilitatea de a pregăti atacuri viitoare.","Dacă Earth Spirit vrea să scape folosind Rolling Boulder, atunci sari în fața lui ca să-l oprești.","Cu o sincronizare precisă, Earth Spirit poate folosi același Stone Remnant pentru a năuci și amuți un inamic, astfel păstrând un Stone Remnant pentru o utilizare ulterioară.","Folosirea Boulder Smash-ului pe aliați poate fi o metodă eficace de a-i scăpa cu viață sau de a-i repoziționa într-un loc avantajos pe aceștia.","Îmbunătățirea abilității Geomagnetic Grip cu talentul respectiv va face ca Earth Spirit să-și poată salva aliații cu ușurință atunci când aceștia au nevoie.","Enchant Remnant face ca ținta să fie invulnerabilă pentru o durată scurtă, astfel permițându-i lui Earth Spirit să folosească abilitatea pentru a-și salva aliații atunci când aceștia sunt în pericol."],"crystal_maiden":["Crystal Novaul lui Crystal Maiden oferă puțină vedere asupra zonei unde este țintită abilitatea și poate fi foarte util pentru a verifica zone ascunse sau în căutarea inamicilor care încearcă să scape folosindu-se de copaci.","Ca majoritatea înrădăcinărilor, Frostbite-ul lui Crystal Maiden poate fi contracarat prin folosirea de descântece de la obiecte precum Eul's Scepter of Divinity sau Manta Style."],"drow_ranger":["Abilitatea Gust a lui Drow Ranger nu năucește unități inamice și nu oprește obiecte care implică concentrare, precum Town Portal Scroll. Eroii inamici care sunt împinși de Gust mai pot folosi obiecte și ataca.","Drow Ranger se bazează pe menținerea unei distanțe față de inamici, astfel încât aceasta este vulnerabilă la inițieri cu Blink Dagger sau cu Shadow Blade."],"morphling":["Morphling poate folosi obiecte și abilități în timpul Waveformului, cum ar fi Ethereal Blade sau Town Portal Scroll.","După ce se întoarce din Morph, viața și mana lui Morphling se resetează la valorile de dinainte de Morph.","Abilitățile care anulează vindecarea, precum Ice Blastul lui Ancient Apparition, îl vor împiedica pe Morphling de la a primi viață atunci când își modifică atributele."],"oracle":["Fortune's Endul lui Oracle poate descânta multe buffuri de pe eroii inamici, inclusiv efectul de vindecare de la Purifying Flames.","False Promise-ul lui Oracle dublează vindecarea oferită țintei cât timp abilitatea este activă. Vindecarea include obiecte precum Urn of Shadows, Magic Wand și Mekansm.","În timpul False Promise-ului lui Oracle, sfera de deasupra capului va fi de culoare roșie dacă ținta a primit damage letal, astfel prezicând moartea acesteia atunci când efectul expiră."],"nevermore":["Shadow Fiend are probleme cu viața sa relativ mică și cu mobilitatea. Acesta poate fi o prioritate pentru inamicii care pot cauza damage semnificativ într-o durată scurtă de timp.","Requiem of Souls al lui Shadow Fiend are un timp de invocare relativ lung și poate fi anulat de către inamici sau chiar de însuși Shadow Fiend, fără ca abilitatea să intre în cooldown sau să coste mana.","Dacă un Shadow Fiend cauzează prea mult damage, atunci înseamnă că acesta este extrem de slab împotriva unui Blade Mail folosit de echipa inamică."],"pudge":["Pudge poate să-și folosească Meat Hookul pentru a aduce rune pe care să le folosească sau pe care să le lase într-o locație sigură pentru coechipierii săi.","Meat Hookul lui Pudge va repoziția și cauza damage în continuare țintelor imune la vrăji, dar dacă ținta este imună la vrăji, aceasta poate să-și folosească obiectele și vrăjile cu concentrare în continuare, fără ca acestea să fie întrerupte.","Rotul lui Pudge cauzează damage magic inamicului, cât și acestuia. Pudge de obicei alege să investească în obiecte care oferă rezistență la vrăji pentru a reduce damage-ul cauzat sieși.","Meat Hookul lui Pudge afectează aliații fără să le cauzeze damage, astfel încât acesta poate fi folosit pentru a trage aliații în siguranță.","Cu o sincronizare atentă, Rotul lui Pudge poate fi folosit pentru ca Pudge să se sinucidă, astfel negând adversarilor recompensa prețioasă în aur și experiență.","Efectul audio al abilității Dismember poate fi auzit de către oricine, chiar dacă Pudge este ascuns, astfel încât poți ghici ceea ce face Pudge.","Abilitatea Dismember a lui Pudge năucește în continuare ținta dacă aceasta este imună la vrăji, dar cu toate acestea, abilitatea nu va cauza damage.","Pudge are în mod normal o armură redusă, astfel încât multe atacuri fizice, în special cele folosite cu abilități care reduc armura, pot fi fatale pentru eroul acesta.","Dismemberul lui Pudge poate fi întrerupt cu un descântec puternic aplicat țintei, precum Aphotic Shieldul lui Abaddon sau Press the Attackul lui Legion Commander."],"razor":["Plasma Fieldul îi oferă vedere lui Razor, astfel încât acesta poate vedea inamici care se ascund între copaci sau în partea de sus a dealurilor.","Nimic nu poate rupe Static Linkul lui Razor, așa că este extrem de important să ieși cât mai repede cu putință din raza de acțiune a acesteia.","Prin invocarea unui Eye of the Storm o a doua oară, în timp ce invocarea anterioară mai este activă, de exemplu prin folosirea unui Refresher Orb, se va crea o nouă furtună care va fi concomitentă cu prima."],"sven":["Sven se bazează pe faptul că se poate apropia de inamici pentru a cauza cantități masive de damage. Dacă i se limitează mobilitatea cu obiecte precum Rod of Atos sau abilități precum Sproutul lui Nature's Prophet, abilitatea sa de a cauza damage în timpul a God's Strength va fi redusă semnificativ.","Evitarea atacurilor lui Sven folosind surse de evasion, precum Butterfly sau Solar Crest, sau prin obținerea de imunitate la atacuri fizice, cum ar fi cu un Ghost Scepter, sunt metode eficace de a contracara damage-ul lui Sven.","God Strength-ul lui Sven este util nu numai în luptele în echipă, dar și la atacarea de obiective precum a turnurilor sau a lui Roshan."],"tiny":["Damage-ul colateral de la Tree Grabul lui Tiny este afectat de armură, de furtul de viață al vrăjilor, cât și de amplificarea damage-ului.","La începutul meciului, Tiny se bazează pe damage-ul magic. Infused Raindrops va ajuta la reducerea unui procentaj semnificativ al acelui damage.","Potențialul de damage masiv instantaneu al lui Tiny poate fi redus, oarecum, folosind obiecte precum Aeon Disk.","Tiny are o viteză de atac foarte lentă și se bazează pe obiecte și buffuri de la aliați pentru viteza de atac ca să-și mențină damage-ul cauzat la un nivel ridicat."],"huskar":["Life Breakul lui Huskar aplică o descântare standard și imunitate la vrăji în timpul saltului."]}}